---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalSurfaceBase Properties
AnalyticalSurfaceBase Class See Also Send Feedback
---

The AnalyticalSurfaceBase type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | SketchId | Sketch associated to this Revit element. |

# See Also

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace