---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EnergyAnalysisConstruction Methods
EnergyAnalysisConstruction Class See Also Send Feedback
---

The EnergyAnalysisConstruction type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetMaterialIds()()()() | Returns a list of ids of the associated materials to analytical construction. |

# See Also

EnergyAnalysisConstruction Class

Autodesk.Revit.DB.Analysis Namespace