---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalEquipmentLoadData Properties
AnalyticalEquipmentLoadData Class See Also Send Feedback
---

The AnalyticalEquipmentLoadData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApparentLoad | The electrical apparent load of analytical equipment load. |
|  | Current | The current of the analytical equipment load. |
|  | LoadClassification | The load classification of analytical equipment load. |
|  | LoadSet | The electrical analytical load set of the analytical equipment load. |
|  | LoadType | The load type of analytical equipment load. |
|  | PowerFactor | The power factor of analytical equipment load. |
|  | TrueLoad | The electrical true load of analytical equipment load. |
|  | Voltage | The voltage of the analytical equipment load. |

# See Also

AnalyticalEquipmentLoadData Class

Autodesk.Revit.DB.Electrical Namespace