---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternallyTaggedNonBRep Methods
ExternallyTaggedNonBRep Class See Also Send Feedback
---

The ExternallyTaggedNonBRep type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | SetUsage | Controls the usage of this ExternallyTaggedNonBRep. |

# See Also

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace