---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FaceSplitter Properties
FaceSplitter Class See Also Send Feedback
---

The FaceSplitter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | SplitElementId | The id of the element whose face is split by this element. |

# See Also

FaceSplitter Class

Autodesk.Revit.DB Namespace