---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AirSystemData Methods
AirSystemData Class See Also Send Feedback
---

The AirSystemData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

AirSystemData Class

Autodesk.Revit.DB.Mechanical Namespace