---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralSectionConcreteT Properties
StructuralSectionConcreteT Class See Also Send Feedback
---

The StructuralSectionConcreteT type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CantileverHeight | Flange cantilever thickness. |
|  | CantileverLength | Flange cantilever length. |

# See Also

StructuralSectionConcreteT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace