---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementSetIterator Properties
ElementSetIterator Class See Also Send Feedback
---

The ElementSetIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

ElementSetIterator Class

Autodesk.Revit.DB Namespace