---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportLinetypeKey Methods
ExportLinetypeKey Class See Also Send Feedback
---

The ExportLinetypeKey type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ExportLinetypeKey Class

Autodesk.Revit.DB Namespace