---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuctSizeSettings Properties
DuctSizeSettings Class See Also Send Feedback
---

The DuctSizeSettings type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Item | Get the DuctSizes for this DuctShape. |

# See Also

DuctSizeSettings Class

Autodesk.Revit.DB.Mechanical Namespace