---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IntersectionResultArrayIterator Properties
IntersectionResultArrayIterator Class See Also Send Feedback
---

The IntersectionResultArrayIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

IntersectionResultArrayIterator Class

Autodesk.Revit.DB Namespace