---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuctPressureDropData Methods
DuctPressureDropData Class See Also Send Feedback
---

The DuctPressureDropData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

DuctPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace