---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EnergyAnalysisDetailModelOptions Methods
EnergyAnalysisDetailModelOptions Class See Also Send Feedback
---

The EnergyAnalysisDetailModelOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace