---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralInstanceUsageFilter Properties
StructuralInstanceUsageFilter Class See Also Send Feedback
---

The StructuralInstanceUsageFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | StructuralUsage | The family instance structural usage. |

# See Also

StructuralInstanceUsageFilter Class

Autodesk.Revit.DB.Structure Namespace