---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SymbolicCurve Methods
SymbolicCurve Class See Also Send Feedback
---

The SymbolicCurve type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the symbolic curve. |
|  | SetVisibility | Sets the visibility for the symbolic curve. |

# See Also

SymbolicCurve Class

Autodesk.Revit.DB Namespace