---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FlexDuct Methods
FlexDuct Class See Also Send Feedback
---

The FlexDuct type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible duct into the document, using a point array and flexible duct type. |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible duct into the document, using a point array and flexible duct type. |
|  | IsFlexDuctTypeId | Checks if given type is valid flexible duct type. |
|  | IsHVACSystemTypeId | Checks if given type is valid HVAC system type. |

# See Also

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace