---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralSectionGeneralLA Properties
StructuralSectionGeneralLA Class See Also Send Feedback
---

The StructuralSectionGeneralLA type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | LipLength | Lip segment length. |

# See Also

StructuralSectionGeneralLA Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace