---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DockablePaneProviderData Methods
DockablePaneProviderData Class See Also Send Feedback
---

The DockablePaneProviderData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetFrameworkElement | Wrapper function that returns the FrameworkElement for this provider. |

# See Also

DockablePaneProviderData Class

Autodesk.Revit.UI Namespace