---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralConnectionHandlerType Properties
StructuralConnectionHandlerType Class See Also Send Feedback
---

The StructuralConnectionHandlerType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionGuid | The GUID to use for identifying connection geometry generation algorithm. |

# See Also

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace