---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SystemZoneData Methods
SystemZoneData Class See Also Send Feedback
---

The SystemZoneData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a system-zone data domain class. |

# See Also

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace