---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CustomInitialColor Properties
CustomInitialColor Class See Also Send Feedback
---

The CustomInitialColor type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Temperature | The custom color temperature value. |

# See Also

CustomInitialColor Class

Autodesk.Revit.DB.Lighting Namespace