---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FunctionId Methods
FunctionId Class See Also Send Feedback
---

The FunctionId type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object. |

# See Also

FunctionId Class

Autodesk.Revit.Exceptions Namespace