---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementIntersectsSolidFilter Methods
ElementIntersectsSolidFilter Class See Also Send Feedback
---

The ElementIntersectsSolidFilter type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetSolid | Gets the target solid geometry. |

# See Also

ElementIntersectsSolidFilter Class

Autodesk.Revit.DB Namespace