---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IMultiServerService Methods
IMultiServerService Interface See Also Send Feedback
---

The IMultiServerService type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | CanExecute | Implement this to test whether a particular server should be executed. |

# See Also

IMultiServerService Interface

Autodesk.Revit.DB.ExternalService Namespace