---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LinkConversionData Methods
LinkConversionData Class See Also Send Feedback
---

The LinkConversionData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetOptions | Extra information used during the creation of the Revit document. |

# See Also

LinkConversionData Class

Autodesk.Revit.DB Namespace