---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyTime Properties
AssetPropertyTime Class See Also Send Feedback
---

The AssetPropertyTime type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property |

# See Also

AssetPropertyTime Class

Autodesk.Revit.DB.Visual Namespace