---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricWireType Properties
FabricWireType Class See Also Send Feedback
---

The FabricWireType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | BendDiameter | Determines the bending diameter of the wire. |
|  | WireDiameter | Determines the diameter of the wire. |

# See Also

FabricWireType Class

Autodesk.Revit.DB.Structure Namespace