---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
InSessionViewSheetSet Methods
InSessionViewSheetSet Class See Also Send Feedback
---

The InSessionViewSheetSet type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

InSessionViewSheetSet Class

Autodesk.Revit.DB Namespace