---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StdPostedWarning Methods
StdPostedWarning Class See Also Send Feedback
---

The StdPostedWarning type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

StdPostedWarning Class

Autodesk.Revit.DB Namespace