---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralElementDefinitionData Methods
StructuralElementDefinitionData Class See Also Send Feedback
---

The StructuralElementDefinitionData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace