---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternallyTaggedBRep Methods
ExternallyTaggedBRep Class See Also Send Feedback
---

The ExternallyTaggedBRep type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetTaggedGeometry | Returns the externally tagged geometry object. |

# See Also

ExternallyTaggedBRep Class

Autodesk.Revit.DB Namespace