---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FilterDialog Methods
FilterDialog Class See Also Send Feedback
---

The FilterDialog type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Show | Shows the FilterDialog editing dialog to the user. |

# See Also

FilterDialog Class

Autodesk.Revit.UI Namespace