---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportPatternKey Constructor
ExportPatternKey Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ExportPatternKey()()()() | Constructs a new default ExportPatternKey. |
|  | ExportPatternKey(ExportPatternKey) | Constructs a new copy of the input ExportPatternKey object. |
|  | ExportPatternKey(FillPatternTarget, String) | Constructs a new ExportPatternKey using the original fill pattern type and name as input. |

# See Also

ExportPatternKey Class

ExportPatternKey Members

Autodesk.Revit.DB Namespace