---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPCalculationServerInfo Methods
MEPCalculationServerInfo Class See Also Send Feedback
---

The MEPCalculationServerInfo type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetMEPCalculationServerInfo | Gets a MEPCalculationServerInfo by family instance. |

# See Also

MEPCalculationServerInfo Class

Autodesk.Revit.DB Namespace