---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
InitialIlluminanceIntensity Properties
InitialIlluminanceIntensity Class See Also Send Feedback
---

The InitialIlluminanceIntensity type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Distance | The illuminance intensity distance value. |
|  | Illuminance | The illuminance intensity value. |

# See Also

InitialIlluminanceIntensity Class

Autodesk.Revit.DB.Lighting Namespace