---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPAnalyticalSystem Properties
MEPAnalyticalSystem Class See Also Send Feedback
---

The MEPAnalyticalSystem type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AnalyticalSystemDomain | The type of analytical system. |

# See Also

MEPAnalyticalSystem Class

Autodesk.Revit.DB.Mechanical Namespace