---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WorksetFilter Methods
WorksetFilter Class See Also Send Feedback
---

The WorksetFilter type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

WorksetFilter Class

Autodesk.Revit.DB Namespace