---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CameraInfo Methods
CameraInfo Class See Also Send Feedback
---

The CameraInfo type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

CameraInfo Class

Autodesk.Revit.DB Namespace