---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SymbolicCurveArrayIterator Properties
SymbolicCurveArrayIterator Class See Also Send Feedback
---

The SymbolicCurveArrayIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

SymbolicCurveArrayIterator Class

Autodesk.Revit.DB Namespace