---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IntegerRange Methods
IntegerRange Class See Also Send Feedback
---

The IntegerRange type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

IntegerRange Class

Autodesk.Revit.DB Namespace