---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BoundingBoxUV Methods
BoundingBoxUV Class See Also Send Feedback
---

The BoundingBoxUV type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

BoundingBoxUV Class

Autodesk.Revit.DB Namespace