---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuplicateTypeNamesHandlerArgs Methods
DuplicateTypeNamesHandlerArgs Class See Also Send Feedback
---

The DuplicateTypeNamesHandlerArgs type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetTypeIds | Returns ids of the types with duplicate names. |

# See Also

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace