---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PrintSetting Properties
PrintSetting Class See Also Send Feedback
---

The PrintSetting type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Name | Returns the Name of Print Setup. (Overrides Element..::..Name.) |
|  | PrintParameters | Returns the Parameters of Print Setup. |

# See Also

PrintSetting Class

Autodesk.Revit.DB Namespace