---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationSaveJobOptions Methods
FabricationSaveJobOptions Class See Also Send Feedback
---

The FabricationSaveJobOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

FabricationSaveJobOptions Class

Autodesk.Revit.DB.Fabrication Namespace