---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TilePatterns Methods
TilePatterns Class See Also Send Feedback
---

The TilePatterns type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetTilePattern | Retrieve a TilePattern object from a built-in type. |

# See Also

TilePatterns Class

Autodesk.Revit.DB Namespace