---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PointNode Methods
PointNode Class See Also Send Feedback
---

The PointNode type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetPoint | Returns the point object corresponding to the node. |

# See Also

PointNode Class

Autodesk.Revit.DB Namespace