---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ShapeBuilder Methods
ShapeBuilder Class See Also Send Feedback
---

The ShapeBuilder type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ShapeBuilder Class

Autodesk.Revit.DB Namespace