---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IndexPoint Properties
IndexPoint Class See Also Send Feedback
---

The IndexPoint type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Index | The index of the point's vertex. |

# See Also

IndexPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace