---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralSectionConcreteCross Properties
StructuralSectionConcreteCross Class See Also Send Feedback
---

The StructuralSectionConcreteCross type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CantileverHeight | Flange cantilever thickness. |
|  | CantileverLength | Flange cantilever length. |

# See Also

StructuralSectionConcreteCross Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace