---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BoundingBoxIntersectsFilter Methods
BoundingBoxIntersectsFilter Class See Also Send Feedback
---

The BoundingBoxIntersectsFilter type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundingBox | Gets the outline being used for this filter. |

# See Also

BoundingBoxIntersectsFilter Class

Autodesk.Revit.DB Namespace