---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
NumericRevisionSettings Constructor
NumericRevisionSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | NumericRevisionSettings()()()() | Constructs a NumericRevisionSettings with a simple, default numbering sequence. |
|  | NumericRevisionSettings(NumericRevisionSettings) | Constructs a new copy of the input NumericRevisionSettings object. |
|  | NumericRevisionSettings(Int32, String, String) | Constructs a NumericRevisionSettings object. |

# See Also

NumericRevisionSettings Class

NumericRevisionSettings Members

Autodesk.Revit.DB Namespace