---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VoltageTypeSetIterator Properties
VoltageTypeSetIterator Class See Also Send Feedback
---

The VoltageTypeSetIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

VoltageTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace