---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarCoverType Methods
RebarCoverType Class See Also Send Feedback
---

The RebarCoverType type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new CoverType in the document. |

# See Also

RebarCoverType Class

Autodesk.Revit.DB.Structure Namespace