---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuctLiningType Properties
DuctLiningType Class See Also Send Feedback
---

The DuctLiningType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Roughness | The roughness of Duct Lining. |

# See Also

DuctLiningType Class

Autodesk.Revit.DB.Mechanical Namespace