---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Ceiling Properties
Ceiling Class See Also Send Feedback
---

The Ceiling type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | SketchId | Returns id of the sketch. |

# See Also

Ceiling Class

Autodesk.Revit.DB Namespace