---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CurveNode Methods
CurveNode Class See Also Send Feedback
---

The CurveNode type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetCurve | Returns the geometric curve object corresponding to the node. |

# See Also

CurveNode Class

Autodesk.Revit.DB Namespace