---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyStructuralMaterialTypeFilter Properties
FamilyStructuralMaterialTypeFilter Class See Also Send Feedback
---

The FamilyStructuralMaterialTypeFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialType | The family structural material type. |

# See Also

FamilyStructuralMaterialTypeFilter Class

Autodesk.Revit.DB.Structure Namespace