---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewPrintingEventArgs Methods
ViewPrintingEventArgs Class See Also Send Feedback
---

The ViewPrintingEventArgs type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetSettings | Get the print settings of the active printing session. |

# See Also

ViewPrintingEventArgs Class

Autodesk.Revit.DB.Events Namespace