---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarSystemSpanSymbol Methods
RebarSystemSpanSymbol Class See Also Send Feedback
---

The RebarSystemSpanSymbol type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarSystemSpanSymbol in the project. |

# See Also

RebarSystemSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace