---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RectangleLightShape Constructor
RectangleLightShape Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | RectangleLightShape()()()() | Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width. |
|  | RectangleLightShape(RectangleLightShape) | Creates a copy of the given rectangle light shape |
|  | RectangleLightShape(Double, Double) | Creates a rectangle light shape object with the given emit length and width. |

# See Also

RectangleLightShape Class

RectangleLightShape Members

Autodesk.Revit.DB.Lighting Namespace