---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Macro Methods
Macro Class See Also Send Feedback
---

The Macro type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Execute | Executes the macro. |

# See Also

Macro Class

Autodesk.Revit.DB.Macros Namespace