---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementDesignOptionFilter Properties
ElementDesignOptionFilter Class See Also Send Feedback
---

The ElementDesignOptionFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DesignOptionId | The design option id. |

# See Also

ElementDesignOptionFilter Class

Autodesk.Revit.DB Namespace