---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyDouble Methods
AssetPropertyDouble Class See Also Send Feedback
---

The AssetPropertyDouble type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

# See Also

AssetPropertyDouble Class

Autodesk.Revit.DB.Visual Namespace