---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementTypeDuplicatingEventArgs Properties
ElementTypeDuplicatingEventArgs Class See Also Send Feedback
---

The ElementTypeDuplicatingEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ElementTypeId | The id of the ElementType to be duplicated. |

# See Also

ElementTypeDuplicatingEventArgs Class

Autodesk.Revit.DB.Events Namespace