---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FileOpenDialog Properties
FileOpenDialog Class See Also Send Feedback
---

The FileOpenDialog type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ShowPreview | Identifies if the dialog should include a region showing a preview of the selected file. |

# See Also

FileOpenDialog Class

Autodesk.Revit.UI Namespace