---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportLayerKey Methods
ExportLayerKey Class See Also Send Feedback
---

The ExportLayerKey type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ExportLayerKey Class

Autodesk.Revit.DB Namespace