---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SolidOptions Methods
SolidOptions Class See Also Send Feedback
---

The SolidOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

SolidOptions Class

Autodesk.Revit.DB Namespace