---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TessellatedFace Methods
TessellatedFace Class See Also Send Feedback
---

The TessellatedFace type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBoundaryLoops | Get loops bounding the face. |

# See Also

TessellatedFace Class

Autodesk.Revit.DB Namespace