---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PaperSourceSetIterator Properties
PaperSourceSetIterator Class See Also Send Feedback
---

The PaperSourceSetIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

PaperSourceSetIterator Class

Autodesk.Revit.DB Namespace