---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
APIObject Methods
APIObject Class See Also Send Feedback
---

The APIObject type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. |

# See Also

APIObject Class

Autodesk.Revit.DB Namespace