---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SharedParameterElement Properties
SharedParameterElement Class See Also Send Feedback
---

The SharedParameterElement type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | GuidValue | The Guid that identifies this shared parameter. |

# See Also

SharedParameterElement Class

Autodesk.Revit.DB Namespace