---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportFontKey Methods
ExportFontKey Class See Also Send Feedback
---

The ExportFontKey type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ExportFontKey Class

Autodesk.Revit.DB Namespace