---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExtrusionRoof Properties
ExtrusionRoof Class See Also Send Feedback
---

The ExtrusionRoof type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof. |

# See Also

ExtrusionRoof Class

Autodesk.Revit.DB Namespace