---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PreDocEventArgs Properties
PreDocEventArgs Class See Also Send Feedback
---

The PreDocEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document associated with the event. |

# See Also

PreDocEventArgs Class

Autodesk.Revit.DB.Events Namespace