---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GBXMLExportOptions Methods
GBXMLExportOptions Class See Also Send Feedback
---

The GBXMLExportOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

GBXMLExportOptions Class

Autodesk.Revit.DB Namespace