---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FaceSilhouetteNode Methods
FaceSilhouetteNode Class See Also Send Feedback
---

The FaceSilhouetteNode type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetFace | Returns the Face object corresponding to the node. |

# See Also

FaceSilhouetteNode Class

Autodesk.Revit.DB Namespace