---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentReloadedLatestEventArgs Properties
DocumentReloadedLatestEventArgs Class See Also Send Feedback
---

The DocumentReloadedLatestEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Location | Full path of the central model which is to be operated. |

# See Also

DocumentReloadedLatestEventArgs Class

Autodesk.Revit.DB.Events Namespace