---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ModelCurveArrArrayIterator Properties
ModelCurveArrArrayIterator Class See Also Send Feedback
---

The ModelCurveArrArrayIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

ModelCurveArrArrayIterator Class

Autodesk.Revit.DB Namespace