---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CancellationListener Methods
CancellationListener Class See Also Send Feedback
---

The CancellationListener type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsCancelled | Returns true if the operation associated with this instance has been cancelled. |

# See Also

CancellationListener Class

Autodesk.Revit.DB Namespace