---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayVectorSettings Methods
AnalysisDisplayVectorSettings Class See Also Send Feedback
---

The AnalysisDisplayVectorSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two vector settings objects. |

# See Also

AnalysisDisplayVectorSettings Class

Autodesk.Revit.DB.Analysis Namespace