---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyInteger Properties
AssetPropertyInteger Class See Also Send Feedback
---

The AssetPropertyInteger type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

# See Also

AssetPropertyInteger Class

Autodesk.Revit.DB.Visual Namespace