---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DetailCurveArrayIterator Properties
DetailCurveArrayIterator Class See Also Send Feedback
---

The DetailCurveArrayIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

DetailCurveArrayIterator Class

Autodesk.Revit.DB Namespace