---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
UISaveAsOptions Methods
UISaveAsOptions Class See Also Send Feedback
---

The UISaveAsOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

UISaveAsOptions Class

Autodesk.Revit.UI Namespace