---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TabbedDialogExtension Methods
TabbedDialogExtension Class See Also Send Feedback
---

The TabbedDialogExtension type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetContextualHelp | Gets the contextual help. |
|  | SetContextualHelp | Sets the contextual help. |

# See Also

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace