---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentChangedEventArgs Properties
DocumentChangedEventArgs Class See Also Send Feedback
---

The DocumentChangedEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Operation | The operation associated with this event |

# See Also

DocumentChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace