---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalDistributionNodePropertyData Methods
AnalyticalDistributionNodePropertyData Class See Also Send Feedback
---

The AnalyticalDistributionNodePropertyData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

AnalyticalDistributionNodePropertyData Class

Autodesk.Revit.DB.Electrical Namespace