---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PipePlumbingFixtureFlowData Methods
PipePlumbingFixtureFlowData Class See Also Send Feedback
---

The PipePlumbingFixtureFlowData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

PipePlumbingFixtureFlowData Class

Autodesk.Revit.DB.Plumbing Namespace