---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PaperSource Properties
PaperSource Class See Also Send Feedback
---

The PaperSource type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Name | Retrieve the paper source name of current project. |

# See Also

PaperSource Class

Autodesk.Revit.DB Namespace