---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FaceDetailNode Properties
FaceDetailNode Class See Also Send Feedback
---

The FaceDetailNode type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn. |

# See Also

FaceDetailNode Class

Autodesk.Revit.DB Namespace