---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
KeynoteEntry Properties
KeynoteEntry Class See Also Send Feedback
---

The KeynoteEntry type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | KeynoteText | The text associated with this KeynoteEntry. |

# See Also

KeynoteEntry Class

Autodesk.Revit.DB Namespace