---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyPointLocation Methods
FamilyPointLocation Class See Also Send Feedback
---

The FamilyPointLocation type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetLocation | Gets the location of the point. |

# See Also

FamilyPointLocation Class

Autodesk.Revit.DB Namespace