---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IIFCImporterServer Methods
IIFCImporterServer Interface See Also Send Feedback
---

The IIFCImporterServer type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | ImportIFC | The method that Revit will invoke to perform an import from IFC. |

# See Also

IIFCImporterServer Interface

Autodesk.Revit.DB.IFC Namespace