---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RoutingCriterionBase Methods
RoutingCriterionBase Class See Also Send Feedback
---

The RoutingCriterionBase type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Verify if two criteria are the same. |

# See Also

RoutingCriterionBase Class

Autodesk.Revit.DB Namespace