---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyManager Properties
FamilyManager Class See Also Send Feedback
---

The FamilyManager type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurrentType | The current family type. |
|  | [Parameter[([( Guid])]) ](11dc4a23-df9b-6574-3e4d-c4c03623856c.md) | Obtains the parameter of this type with a given GUID for a shared parameter. |
|  | [Parameter[([( String])]) ](13bf2342-3818-d75b-110c-062d034f2cbd.md) | Obtains the parameter of this type with a given name. |
|  | [Parameter[([( BuiltInParameter])]) ](58f07dc1-aa80-65d8-a7f7-d60b32366d11.md) | Obtains the parameter of this type with a given parameter id. |
|  | [Parameter[([( Definition])]) ](a34849d3-53a8-fe8d-c441-274480da38d2.md) | Obtains the parameter of this type with a given definition. |
|  | Parameters | All family parameters in this family. |
|  | Types | All family types in the family. |

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace