---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DataStorage Methods
DataStorage Class See Also Send Feedback
---

The DataStorage type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new DataStorage element and adds it to the document. |

# See Also

DataStorage Class

Autodesk.Revit.DB.ExtensibleStorage Namespace