---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyUInt64 Properties
AssetPropertyUInt64 Class See Also Send Feedback
---

The AssetPropertyUInt64 type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property. |

# See Also

AssetPropertyUInt64 Class

Autodesk.Revit.DB.Visual Namespace