---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricWireItem Methods
FabricWireItem Class See Also Send Feedback
---

The FabricWireItem type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a single Fabric wire. |
|  | Dispose |  |

# See Also

FabricWireItem Class

Autodesk.Revit.DB.Structure Namespace