---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VertexPositionNormal Properties
VertexPositionNormal Class See Also Send Feedback
---

The VertexPositionNormal type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Normal | The vertex's normal vector. |
|  | Position | The vertex's position. |

# See Also

VertexPositionNormal Class

Autodesk.Revit.DB.DirectContext3D Namespace