---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeMultiplanarDefinition Methods
RebarShapeMultiplanarDefinition Class See Also Send Feedback
---

The RebarShapeMultiplanarDefinition type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | SetPresenceOfSegments | Simultaneously set the presence of all 3D segments. |

# See Also

RebarShapeMultiplanarDefinition Class

Autodesk.Revit.DB.Structure Namespace