---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayLegend Properties
AnalysisDisplayLegend Class See Also Send Feedback
---

The AnalysisDisplayLegend type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Height | The height, in sheet size, of the legend's rectangle |

# See Also

AnalysisDisplayLegend Class

Autodesk.Revit.DB.Analysis Namespace