---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WireMaterialTypeSetIterator Properties
WireMaterialTypeSetIterator Class See Also Send Feedback
---

The WireMaterialTypeSetIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

WireMaterialTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace