---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TransferringProjectStandardsEventArgs Properties
TransferringProjectStandardsEventArgs Class See Also Send Feedback
---

The TransferringProjectStandardsEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | SourceDocument | Source document. |
|  | TargetDocument | Target document. |

# See Also

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace