---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementIntersectsElementFilter Methods
ElementIntersectsElementFilter Class See Also Send Feedback
---

The ElementIntersectsElementFilter type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetElement | Gets the target element. |

# See Also

ElementIntersectsElementFilter Class

Autodesk.Revit.DB Namespace