---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LossFactor Methods
LossFactor Class See Also Send Feedback
---

The LossFactor type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LossFactor derived object. |
|  | Dispose |  |

# See Also

LossFactor Class

Autodesk.Revit.DB.Lighting Namespace