---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportPatternKey Methods
ExportPatternKey Class See Also Send Feedback
---

The ExportPatternKey type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ExportPatternKey Class

Autodesk.Revit.DB Namespace