---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PathReinforcementType Methods
PathReinforcementType Class See Also Send Feedback
---

The PathReinforcementType type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultPathReinforcementType | Creates a new PathReinforcementType object with a default name. |

# See Also

PathReinforcementType Class

Autodesk.Revit.DB.Structure Namespace