---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LinePatternSegment Methods
LinePatternSegment Class See Also Send Feedback
---

The LinePatternSegment type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

LinePatternSegment Class

Autodesk.Revit.DB Namespace