---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricWireType Methods
FabricWireType Class See Also Send Feedback
---

The FabricWireType type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultFabricWireType | Creates a new FabricWireType object with a default name. |

# See Also

FabricWireType Class

Autodesk.Revit.DB.Structure Namespace