---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Point Properties
Point Class See Also Send Feedback
---

The Point type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Coord | Returns the coordinates of the point. |
|  | Reference | Returns a stable reference to the point. |

# See Also

Point Class

Autodesk.Revit.DB Namespace