---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Space Methods
Space Class See Also Send Feedback
---

The Space type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | IsPointInSpace | Determines if a point lies within the volume of the Space. |

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace