---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LineProperties Methods
LineProperties Class See Also Send Feedback
---

The LineProperties type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

LineProperties Class

Autodesk.Revit.DB Namespace