---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Asset Properties
Asset Class See Also Send Feedback
---

The Asset type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AssetType | The type of RenderingAsset |
|  | LibraryName | Library name |
|  | Title | Asset title |

# See Also

Asset Class

Autodesk.Revit.DB.Visual Namespace