---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPModel Properties
MEPModel Class See Also Send Feedback
---

The MEPModel type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | Retrieves the Connector Manager from this MEPModel. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

MEPModel Class

Autodesk.Revit.DB Namespace