---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RoofType Properties
RoofType Class See Also Send Feedback
---

The RoofType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the RoofType |

# See Also

RoofType Class

Autodesk.Revit.DB Namespace