---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentClosedEventArgs Properties
DocumentClosedEventArgs Class See Also Send Feedback
---

The DocumentClosedEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DocumentId | Id of the document that has just been closed. |

# See Also

DocumentClosedEventArgs Class

Autodesk.Revit.DB.Events Namespace