---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarBendData Methods
RebarBendData Class See Also Send Feedback
---

The RebarBendData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace