---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewExportingEventArgs Properties
ViewExportingEventArgs Class See Also Send Feedback
---

The ViewExportingEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ViewId | Identifies the view about to be exported. |

# See Also

ViewExportingEventArgs Class

Autodesk.Revit.DB.Events Namespace