---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TransferredProjectStandardsEventArgs Properties
TransferredProjectStandardsEventArgs Class See Also Send Feedback
---

The TransferredProjectStandardsEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | SourceDocument | Source document. |
|  | TargetDocument | Target document. |

# See Also

TransferredProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace