---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarReinforcementData Methods
RebarReinforcementData Class See Also Send Feedback
---

The RebarReinforcementData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarReinforcementData, or nullNothingnullptra null reference (Nothing in Visual Basic) if the operation fails. |

# See Also

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace