---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves Methods
ClosestPointsPairBetweenTwoCurves Class See Also Send Feedback
---

The ClosestPointsPairBetweenTwoCurves type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ClosestPointsPairBetweenTwoCurves Class

Autodesk.Revit.DB Namespace