---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CodeCheckingParameterServiceData Methods
CodeCheckingParameterServiceData Class See Also Send Feedback
---

The CodeCheckingParameterServiceData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |

# See Also

CodeCheckingParameterServiceData Class

Autodesk.Revit.DB.Structure Namespace