---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SATExportOptions Methods
SATExportOptions Class See Also Send Feedback
---

The SATExportOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

SATExportOptions Class

Autodesk.Revit.DB Namespace