---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SpatialElementCalculationPoint Properties
SpatialElementCalculationPoint Class See Also Send Feedback
---

The SpatialElementCalculationPoint type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Position | The position of the "in" spatial element calculation point. |

# See Also

SpatialElementCalculationPoint Class

Autodesk.Revit.DB Namespace