---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementMulticategoryFilter Methods
ElementMulticategoryFilter Class See Also Send Feedback
---

The ElementMulticategoryFilter type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetCategoryIds | Gets the category ids assigned to this filter. |

# See Also

ElementMulticategoryFilter Class

Autodesk.Revit.DB Namespace