---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PipeFittingAndAccessoryPressureDropItem Methods
PipeFittingAndAccessoryPressureDropItem Class See Also Send Feedback
---

The PipeFittingAndAccessoryPressureDropItem type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

PipeFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Plumbing Namespace