---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentClosingEventArgs Properties
DocumentClosingEventArgs Class See Also Send Feedback
---

The DocumentClosingEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DocumentId | Id of the document that is about to be closed. |

# See Also

DocumentClosingEventArgs Class

Autodesk.Revit.DB.Events Namespace