---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FormulaEditingEventArgs Methods
FormulaEditingEventArgs Class See Also Send Feedback
---

The FormulaEditingEventArgs type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Apply | Applies formula to the parameter |

# See Also

FormulaEditingEventArgs Class

Autodesk.Revit.UI.Events Namespace