---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RevisionCloud Properties
RevisionCloud Class See Also Send Feedback
---

The RevisionCloud type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | RevisionId | The Revision associated with this RevisionCloud. |

# See Also

RevisionCloud Class

Autodesk.Revit.DB Namespace