---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RevolvedFace Properties
RevolvedFace Class See Also Send Feedback
---

The RevolvedFace type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | Curve | Profile curve of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radius of the surface. |

# See Also

RevolvedFace Class

Autodesk.Revit.DB Namespace