---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarCoupler Properties
RebarCoupler Class See Also Send Feedback
---

The RebarCoupler type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CouplerMark | gets and sets the coupler mark |
|  | RotationAngle | Indetifies the rotation angle of the coupler around its axis. |

# See Also

RebarCoupler Class

Autodesk.Revit.DB.Structure Namespace