---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralMaterialTypeFilter Properties
StructuralMaterialTypeFilter Class See Also Send Feedback
---

The StructuralMaterialTypeFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialType | The structural material type. |

# See Also

StructuralMaterialTypeFilter Class

Autodesk.Revit.DB.Structure Namespace