---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationPartSizeMap Methods
FabricationPartSizeMap Class See Also Send Feedback
---

The FabricationPartSizeMap type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

FabricationPartSizeMap Class

Autodesk.Revit.DB.Fabrication Namespace