---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WallFoundation Properties
WallFoundation Class See Also Send Feedback
---

The WallFoundation type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | WallId | Returns the id of the host wall. |

# See Also

WallFoundation Class

Autodesk.Revit.DB Namespace