---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCTransaction Methods
IFCTransaction Class See Also Send Feedback
---

The IFCTransaction type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Commit | Commits all changes made to the IFC file during the transaction. |
|  | Dispose |  |
|  | RollBack | Rolls back all changes made to the IFC file during the transaction. |

# See Also

IFCTransaction Class

Autodesk.Revit.DB.IFC Namespace