---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PipeFittingAndAccessoryConnectorData Methods
PipeFittingAndAccessoryConnectorData Class See Also Send Feedback
---

The PipeFittingAndAccessoryConnectorData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCoordination | Gets the coordination of the connector |

# See Also

PipeFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Plumbing Namespace