---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ConduitType Properties
ConduitType Class See Also Send Feedback
---

The ConduitType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsWithFitting | Whether this conduit type is with fitting |

# See Also

ConduitType Class

Autodesk.Revit.DB.Electrical Namespace