---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CableTrayConduitBase Properties
CableTrayConduitBase Class See Also Send Feedback
---

The CableTrayConduitBase type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | RunId | The id of the run to which this element belongs. |

# See Also

CableTrayConduitBase Class

Autodesk.Revit.DB.Electrical Namespace