---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EnergyAnalysisOpening Methods
EnergyAnalysisOpening Class See Also Send Feedback
---

The EnergyAnalysisOpening type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetAnalyticalSurface | Gets the associative analytical parent surface element. |
|  | GetConstruction | Gets the analytic construction this surface is associated with. |
|  | GetPolyloop | Gets the planar polygon describing the opening geometry. |
|  | GetPolyloops | Gets the collection of planar polygons describing the opening geometry. |
|  | GetWindowType | Gets the analytic window type this surface is associated with. |

# See Also

EnergyAnalysisOpening Class

Autodesk.Revit.DB.Analysis Namespace