---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MultiSegmentGrid Properties
MultiSegmentGrid Class See Also Send Feedback
---

The MultiSegmentGrid type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Text | name shared by grids in this MultiSegmentGrid |

# See Also

MultiSegmentGrid Class

Autodesk.Revit.DB Namespace