---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AreaLoad Methods
AreaLoad Class See Also Send Feedback
---

The AreaLoad type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | AreCurveLoopsValid | Checks if curve loops are valid for creating an area load. |
|  | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
|  | Create(Document, ElementId, IList<(Of <<'(CurveLoop>)>>), XYZ, AreaLoadType) | Creates a new custom area load within the project. |
|  | Create(Document, ElementId, IList<(Of <<'(CurveLoop>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Int32>)>>), IList<(Of <<'(Int32>)>>), AreaLoadType) | Creates a new custom area load within the project. |
|  | GetLoops | Returns curve loops that define geometry of the area load. |
|  | GetRefPoint | Returns the physical location of the reference point. |
|  | IsCurveLoopsInsideHostBoundaries | Checks if contour loops is inside host boundaries. |
|  | IsValidHostId | Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id |
|  | SetLoops | Sets curve loops that define geometry of the area load. |

# See Also

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace