---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
HVACLoadSpaceType Properties
HVACLoadSpaceType Class See Also Send Feedback
---

The HVACLoadSpaceType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsPlenum | True if the space type is plenum. |
|  | SpaceTypeName | The space type name. |

# See Also

HVACLoadSpaceType Class

Autodesk.Revit.DB.Analysis Namespace