---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ProgressChangedEventArgs Methods
ProgressChangedEventArgs Class See Also Send Feedback
---

The ProgressChangedEventArgs type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Requests to cancel the progress bar's operation. |

# See Also

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace