---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CommandEventArgs Properties
CommandEventArgs Class See Also Send Feedback
---

The CommandEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ActiveDocument | The active document. |
|  | CommandId | The command id. |

# See Also

CommandEventArgs Class

Autodesk.Revit.UI.Events Namespace