---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetProperties Properties
AssetProperties Class See Also Send Feedback
---

The AssetProperties type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Item |  |
|  | Size | The number of the AssetProperty(s) in the object. |

# See Also

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace