---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElectricalLoadClassification Methods
ElectricalLoadClassification Class See Also Send Feedback
---

The ElectricalLoadClassification type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of load classification and adds it to the document. |

# See Also

ElectricalLoadClassification Class

Autodesk.Revit.DB.Electrical Namespace