---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportLinetypeInfo Methods
ExportLinetypeInfo Class See Also Send Feedback
---

The ExportLinetypeInfo type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ExportLinetypeInfo Class

Autodesk.Revit.DB Namespace