---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExtensibleStorageFilter Properties
ExtensibleStorageFilter Class See Also Send Feedback
---

The ExtensibleStorageFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | SchemaGuid | Schema id used to filter elements with extensible storage data |

# See Also

ExtensibleStorageFilter Class

Autodesk.Revit.DB.ExtensibleStorage Namespace