---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralSectionAnalysisParams Methods
StructuralSectionAnalysisParams Class See Also Send Feedback
---

The StructuralSectionAnalysisParams type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

StructuralSectionAnalysisParams Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace