---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FileSaveDialog Properties
FileSaveDialog Class See Also Send Feedback
---

The FileSaveDialog type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | InitialFileName | The initial file name to be shown for this save operation. |

# See Also

FileSaveDialog Class

Autodesk.Revit.UI Namespace