---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PresetInitialColor Properties
PresetInitialColor Class See Also Send Feedback
---

The PresetInitialColor type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Preset | The preset value |

# See Also

PresetInitialColor Class

Autodesk.Revit.DB.Lighting Namespace