---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RepeaterCoordinates Methods
RepeaterCoordinates Class See Also Send Feedback
---

The RepeaterCoordinates type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCoordinate | Returns the coordinate in the given dimension. |

# See Also

RepeaterCoordinates Class

Autodesk.Revit.DB Namespace