---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayDeformedShapeSettings Methods
AnalysisDisplayDeformedShapeSettings Class See Also Send Feedback
---

The AnalysisDisplayDeformedShapeSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two deformed shape settings objects. |

# See Also

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace