---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraintCircumference Properties
RebarShapeConstraintCircumference Class See Also Send Feedback
---

The RebarShapeConstraintCircumference type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the diameter. |

# See Also

RebarShapeConstraintCircumference Class

Autodesk.Revit.DB.Structure Namespace