---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementFilter Methods
ElementFilter Class See Also Send Feedback
---

The ElementFilter type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | PassesFilter(Element) | Applies the filter to a given element. |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. |

# See Also

ElementFilter Class

Autodesk.Revit.DB Namespace