---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementLevelFilter Properties
ElementLevelFilter Class See Also Send Feedback
---

The ElementLevelFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | LevelId | The id of the level that will be matched to elements' associated level. |

# See Also

ElementLevelFilter Class

Autodesk.Revit.DB Namespace