---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings Methods
AnalysisDisplayMarkersAndTextSettings Class See Also Send Feedback
---

The AnalysisDisplayMarkersAndTextSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two colored surface settings objects. |

# See Also

AnalysisDisplayMarkersAndTextSettings Class

Autodesk.Revit.DB.Analysis Namespace