---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyEnum Properties
AssetPropertyEnum Class See Also Send Feedback
---

The AssetPropertyEnum type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

# See Also

AssetPropertyEnum Class

Autodesk.Revit.DB.Visual Namespace