---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WorksetKindFilter Properties
WorksetKindFilter Class See Also Send Feedback
---

The WorksetKindFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | WorksetKind | The WorksetKind. |

# See Also

WorksetKindFilter Class

Autodesk.Revit.DB Namespace