---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ImportIFCOptions Methods
ImportIFCOptions Class See Also Send Feedback
---

The ImportIFCOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetImportIFCOptions | Returns the current Revit instance's ImportIFCOptions. |

# See Also

ImportIFCOptions Class

Autodesk.Revit.DB Namespace