---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FillPattern Methods
FillPattern Class See Also Send Feedback
---

The FillPattern type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | ExpandDots | Corrects pattern dots to make them be drawn properly for Revit. |
|  | GetFillGrid | Gets the specified fill grid. |
|  | GetFillGrids | Gets all fill grids in this fill pattern |
|  | IsEqual | Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern. |
|  | SetFillGrid | Sets the fill grid. |
|  | SetFillGrids | Set the fill grids in this fill pattern. |

# See Also

FillPattern Class

Autodesk.Revit.DB Namespace