---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ImportInstance Properties
ImportInstance Class See Also Send Feedback
---

The ImportInstance type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsLinked | Identifies whether this instance is a linked object rather than imported one. |

# See Also

ImportInstance Class

Autodesk.Revit.DB Namespace