---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PipeSegment Methods
PipeSegment Class See Also Send Feedback
---

The PipeSegment type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a PipeSegment and adds it to the document. |

# See Also

PipeSegment Class

Autodesk.Revit.DB.Plumbing Namespace