---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RoutingCondition Methods
RoutingCondition Class See Also Send Feedback
---

The RoutingCondition type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

RoutingCondition Class

Autodesk.Revit.DB Namespace