---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilySymbolFilter Properties
FamilySymbolFilter Class See Also Send Feedback
---

The FamilySymbolFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | FamilyId | The family id. |

# See Also

FamilySymbolFilter Class

Autodesk.Revit.DB Namespace