---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VertexPair Methods
VertexPair Class See Also Send Feedback
---

The VertexPair type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

VertexPair Class

Autodesk.Revit.DB Namespace