---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuctInsulation Methods
DuctInsulation Class See Also Send Feedback
---

The DuctInsulation type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of duct insulation. |

# See Also

DuctInsulation Class

Autodesk.Revit.DB.Mechanical Namespace