---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ModuleSettings Methods
ModuleSettings Class See Also Send Feedback
---

The ModuleSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ModuleSettings Class

Autodesk.Revit.DB.Macros Namespace