---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
HomeCamera Methods
HomeCamera Class See Also Send Feedback
---

The HomeCamera type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

HomeCamera Class

Autodesk.Revit.DB Namespace