---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssemblyDifferenceMemberCount Properties
AssemblyDifferenceMemberCount Class See Also Send Feedback
---

The AssemblyDifferenceMemberCount type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Count1 | Number of members in the first assembly |
|  | Count2 | Number of members in the second assembly |

# See Also

AssemblyDifferenceMemberCount Class

Autodesk.Revit.DB Namespace