---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayDiagramSettings Methods
AnalysisDisplayDiagramSettings Class See Also Send Feedback
---

The AnalysisDisplayDiagramSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two diagram settings objects. |

# See Also

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace