---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentWorksharingEnabledEventArgs Methods
DocumentWorksharingEnabledEventArgs Class See Also Send Feedback
---

The DocumentWorksharingEnabledEventArgs type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetDocument | Returns document associated with this event |

# See Also

DocumentWorksharingEnabledEventArgs Class

Autodesk.Revit.DB.Events Namespace