---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LightDistribution Methods
LightDistribution Class See Also Send Feedback
---

The LightDistribution type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LightDistribution derived object. |
|  | Dispose |  |

# See Also

LightDistribution Class

Autodesk.Revit.DB.Lighting Namespace