---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SpatialElementCalculationLocation Properties
SpatialElementCalculationLocation Class See Also Send Feedback
---

The SpatialElementCalculationLocation type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | MarkerPosition | The position of the spatial element calculation location marker. |

# See Also

SpatialElementCalculationLocation Class

Autodesk.Revit.DB Namespace