---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementPhaseStatusFilter Properties
ElementPhaseStatusFilter Class See Also Send Feedback
---

The ElementPhaseStatusFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | PhaseId | The phase id. |

# See Also

ElementPhaseStatusFilter Class

Autodesk.Revit.DB Namespace