---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalTransferSwitchData Properties
AnalyticalTransferSwitchData Class See Also Send Feedback
---

The AnalyticalTransferSwitchData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurrentRating | The current rating value of the electrical analytical transfer switch. |
|  | TotalConnectedCurrent | The total connected current of the electrical analytical transfer switch. |
|  | Voltage | The voltage value of the electrical analytical transfer switch. |

# See Also

AnalyticalTransferSwitchData Class

Autodesk.Revit.DB.Electrical Namespace