---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BasicLossFactor Properties
BasicLossFactor Class See Also Send Feedback
---

The BasicLossFactor type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | LossFactor | The loss factor. |

# See Also

BasicLossFactor Class

Autodesk.Revit.DB.Lighting Namespace