---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AreaScheme Properties
AreaScheme Class See Also Send Feedback
---

The AreaScheme type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsGrossBuildingArea | Indicates if the area scheme is a Gross Building Area scheme. |

# See Also

AreaScheme Class

Autodesk.Revit.DB Namespace