---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarConstraint..::..GetTargetElement Method
RebarConstraint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetTargetElement()()()() | Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint. |
|  | GetTargetElement(Int32) | Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex. |

# See Also

RebarConstraint Class

RebarConstraint Members

Autodesk.Revit.DB.Structure Namespace