---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LinkElementId Methods
LinkElementId Class See Also Send Feedback
---

The LinkElementId type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |

# See Also

LinkElementId Class

Autodesk.Revit.DB Namespace