---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyString Properties
AssetPropertyString Class See Also Send Feedback
---

The AssetPropertyString type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Value | value of the property |

# See Also

AssetPropertyString Class

Autodesk.Revit.DB.Visual Namespace