---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WaterLoopData Methods
WaterLoopData Class See Also Send Feedback
---

The WaterLoopData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

WaterLoopData Class

Autodesk.Revit.DB.Mechanical Namespace