---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CurveElementFilter Properties
CurveElementFilter Class See Also Send Feedback
---

The CurveElementFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurveElementType | The curve element type. |

# See Also

CurveElementFilter Class

Autodesk.Revit.DB Namespace