---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPConnectorInfo Methods
MEPConnectorInfo Class See Also Send Feedback
---

The MEPConnectorInfo type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace