---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraintFixedSegmentDir Properties
RebarShapeConstraintFixedSegmentDir Class See Also Send Feedback
---

The RebarShapeConstraintFixedSegmentDir type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Direction | The direction of the RebarShapeSegment in UV-space. |

# See Also

RebarShapeConstraintFixedSegmentDir Class

Autodesk.Revit.DB.Structure Namespace