---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FormArrayIterator Properties
FormArrayIterator Class See Also Send Feedback
---

The FormArrayIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

# See Also

FormArrayIterator Class

Autodesk.Revit.DB Namespace