---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Edge Properties
Edge Class See Also Send Feedback
---

The Edge type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApproximateLength | Returns the approximate length of the edge. |
|  | Reference | Returns a stable reference to the edge. |

# See Also

Edge Class

Autodesk.Revit.DB Namespace