---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FlexPipe Methods
FlexPipe Class See Also Send Feedback
---

The FlexPipe type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |
|  | IsFlexPipeTypeId | Checks if given type is valid flexible pipe type. |
|  | IsPipingSystemTypeId | Checks if given type is valid piping system type. |

# See Also

FlexPipe Class

Autodesk.Revit.DB.Plumbing Namespace