---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PolyLine Properties
PolyLine Class See Also Send Feedback
---

The PolyLine type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | NumberOfCoordinates | Gets the number of the coordinate points. |

# See Also

PolyLine Class

Autodesk.Revit.DB Namespace