---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SketchedStairsCurveData Methods
SketchedStairsCurveData Class See Also Send Feedback
---

The SketchedStairsCurveData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurve | Get a copy of the curve that is formed along this boundary. |

# See Also

SketchedStairsCurveData Class

Autodesk.Revit.DB Namespace