---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Categories Properties
Categories Class See Also Send Feedback
---

The Categories type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Whether or not the list of top-level categories is empty. (Overrides CategoryNameMap..::..IsEmpty.) |
|  | [Item[([( String])]) ](9e2a96fc-df10-2e33-e042-53360cc9724e.md) | Gets a category which has the specified name from this list of top-level categories. (Overrides [CategoryNameMap..::..Item[([( String])]) ](5c189fd7-6881-976e-5ab1-ffd349c67ef3.md).) |
|  | [Item[([( BuiltInCategory])]) ](562ddcba-8f15-7421-e7a5-6968ccef7b10.md) | Retrieves a category object corresponding to a BuiltInCategory id. |
|  | Size | The total number of top-level categories in the document. (Overrides CategoryNameMap..::..Size.) |

# See Also

Categories Class

Autodesk.Revit.DB Namespace