---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralSectionGeneralLZ Properties
StructuralSectionGeneralLZ Class See Also Send Feedback
---

The StructuralSectionGeneralLZ type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | BottomFlangeLength | Bottom Flange segment length. |
|  | LipLength | Lip segment length. |

# See Also

StructuralSectionGeneralLZ Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace