---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AXMImportOptions Properties
AXMImportOptions Class See Also Send Feedback
---

The AXMImportOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ImportLevels | Indicate if levels are to be imported. False by default. |

# See Also

AXMImportOptions Class

Autodesk.Revit.DB Namespace