---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayLegendSettings Methods
AnalysisDisplayLegendSettings Class See Also Send Feedback
---

The AnalysisDisplayLegendSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two legend settings objects. |

# See Also

AnalysisDisplayLegendSettings Class

Autodesk.Revit.DB.Analysis Namespace