---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilySizeTableErrorInfo Methods
FamilySizeTableErrorInfo Class See Also Send Feedback
---

The FamilySizeTableErrorInfo type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

FamilySizeTableErrorInfo Class

Autodesk.Revit.DB Namespace