---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DesignOption Properties
DesignOption Class See Also Send Feedback
---

The DesignOption type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsPrimary | Determines whether this is a primary design option. |

# See Also

DesignOption Class

Autodesk.Revit.DB Namespace