---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPSize Methods
MEPSize Class See Also Send Feedback
---

The MEPSize type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

MEPSize Class

Autodesk.Revit.DB Namespace