---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Vertex Methods
Vertex Class See Also Send Feedback
---

The Vertex type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

Vertex Class

Autodesk.Revit.DB.DirectContext3D Namespace