---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TextRange Methods
TextRange Class See Also Send Feedback
---

The TextRange type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

TextRange Class

Autodesk.Revit.DB Namespace