---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PostPattern Methods
PostPattern Class See Also Send Feedback
---

The PostPattern type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

PostPattern Class

Autodesk.Revit.DB.Architecture Namespace