---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ThinLinesOptions Methods
ThinLinesOptions Class See Also Send Feedback
---

The ThinLinesOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

ThinLinesOptions Class

Autodesk.Revit.UI Namespace