---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LineLightShape Properties
LineLightShape Class See Also Send Feedback
---

The LineLightShape type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | EmitLength | The emit length. |

# See Also

LineLightShape Class

Autodesk.Revit.DB.Lighting Namespace