---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuctLiningType Methods
DuctLiningType Class See Also Send Feedback
---

The DuctLiningType type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | IsValidRoughness | Identifies if the input roughness is valid. |

# See Also

DuctLiningType Class

Autodesk.Revit.DB.Mechanical Namespace