---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GenericZone Properties
GenericZone Class See Also Send Feedback
---

The GenericZone type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | LevelOffset | The offset distance from this zone to the associated level. |

# See Also

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace