---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MultipleValuesIndicationSettings Methods
MultipleValuesIndicationSettings Class See Also Send Feedback
---

The MultipleValuesIndicationSettings type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetMultipleValuesIndicationSettings | Returns the MultipleValuesIndicationSettings element for a given document. |

# See Also

MultipleValuesIndicationSettings Class

Autodesk.Revit.DB Namespace