---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuildingPadType Properties
BuildingPadType Class See Also Send Feedback
---

The BuildingPadType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the BuildingPadType |

# See Also

BuildingPadType Class

Autodesk.Revit.DB Namespace