---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LineSegment Methods
LineSegment Class See Also Send Feedback
---

The LineSegment type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

LineSegment Class

Autodesk.Revit.DB Namespace