---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PrimarySizeCriterion Properties
PrimarySizeCriterion Class See Also Send Feedback
---

The PrimarySizeCriterion type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | MaximumSize | The maximum size of this criterion. |
|  | MinimumSize | The minimum size of this criterion. |

# See Also

PrimarySizeCriterion Class

Autodesk.Revit.DB Namespace