---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FolderItemInfo Methods
FolderItemInfo Class See Also Send Feedback
---

The FolderItemInfo type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

FolderItemInfo Class

Autodesk.Revit.DB Namespace