---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PromptForFamilyInstancePlacementOptions Methods
PromptForFamilyInstancePlacementOptions Class See Also Send Feedback
---

The PromptForFamilyInstancePlacementOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

PromptForFamilyInstancePlacementOptions Class

Autodesk.Revit.UI Namespace