---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCRange Methods
IFCRange Class See Also Send Feedback
---

The IFCRange type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

IFCRange Class

Autodesk.Revit.DB.IFC Namespace