---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MemberForcesServiceData Methods
MemberForcesServiceData Class See Also Send Feedback
---

The MemberForcesServiceData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |

# See Also

MemberForcesServiceData Class

Autodesk.Revit.DB.Structure Namespace