---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FailureResolution Methods
FailureResolution Class See Also Send Feedback
---

The FailureResolution type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

FailureResolution Class

Autodesk.Revit.DB Namespace