---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ColorOptions Methods
ColorOptions Class See Also Send Feedback
---

The ColorOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetColorOptions | Returns the current Revit instance's ColorOptions. |

# See Also

ColorOptions Class

Autodesk.Revit.DB Namespace