---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ImageView Properties
ImageView Class See Also Send Feedback
---

The ImageView type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ImageInstanceId | Id of the image in the view. |

# See Also

ImageView Class

Autodesk.Revit.DB Namespace