---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CircleLightShape Properties
CircleLightShape Class See Also Send Feedback
---

The CircleLightShape type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | EmitDiameter | The emit diameter. |

# See Also

CircleLightShape Class

Autodesk.Revit.DB.Lighting Namespace