---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraintRadius Properties
RebarShapeConstraintRadius Class See Also Send Feedback
---

The RebarShapeConstraintRadius type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the radius. |

# See Also

RebarShapeConstraintRadius Class

Autodesk.Revit.DB.Structure Namespace