---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WallFoundation Methods
WallFoundation Class See Also Send Feedback
---

The WallFoundation type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new wall foundation within the project. |

# See Also

WallFoundation Class

Autodesk.Revit.DB Namespace