---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
InternalOrigin Methods
InternalOrigin Class See Also Send Feedback
---

The InternalOrigin type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Get | Gets the internal origin for the document. |

# See Also

InternalOrigin Class

Autodesk.Revit.DB Namespace