---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RelinquishOptions Methods
RelinquishOptions Class See Also Send Feedback
---

The RelinquishOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

RelinquishOptions Class

Autodesk.Revit.DB Namespace