---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CorrectionFactor Properties
CorrectionFactor Class See Also Send Feedback
---

The CorrectionFactor type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Factor | Get factor value of wire correction factor. |

# See Also

CorrectionFactor Class

Autodesk.Revit.DB.Electrical Namespace