---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyFloat Properties
AssetPropertyFloat Class See Also Send Feedback
---

The AssetPropertyFloat type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

# See Also

AssetPropertyFloat Class

Autodesk.Revit.DB.Visual Namespace