---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuctFittingAndAccessoryPressureDropItem Methods
DuctFittingAndAccessoryPressureDropItem Class See Also Send Feedback
---

The DuctFittingAndAccessoryPressureDropItem type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

# See Also

DuctFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Mechanical Namespace