---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
InitialFluxIntensity Properties
InitialFluxIntensity Class See Also Send Feedback
---

The InitialFluxIntensity type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Flux | The flux intensity value. |

# See Also

InitialFluxIntensity Class

Autodesk.Revit.DB.Lighting Namespace