# AreaLoad Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
AreaLoad Members
AreaLoad Class Methods Properties See Also
---
The AreaLoad type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), XYZ, AreaLoadType) | Creates a new non-hosted area load within the project. |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Int32>)>>), IList<(Of <<'(Int32>)>>), AreaLoadType) | Creates a new non-hosted area load within the project. |
| GetLoops | Returns curve loops that define geometry of the area load. |
| GetRefPoint | Returns the physical location of the reference point. |
| IsValidHostId | Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical panel that is about to host an area load True if an area load can be placed on the input host id |
| SetLoops | Sets curve loops that define geometry of the area load. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | Returns area of the area load. |
| ForceVector1 | The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting. |
| ForceVector2 | The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting. |
| ForceVector3 | The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting. |
| IsProjected | Indicates if the load is projected. |
| NumRefPoints | Returns the total number of reference points for the area load. |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace