# NewFamilyInstance Method (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
Document..::..NewFamilyInstance Method
Document Class See Also
---
Inserts a new instance of a family into the document.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NewFamilyInstance(Curve, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a curve, type/symbol and reference level. |
| NewFamilyInstance(XYZ, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol and a base level. |
| NewFamilyInstance(XYZ, FamilySymbol, Element, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a base level. |

# See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace