# SetFromCurvesAndShape Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerItem..::..SetFromCurvesAndShape Method
RebarContainerItem Class See Also
---
Set an instance of a RebarContainerItem element according to the parameters list. The instance will have the default shape parameters from the RebarShape. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true, then both the curves and hooks must match the RebarShape definition. Otherwise, the hooks can be different than the defaults specified in the RebarShape
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetFromCurvesAndShape(
	RebarShape rebarShape,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ norm,
	IList<Curve> curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient
)
```

Visual Basic
---
```text
Public Sub SetFromCurvesAndShape ( _
	rebarShape As RebarShape, _
	barType As RebarBarType, _
	startHook As RebarHookType, _
	endHook As RebarHookType, _
	norm As XYZ, _
	curves As IList(Of Curve), _
	startHookOrient As RebarHookOrientation, _
	endHookOrient As RebarHookOrientation _
)
```

Visual C++
---
```text
public:
void SetFromCurvesAndShape(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient
)
```

# ### Parameters
rebarShape
    Type: Autodesk.Revit.DB.Structure..::..RebarShape A RebarShape element that defines the shape of the rebar. A RebarShape element matches curves and hooks. A RebarShape element provides RebarStyle of the rebar.
barType
    Type: Autodesk.Revit.DB.Structure..::..RebarBarType A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook
    Type: Autodesk.Revit.DB.Structure..::..RebarHookType A RebarHookType element that defines the hook for the start of the bar. If this parameter is nullNothingnullptra null reference (Nothing in Visual Basic), it means to create a rebar with no hook.
endHook
    Type: Autodesk.Revit.DB.Structure..::..RebarHookType A RebarHookType element that defines the hook for the end of the bar. If this parameter is nullNothingnullptra null reference (Nothing in Visual Basic), it means to create a rebar with no hook.
norm
    Type: Autodesk.Revit.DB..::..XYZ The normal to the plane that the rebar curves lie on.
curves
    Type: System.Collections.Generic..::..IList<(Of <(<'Curve>)>)> An array of curves that define the shape of the rebar curves. They must belong to the plane defined by the normal and origin. Bends and hooks should not be included in the array of curves.
startHookOrient
    Type: Autodesk.Revit.DB.Structure..::..RebarHookOrientation Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
endHookOrient
    Type: Autodesk.Revit.DB.Structure..::..RebarHookOrientation Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input curves is empty. -or- The input curves contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- curves do not form a valid CurveLoop. -or- The input curves contains at least one helical curve and is not supported for this operation. -or- The rebarShape has End Treatments |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | norm has zero length. -or- A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | curves contains non-fillet arcs with radii that are less than the minimum bend radius for the RebarBarType and RebarShape style. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | rebarShape does not match curves. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace