# ScheduleField Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ScheduleField Class
Members See Also
---
A field in a schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ScheduleField : IDisposable
```

Visual Basic
---
```text
Public Class ScheduleField _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ScheduleField : IDisposable
```

# Remarks
The ScheduleField class represents a single field in a ScheduleDefinition's list of fields. Each (non-hidden) field becomes a column in the schedule.
Most commonly, a field represents an instance or type parameter of elements appearing in the schedule. Some fields represent parameters of other related elements, like the room that a scheduled element belongs to. Fields can also represent data calculated from other fields in the schedule, specifically Formula and Percentage fields.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ScheduleField
# See Also
ScheduleField Members
Autodesk.Revit.DB Namespace