# ElectricalAnalyticalNode Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ElectricalAnalyticalNode Members
ElectricalAnalyticalNode Class Methods Properties See Also
---
The ElectricalAnalyticalNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanConnectToUpstreamNode | Verifies that the current node can connect to the upstream node. |
| CanDisconnectFromUpstreamNode | Verifies that the current node can disconnect from the upstream node. |
| ConnectToUpstreamNode | Connects to upstream node. |
| Create | Creates an electrical analytical node. |
| DisconnectFromUpstreamNode | Disconnects from upstream node. |
| GetAnalyticalPropertyData | Gets the electrical analytical node property data, nullNothingnullptra null reference (Nothing in Visual Basic) if not available. |
| GetDownstreamNodeIds | Gets the downstream node ids. |
| GetUpstreamNodeIds | Gets upstream node ids. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NodeType | The type of electrical analytical node. |
| TotalLoad | The Total Connected Load. |

# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace