# StructuralSettings Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
StructuralSettings Methods
StructuralSettings Class See Also
---
The StructuralSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetStructuralSettings | Obtains the StructuralSettings object for the specified project document. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace