# DuctSettings Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
DuctSettings Methods
DuctSettings Class See Also
---
The DuctSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDuctSettings | Get the duct settings of the project. |
| GetPressLossCalculationServerInfo | Get the MEPServerInfo of the current pipe pressure loss calculation server. |
| GetSpecificFittingAngles | Gets the list of specific fitting angles. |
| GetSpecificFittingAngleStatus | Gets the status of given specific angle. |
| IsValidSpecificFittingAngle | Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees. |
| SetPressLossCalculationServerInfo | Set the MEPServerInfo of the current pipe pressure loss calculation server. |
| SetSpecificFittingAngleStatus | Sets the status of given specific angle. |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace