# ZoneEquipment Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ZoneEquipment Members
ZoneEquipment Class Methods Properties See Also
---
The ZoneEquipment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String) | Creates a new zone equipment |
| Create(Document, AnalyticalSystemDomain, String) | **Obsolete.** Creates a new zone equipment |
| GetAssociatedZoneEquipment(Document, ElementId) | Gets the associated zone equipment of the specified analytical space. |
| GetAssociatedZoneEquipment(Document, ISet<(Of <<'(ElementId>)>>)) | Gets the associated zone equipment of all specified analytical spaces. |
| GetZoneEquipmentData | Gets the zone equipment data. |
| MoveSpaceToEquipment | Moves the selected analytical spaces from the identified zone equipment to another target zone equipment. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ZoneEquipment Class
Autodesk.Revit.DB.Mechanical Namespace