# AnalyticalPanel Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
AnalyticalPanel Members
AnalyticalPanel Class Methods Properties See Also
---
The AnalyticalPanel type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of an Analytical Panel within the project. |
| GetAnalyticalOpeningsIds | Returns the Analytical Openings ids of the Analytical Panel. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Thickness | Panel thickness, in the Revit default units. |

# See Also
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace