# PipingSystemType Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
PipingSystemType Properties
PipingSystemType Class See Also
---
The PipingSystemType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FlowConversionMethod | The flow conversion method for the piping system type. |
| FluidTemperature | Fluid Temperature |
| FluidType | Fluid Type |
| SingleLineBendDropType | Symbol for a 1 line drop |
| SingleLineBendRiseType | Symbol for a 1 line rise |
| SingleLineJunctionDropType | Symbol for a 1 line junction drop |
| SingleLineJunctionRiseType | Symbol for a 1 line junction rise |
| TwoLineDropType | Symbol for a 2 line drop |
| TwoLineRiseType | Symbol for a 2 line rise |

# See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace