# GroupType Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
GroupType Members
GroupType Class Methods Properties See Also
---
The GroupType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAvailableAttachedDetailGroupTypeIds | Returns the attached detail groups available for this element group type. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Groups | Retrieve a set of all the groups that have this type. |

# See Also
GroupType Class
Autodesk.Revit.DB Namespace