# ATFBaseExportOptions Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ATFBaseExportOptions Methods
ATFBaseExportOptions Class See Also
---
The ATFBaseExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ATFBaseExportOptions Class
Autodesk.Revit.DB Namespace