# GroupType Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
GroupType Methods
GroupType Class See Also
---
The GroupType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAvailableAttachedDetailGroupTypeIds | Returns the attached detail groups available for this element group type. |

# See Also
GroupType Class
Autodesk.Revit.DB Namespace