# EnergyAnalysisOpening Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
EnergyAnalysisOpening Members
EnergyAnalysisOpening Class Methods Properties See Also
---
The EnergyAnalysisOpening type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAnalyticalSurface | Gets the associative analytical parent surface element. |
| GetPolyloop | Gets the planar polygon describing the opening geometry. |
| GetPolyloops | Gets the collection of planar polygons describing the opening geometry. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CADLinkUniqueId | The unique id of the originating CAD object's link (linked document) associated with this opening. |
| CADObjectUniqueId | The unique id of the originating CAD object (model element) associated with this opening. |
| Corner | The lower-left coordinate for the analytical rectangular geometry viewed from outside. |
| Height | The height of the analytical rectangular geometry. |
| OpeningId | The unique identifier for the opening. |
| OpeningName | The unique name identifier for the opening. |
| OpeningType | The analytical opening type. |
| OriginatingElementDescription | The description for the originating Revit element. |
| Type | The gbXML opening type attribute. |
| Width | The width of the analytical rectangular geometry. |

# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace