# Floor Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
Floor Methods
Floor Class See Also
---
The Floor type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), ElementId, ElementId) | Creates a new instance of architectural floor within the project. |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), ElementId, ElementId, Boolean, Line, Double) | Creates a new instance of floor within the project. |
| GetDefaultFloorType | Returns id of default floor type. |
| GetNormalAtVerticalProjectionPoint | Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space. |
| GetSpanDirectionSymbolIds | Retrieves span direction symbol ElementIds. |
| GetVerticalProjectionPoint | Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection of an arbitrary point in project space. |

# See Also
Floor Class
Autodesk.Revit.DB Namespace