# Mesh Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
Mesh Methods
Mesh Class See Also
---
The Mesh type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetNormal | Returns a normal unit vector at the given index. |
| GetNormals | Returns all normals assigned to the mesh. |

# See Also
Mesh Class
Autodesk.Revit.DB Namespace