# FilledRegionType Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FilledRegionType Methods
FilledRegionType Class See Also
---
The FilledRegionType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidLineWeight | Indicates whether the given line weight value is valid. |

# See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace