# Definition Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
Definition Members
Definition Class Methods Properties See Also
---
The Definition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. |
| GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | The user visible name for the parameter. |
| ParameterGroup | Returns the group ID of the parameter definition. |

# See Also
Definition Class
Autodesk.Revit.DB Namespace