# ImporterIFC Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ImporterIFC Methods
ImporterIFC Class See Also
---
The ImporterIFC type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetOptions | Gets the collection of named options set by the importer client. |
| ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
| ProcessIFCProject(IFCAnyHandle, IDictionary<(Of <<'(IFCAnyHandle, ElementId>)>>)) |
| SetFile | Sets the handle to the IFC file being created during this import operation. |

# See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace