# FilterNumericRuleEvaluator Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FilterNumericRuleEvaluator Members
FilterNumericRuleEvaluator Class Methods Properties See Also
---
The FilterNumericRuleEvaluator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FilterNumericRuleEvaluator |
| Evaluate(Int32, Int32) | Derived classes should override this method to implement the desired test. |
| Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilterNumericRuleEvaluator Class
Autodesk.Revit.DB Namespace