# FilledRegion Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FilledRegion Methods
FilledRegion Class See Also
---
The FilledRegion type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, ElementId, IList<(Of <<'(CurveLoop>)>>)) | Creates a view-specific filled region from the given boundaries. |
| Create(Document, ElementId, SketchPlane, IList<(Of <<'(CurveLoop>)>>)) | Creates a filled region on a sketch plane in a 3d model family. |
| GetBoundaries | Gets the boundaries. |
| GetValidLineStyleIdsForFilledRegion | Gets the line style Ids which are permitted to be assigned to a filled region. |
| IsValidFilledRegionTypeId | Indicates whether the given Id is a valid filled region type Id. |
| IsValidLineStyleIdForFilledRegion | Indicates whether the given Id is a valid line style Id. |
| SetLineStyleId | Sets the line style Id for all boundaries. |

# See Also
FilledRegion Class
Autodesk.Revit.DB Namespace