# DirectShapeReferenceOptions Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
DirectShapeReferenceOptions Methods
DirectShapeReferenceOptions Class See Also
---
The DirectShapeReferenceOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsValidReferenceName | Validates that the input name can be assigned to a direct shape reference. |

# See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace