# ViewSheetSet Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ViewSheetSet Members
ViewSheetSet Class Methods Properties See Also
---
The ViewSheetSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | The view sheet set name. (Overrides Element..::..Name.) |
| Views | The views. |

# See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace