# ScheduleSheetInstance Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ScheduleSheetInstance Methods
ScheduleSheetInstance Class See Also
---
The ScheduleSheetInstance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Create an instance of a schedule on a sheet. |

# See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace