# Zone Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Zone Methods
Zone Class See Also
---
The Zone type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSpaces | Add a set of existing spaces to Zone element. |
| RemoveSpaces | Remove a set of existing spaces to the current Zone element. |

# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace