# ElectricalSystemSet Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ElectricalSystemSet Properties
ElectricalSystemSet Class See Also
---
The ElectricalSystemSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace