# LinkNode Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
LinkNode Members
LinkNode Class Methods Properties See Also
---
The LinkNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDocument | Returns the document associated with the link. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
LinkNode Class
Autodesk.Revit.DB Namespace