# RebarBarType Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
RebarBarType Properties
RebarBarType Class See Also
---
The RebarBarType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BarDiameter | **Obsolete.** Defines bar model diameter of rebar |
| BarModelDiameter | Defines bar model diameter of rebar |
| BarNominalDiameter | Defines bar nominal diameter of rebar |
| DeformationType | Defines bar deformation type. |
| MaximumBendRadius | Defines maximum bend radius of rebar |
| StandardBendDiameter | Defines bar bend diameter for rebar whose style is standard |
| StandardHookBendDiameter | Defines hook bend diameter for rebar whose style is standard |
| StirrupTieBendDiameter | Defines bar and hook bend diameter for rebar whose style is stirrup/tie |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace