# SpatialElement Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SpatialElement Methods
SpatialElement Class See Also
---
The SpatialElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBoundarySegments | Returns the boundary segments. |

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace