# BaseImportOptions Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
BaseImportOptions Methods
BaseImportOptions Class See Also
---
The BaseImportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetLayerSelection | Get all set layers name which user want to import into Revit. |
| SetLayerSelection | Set the layers name which user want to import into Revit. |

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace