# LabelUtils Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
LabelUtils Methods
LabelUtils Class See Also
---
The LabelUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetLabelFor(BuiltInCategory) | Gets the user-visible name for a BuiltInCategory. |
| GetLabelFor(BuiltInParameter) | Gets the user-visible name for a BuiltInParameter. |
| GetLabelFor(BuiltInParameterGroup) | Gets the user-visible name for a BuiltInParameterGroup. |
| GetLabelFor(ParameterType) | **Obsolete.** Gets the user-visible name for a ParameterType. |
| GetLabelFor(BuiltInParameter, LanguageType) | Gets the user-visible name for a BuiltInParameter in a specific LanguageType. |
| GetLabelFor(DuctLossMethodType, Document) | Gets the user-visible name for a DuctLossMethodType. |
| GetLabelFor(gbXMLBuildingType, Document) | Gets the user-visible name for a gbXMLBuildingType. |
| GetLabelFor(PipeFlowState, Document) | Gets the user-visible name for a PipeFlowState. |
| GetLabelFor(PipeLossMethodType, Document) | Gets the user-visible name for a PipeLossMethodType. |
| GetLabelForBuiltInParameter(ForgeTypeId) | Gets the user-visible name for a built-in parameter. |
| GetLabelForBuiltInParameter(ForgeTypeId, LanguageType) | Gets the user-visible name for a built-in parameter in a specific LanguageType. |
| GetLabelForDiscipline | Gets the user-visible name for a discipline. |
| GetLabelForGroup | Gets the user-visible name for a built-in parameter group. |
| GetLabelForSpec | Gets the user-visible name for a spec. |
| GetLabelForSymbol | Gets the user-visible name for a symbol. |
| GetLabelForUnit | Gets the user-visible name for a unit. |
| GetStructuralSectionShapeName | Gets the user-visible name for a StructuralSectionShape. |

# See Also
LabelUtils Class
Autodesk.Revit.DB Namespace