# SlabShapeEditor Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SlabShapeEditor Members
SlabShapeEditor Class Methods Properties See Also
---
The SlabShapeEditor type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DrawPoint | Adds a point to the corresponding slab, roof or floor. |
| DrawSplitLine | Draws a split line on the corresponding slab, roof or floor. |
| Enable | Enables the slab shape editing functionality. |
| ModifySubElement(SlabShapeCrease, Double) | Manipulates the crease on the corresponding slab, roof or floor. |
| ModifySubElement(SlabShapeVertex, Double) | Manipulates the vertex on the corresponding slab, roof or floor. |
| PickSupport | Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab. |
| ResetSlabShape | Removes the modifications made during editing and resets the element geometry back to the unmodified state. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEnabled | Identifies if the slab shape editing functionality is enabled. |
| SlabShapeCreases | All of the creases that can be edited. |
| SlabShapeVertices | All of the vertices that can be edited. |

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace