# ImportInstance Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ImportInstance Methods
ImportInstance Class See Also
---
The ImportInstance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, View) | Creates a new instance of an existing DWG link type. |
| Create(Document, View, ExternalResourceReference, DGNImportOptions, LinkLoadResult%) | Creates a new instance of DGN link type from an external resource reference and loads the linked file. |
| Create(Document, View, ExternalResourceReference, DWGImportOptions, LinkLoadResult%) | Creates a new instance of DWG link type from an external resource reference and loads the linked file. |
| Create(Document, View, ExternalResourceReference, ImportOptions3DM, LinkLoadResult%) | Creates a new instance of 3DM link type from an external resource reference and loads the linked file. |
| Create(Document, View, ExternalResourceReference, SATImportOptions, LinkLoadResult%) | Creates a new instance of SAT link type from an external resource reference and loads the linked file. |
| Create(Document, View, ExternalResourceReference, SKPImportOptions, LinkLoadResult%) | Creates a new instance of SKP link type from an external resource reference and loads the linked file. |
| Create(Document, View, String, DWGImportOptions, LinkLoadResult%) | Creates a new instance of DWG or DXF link type from a file path and loads the linked file. |
| GetVisibility | Gets the visibility for the import instance in a family document. |
| SetVisibility | Sets the visibility for the import instance in a family document. |

# See Also
ImportInstance Class
Autodesk.Revit.DB Namespace