# AnalyticalLink Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalLink Properties
AnalyticalLink Class See Also
---
The AnalyticalLink type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| End | The point at the end of the AnalyticalLink. |
| EndHubId | Hub ID at end of AnalyticalLink. |
| OwnerId | ElementId of AnalyticalModel element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API |
| Start | The point at the start of the AnalyticalLink. |
| StartHubId | Hub ID at start of AnalyticalLink. |

# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace