# GetLocalCoordinateSystem Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalModelSurface..::..GetLocalCoordinateSystem Method
AnalyticalModelSurface Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetLocalCoordinateSystem(XYZ) | Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point. |

# See Also
AnalyticalModelSurface Class
AnalyticalModelSurface Members
Autodesk.Revit.DB.Structure Namespace