# FilterStringRule Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
FilterStringRule Members
FilterStringRule Class Constructors Methods Properties See Also
---
The FilterStringRule type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringRule(FilterableValueProvider, FilterStringRuleEvaluator, String) | Constructs an instance of FilterStringRule. |
| FilterStringRule(FilterableValueProvider, FilterStringRuleEvaluator, String, Boolean) | **Obsolete.** Constructs an instance of FilterStringRule. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEvaluator | Gets the evaluator that implements the test for this rule. |
| SetEvaluator | Sets the evaluator that implements the test for this rule. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RuleString | The user-supplied string against which strings from a Revit document will be tested. |

# See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace