# IFCFileWriteOptions Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
IFCFileWriteOptions Members
IFCFileWriteOptions Class Constructors Methods Properties See Also
---
The IFCFileWriteOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IFCFileWriteOptions | Creates a default IFCFileWriteOptions. The default file format is ifc. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the IFCFileWriteOptions |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FileFormat | The file format of the IFC file. |
| FileName | The full file name of the IFC file to be written. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| XMLConfigFileName | The XML configuration file name. It is used only for writing IFC-XML format file. |

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace