# ShapeImporterSourceFormat Enumeration (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ShapeImporterSourceFormat Enumeration
See Also
---
An enumerated type listing the possible formats supported by the Shapeimporter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2017 **Since:** 2017
# Syntax
C#
---
```text
public enum ShapeImporterSourceFormat
```

Visual Basic
---
```text
Public Enumeration ShapeImporterSourceFormat
```

Visual C++
---
```text
public enum class ShapeImporterSourceFormat
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Auto | The format of the incoming data will be determined from input file extension. |
| SAT | The incoming data is in SAT format (*.sat). |
| Rhino | The incoming data is in Rhino format (*.3dm). |

# See Also
Autodesk.Revit.DB Namespace