# EnergyAnalysisSpace Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
EnergyAnalysisSpace Members
EnergyAnalysisSpace Class Methods Properties See Also
---
The EnergyAnalysisSpace type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAnalyticalSurfaces | Provides a way to access the collection of analytical surfaces for a space. Geometry data defining an analytical space volume. Through an analytical surface you can connect a source element with each polygon in a space. The analytical surfaces defines an enclosed volume bounded by the center plane of walls and the top plane of roofs and floors. |
| GetBoundary | Gets the collection of polygons that form the 2D boundary. This method returns a collection of polyloops (planar polygons) that defines an enclosed area measured by interior bounding surfaces. |
| GetClosedShell | Gets the collection of polygons that form a closed shell. This method returns a collection of polyloops (planar polygons) that defines an enclosed volume measured by interior bounding surfaces. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalyticalVolume | The volume for this space. |
| Area | The area for this space. |
| CADObjectUniqueId | The unique id of the originating CAD object (model element) associated with this space. |
| ComposedName | The composed name for this space. |
| Description | The description. |
| InnerVolume | The analytical volume for this space. |
| SpaceName | The name. |

# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace