# Revision Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Revision Properties
Revision Class See Also
---
The Revision type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Description | The description of this Revision. |
| Issued | Indicates whether this Revision has been issued. |
| IssuedBy | Indicates who has issued or will issue this Revision. |
| IssuedTo | Indicates to whom this Revision was or will be issued. |
| NumberType | Indicates what number type the Revision Number for this Revision should use. |
| RevisionDate | The date of this Revision. |
| RevisionNumber | The Revision number of this revision. |
| RevisionNumberingSequenceId | The id of the revision numbering sequence which controls this revision's numbering. |
| SequenceNumber | The Sequence Number of this Revision. |
| Visibility | Controls the visibility of revision clouds and revision tags related to this Revision. |

# See Also
Revision Class
Autodesk.Revit.DB Namespace