# CreateNotEqualsRule Method (ElementId, String, Boolean) (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ParameterFilterRuleFactory..::..CreateNotEqualsRule Method (ElementId, String, Boolean)
ParameterFilterRuleFactory Class See Also
---
Creates a filter rule that determines whether strings from the document do not equal a certain value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static FilterRule CreateNotEqualsRule(
	ElementId parameter,
	string value,
	bool caseSensitive
)
```

Visual Basic
---
```text
Public Shared Function CreateNotEqualsRule ( _
	parameter As ElementId, _
	value As String, _
	caseSensitive As Boolean _
) As FilterRule
```

Visual C++
---
```text
public:
static FilterRule^ CreateNotEqualsRule(
	ElementId^ parameter,
	String^ value,
	bool caseSensitive
)
```

# ### Parameters
parameter
    Type: Autodesk.Revit.DB..::..ElementId A string-typed parameter used to get values from the document for a given element.
value
    Type: System..::..String The user-supplied string value against which values from the document will be compared.
caseSensitive
    Type: System..::..Boolean If true, the string comparison will be case-sensitive.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterFilterRuleFactory Class
CreateNotEqualsRule Overload
Autodesk.Revit.DB Namespace