# Viewport Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Viewport Properties
Viewport Class See Also
---
The Viewport type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LabelLineLength | The length of the viewport label line in sheet space, measured in feet. |
| LabelOffset | The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored. |
| Rotation | The rotation of the viewport on the sheet. |
| SheetId | The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet. |
| ViewId | The element id of the associated View. |

# See Also
Viewport Class
Autodesk.Revit.DB Namespace