# LoadBase Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
LoadBase Members
LoadBase Class Methods Properties See Also
---
The LoadBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsOrientToPermitted | Indicates if the provided orientation is permitted for this load. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostElement | The host element for the load. |
| HostElementId | The host element ID for the load. |
| IsHosted | Indicates if the Load is hosted or non-hosted. |
| IsReaction | The load is reaction option. |
| LoadCase | The load case for the load. |
| LoadCaseId | The load case ID for the load. |
| LoadCaseName | The name of the load case to which this load belongs. |
| LoadCategoryName | The name of the category to which this load belongs. |
| LoadNatureName | A string representing the nature of the load. |
| OrientTo | The load orientation option. |
| WorkPlaneId | Id of the work plane which may determine the orientation of the load. |

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace