# MaxEdgeLength Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
STLExportOptions..::..MaxEdgeLength Property
STLExportOptions Class See Also
---
The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value. By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double MaxEdgeLength { get; set; }
```

Visual Basic
---
```text
Public Property MaxEdgeLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaxEdgeLength {
	double get ();
	void set (double value);
}
```

# Remarks
This property can be set by using export resolution type (by creation of STLExportOptions or using [!:Autodesk::Revit::DB::STLExportOptions::setTessellationSettings(STLExportResolution::Enum)] method). In the case of Fine, Medium and Coarse resolutions, this property has the same value (10.0%) and it is considered as explicitly set by the user. In the case of Custom resolution type, this property is only allowed to be obtained if it has been explicitly set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The value maxEdgeLength is outside the allowable range of values for MaxEdgeLength tessellation parameter. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | MaxEdgeLength tessellation parameter is default (hasn't been explicitly set by the user) and cannot be obtained now. |

# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace