# SketchEditScope Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SketchEditScope Members
SketchEditScope Class Constructors Methods Properties See Also
---
The SketchEditScope type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SketchEditScope | Instantiates a SketchEditScope object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsSketchEditingSupported | Checks whether sketch can be edited. |
| Start | Starts a sketch edit mode. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SketchEditScope Class
Autodesk.Revit.DB Namespace