# InSessionViewSheetSet Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
InSessionViewSheetSet Members
InSessionViewSheetSet Class Methods Properties See Also
---
The InSessionViewSheetSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the InSessionViewSheetSet |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Views | The views. |

# See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace