# CurveElement Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
CurveElement Methods
CurveElement Class See Also
---
The CurveElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAdjoinedCurveElements | Returns elements that are joining with this curve element at the given end point. |
| GetLineStyleIds | Ids of all line style Elements that are applicable to this curve element. |
| GetTangentLock | Returns the state of a tangent join between this and another curve element at the given end-point. |
| HasTangentJoin | Tests whether this curve element and the input curve element have common tangent join at the given end-point. |
| HasTangentLocks | Tests whether this curve element has any locked tangent joins at the given end-point. |
| IsAdjoinedCurveElement | This method tests whether this and the given curve elements are joined at the given end. |
| SetGeometryCurve | Sets the geometry of the curve element. After the curve geometry is set, other nearby curves may join to the new curve geometry. |
| SetSketchPlaneAndCurve | Sets the sketch plane and the curve for this CurveElement. |
| SetTangentLock | Sets a new status for an existing tangent join with another curve element at the given end-point. |

# See Also
CurveElement Class
Autodesk.Revit.DB Namespace