# RebarCoupler Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
RebarCoupler Properties
RebarCoupler Class See Also
---
The RebarCoupler type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CouplerMark | gets and sets the coupler mark |

# See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace