# CentralModelVersionArchivedException Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
CentralModelVersionArchivedException Class
Members Example See Also
---
Exception is thrown when last central version merged into the local model has been archived in the central model. Reload Latest or Synchronized with Central needs to be conducted before the current failed operation is retried.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021
# Syntax
C#
---
```text
[SerializableAttribute]
public class CentralModelVersionArchivedException : CentralModelException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class CentralModelVersionArchivedException _
	Inherits CentralModelException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class CentralModelVersionArchivedException : public CentralModelException
```

# Examples
CopyC#
```text
void HandleCentralModelVersionArchivedException(Document doc)
{
   FilteredElementCollector collector = new FilteredElementCollector(doc);
   ICollection<ElementId> rooms = collector.WherePasses(new RoomFilter()).ToElementIds();

   try
   {
      ICollection<ElementId> checkoutelements = WorksharingUtils.CheckoutElements(doc, rooms);
   }
   catch (Autodesk.Revit.Exceptions.CentralModelVersionArchivedException)
   {
      TaskDialog dlg = new TaskDialog("Elements can't be checked out")
      {
         MainInstruction = "The local model is out of date. Editing is limited to elements and worksets you own.",
         MainContent = "To check out elements and worksets owned by others, first reload latest or synchronize with the central model.",
      };
      dlg.Show();

      // Reload Latest, to update the local model to latest version
      ReloadLatestOptions rlOptions = new ReloadLatestOptions();
      doc.ReloadLatest(rlOptions);

      rooms = collector.WherePasses(new RoomFilter()).ToElementIds();
      ICollection<ElementId> checkoutelements = WorksharingUtils.CheckoutElements(doc, rooms);

      TaskDialog.Show(
         title: "Elements are checked out",
         mainInstruction: $"{checkoutelements.Count} elements are checked out.");
   }
}
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..CentralModelException Autodesk.Revit.Exceptions..::..CentralModelVersionArchivedException
# See Also
CentralModelVersionArchivedException Members
Autodesk.Revit.Exceptions Namespace