# ElectricalSystemSetIterator Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ElectricalSystemSetIterator Properties
ElectricalSystemSetIterator Class See Also
---
The ElectricalSystemSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
ElectricalSystemSetIterator Class
Autodesk.Revit.DB.Electrical Namespace