# TemperatureRatingType Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
TemperatureRatingType Methods
TemperatureRatingType Class See Also
---
The TemperatureRatingType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddCorrectionFactor(Double, Double) | Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature. |
| AddCorrectionFactor(Int64, Double) | **Obsolete.** Add a new electrical correction factor type to this temperature rating type. |
| AddInsulationType | Add a new kind of insulation type into this temperature rating type. |
| AddWireSize | Add a new kind of wire size type into this temperature rating type. |
| RemoveCorrectionFactor | Remove an existing correction factor from this temperature rating type in Revit MEP project. |
| RemoveInsulationType | Remove an existing insulation type from this temperature rating type. |
| RemoveWireSize | Remove an existing wire size type from this temperature rating type. |

# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace