# ElectricalLoadClassification Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ElectricalLoadClassification Properties
ElectricalLoadClassification Class See Also
---
The ElectricalLoadClassification type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Abbreviation | The abbreviation of the load classification name |
| ActualElectricalLoadLabel | The name template for the actual load parameter on the load classification. |
| DemandFactorId | The demand factor definition this load classification element uses. |
| LoadSummaryDemandFactorLabel | The name template for the demand factor parameter of the load classification. |
| Motor | Indicates if this load classification is to be used for motors. |
| PanelConnectedCurrentLabel | The name template for the connected current parameter on the load classification. |
| PanelConnectedLabel | The name template for the connected load parameter of the load classification. |
| PanelEstimatedCurrentLabel | The name template for the estimated current parameter on the load classification. |
| PanelEstimatedLabel | The name template for the estimated demand parameter on the load classification. |
| SpaceLoadClass | The electrical load class associated with a space. |

# See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace