# ViewSheet Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ViewSheet Methods
ViewSheet Class See Also
---
The ViewSheet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConvertToRealSheet | Converts a placeholder sheet to a real one with an optional titleblock. |
| Create | Creates a new ViewSheet. |
| CreatePlaceholder | Creates a placeholder sheet in a document. |
| DeleteViewport | Removes a viewport from the sheet by deleting it from the document. |
| GetAdditionalRevisionIds | Gets the Revisions that are additionally included in the sheet's revision schedules. |
| GetAllPlacedViews | Returns the ElementIds of Views placed on this sheet. |
| GetAllRevisionIds | Gets the ordered array of Revisions which participate in the sheet's revision schedules. |
| GetAllViewports | Returns the ElementIds of Viewports on this sheet. |
| GetCurrentRevision | Returns the most recent numbered Revision shown on this ViewSheet. |
| GetRevisionCloudNumberOnSheet | Gets the Revision Number for a RevisionCloud on this sheet. |
| GetRevisionNumberOnSheet | Gets the Revision Number for a particular Revision as it will appear on this sheet. |
| SetAdditionalRevisionIds | Sets the Revisions to additionally include in the sheet's revision schedules. |

# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace