# WorksetTable Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
WorksetTable Members
WorksetTable Class Methods Properties See Also
---
The WorksetTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the WorksetTable |
| GetActiveWorksetId | Returns the active workset's WorksetId. |
| GetWorkset(Guid) | Returns the workset from a input Guid. |
| GetWorkset(WorksetId) | Returns the workset from a input WorksetId. |
| IsWorksetNameUnique | Checks if the given workset name is unique in the document. |
| RenameWorkset | Renames the workset. |
| SetActiveWorksetId | Sets the active workset. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
WorksetTable Class
Autodesk.Revit.DB Namespace