# TransformWithBoundary Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
TransformWithBoundary Methods
TransformWithBoundary Class See Also
---
The TransformWithBoundary type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
TransformWithBoundary Class
Autodesk.Revit.DB Namespace