# SetupEnergySimulationDialog Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SetupEnergySimulationDialog Methods
SetupEnergySimulationDialog Class See Also
---
The SetupEnergySimulationDialog type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Show | Shows the SetupEnergySimulationDialog to the user as a modal dialog. |

# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace