# AnalyticalModel Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalModel Properties
AnalyticalModel Class See Also
---
The AnalyticalModel type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RigidLinksOption | Indicates if parameters indicate if Rigid Links should be formed. |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace