# AddParameter Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
FamilyManager..::..AddParameter Method
FamilyManager Class See Also
---
Add a new parameter to the family.
Add a new parameter to the family.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddParameter(ExternalDefinition, BuiltInParameterGroup, Boolean) | Add a new shared parameter to the family. |
| AddParameter(ExternalDefinition, ForgeTypeId, Boolean) | Add a new shared parameter to the family. |
| AddParameter(String, BuiltInParameterGroup, Category, Boolean) | Add a new family type parameter to control the type of a nested family within another family. |
| AddParameter(String, BuiltInParameterGroup, ParameterType, Boolean) | **Obsolete.** Add a new family parameter with a given name. |
| AddParameter(String, ForgeTypeId, Category, Boolean) | Add a new family type parameter to control the type of a nested family within another family. |
| AddParameter(String, ForgeTypeId, ForgeTypeId, Boolean) | Add a new family parameter with a given name. |

# See Also
FamilyManager Class
FamilyManager Members
Autodesk.Revit.DB Namespace