# ExtensibleStorageFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtensibleStorageFilter Members
ExtensibleStorageFilter Class Constructors Methods Properties See Also
---
The ExtensibleStorageFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExtensibleStorageFilter | Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SchemaGuid | Schema id used to filter elements with extensible storage data |

# See Also
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace