# StructuralSectionColdFormed Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionColdFormed Members
StructuralSectionColdFormed Class Methods Properties See Also
---
The StructuralSectionColdFormed type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InnerFillet | Inner Fillet - Corner fillet inner radius. |
| WallDesignThickness | Represents wall design thickness of rectangle. |
| WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also
StructuralSectionColdFormed Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace