# ReferenceArrayArray Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceArrayArray Properties
ReferenceArrayArray Class See Also
---
The ReferenceArrayArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a ReferenceArray at a specified index within the array. |
| Size | Returns the number of ReferenceArrays that are in the array. |

# See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace