# TextNoteOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextNoteOptions Methods
TextNoteOptions Class See Also
---
The TextNoteOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace