# IntegerParameterValue Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntegerParameterValue Properties
IntegerParameterValue Class See Also
---
The IntegerParameterValue type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
IntegerParameterValue Class
Autodesk.Revit.DB Namespace