# StructuralSectionCProfileWithFold Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionCProfileWithFold Members
StructuralSectionCProfileWithFold Class Constructors Methods Properties See Also
---
The StructuralSectionCProfileWithFold type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionCProfileWithFold | Creates a new instance of Structural Section C Profile With Fold shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionCProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace