# ExternalServiceOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalServiceOptions Methods
ExternalServiceOptions Class See Also
---
The ExternalServiceOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace