# AssetPropertyDistance Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDistance Properties
AssetPropertyDistance Class See Also
---
The AssetPropertyDistance type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | Value of the property. |

# See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace