# ExtElemChangeBeamSectionRegistry Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtElemChangeBeamSectionRegistry Methods
ExtElemChangeBeamSectionRegistry Class See Also
---
The ExtElemChangeBeamSectionRegistry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| RegisterInterface | Registers a IExtElemChangeBeamSection |
| Unregister | Unregisters IExtElemChangeBeamSection. |

# See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace