# RevitServerUnauthorizedException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitServerUnauthorizedException Methods
RevitServerUnauthorizedException Class See Also
---
The RevitServerUnauthorizedException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides RevitServerException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
RevitServerUnauthorizedException Class
Autodesk.Revit.Exceptions Namespace