# ConicalFace Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConicalFace Properties
ConicalFace Class See Also
---
The ConicalFace type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Axis | Axis of the surface. |
| HalfAngle | Half angle of the surface. |
| Origin | Origin of the surface. |
| Radius | Radii of the surface. |

# See Also
ConicalFace Class
Autodesk.Revit.DB Namespace