# WireConduitTypeSetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireConduitTypeSetIterator Methods
WireConduitTypeSetIterator Class See Also
---
The WireConduitTypeSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
WireConduitTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace