# TemporaryGraphicsCommandData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TemporaryGraphicsCommandData Methods
TemporaryGraphicsCommandData Class See Also
---
The TemporaryGraphicsCommandData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace