# PickedBox Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PickedBox Members
PickedBox Class Methods Properties See Also
---
The PickedBox type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Max | Maximum coordinates (upper-right-front corner of the pick box). |
| Min | Minimum coordinates (lower-left-rear corner of the pick box). |

# See Also
PickedBox Class
Autodesk.Revit.UI.Selection Namespace