# ServerInternalException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ServerInternalException Methods
ServerInternalException Class See Also
---
The ServerInternalException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ApplicationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ServerInternalException Class
Autodesk.Revit.Exceptions Namespace