# StartingViewSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StartingViewSettings Methods
StartingViewSettings Class See Also
---
The StartingViewSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetStartingViewSettings | Returns the starting view settings for the specified document. |
| IsAcceptableStartingView | Checks whether the given Id is an acceptable starting view. InvalidElementId corresponds to "Last Viewed" and is therefore also acceptable. |

# See Also
StartingViewSettings Class
Autodesk.Revit.DB Namespace