# ExportLineweightInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLineweightInfo Methods
ExportLineweightInfo Class See Also
---
The ExportLineweightInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace