# SweptProfile Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SweptProfile Methods
SweptProfile Class See Also
---
The SweptProfile type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDrivingCurve | Provides access to the curve that dictates the path of the swept profile. |
| GetSweptProfile | Returns an object that describes the profile that is swept along the driving curve. |

# See Also
SweptProfile Class
Autodesk.Revit.DB Namespace