# LocationPoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LocationPoint Properties
LocationPoint Class See Also
---
The LocationPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Point | The physical location of the element. |
| Rotation | The angle of rotation around the insertion point, in radians. |

# See Also
LocationPoint Class
Autodesk.Revit.DB Namespace