# AnalyticalToPhysicalAssociationManager Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalToPhysicalAssociationManager Properties
AnalyticalToPhysicalAssociationManager Class See Also
---
The AnalyticalToPhysicalAssociationManager type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnableAssistedAssociation | Indicates if associations between Analytical and Physical Elements should be created automatically. |

# See Also
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace