# DeleteWorksetSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DeleteWorksetSettings Methods
DeleteWorksetSettings Class See Also
---
The DeleteWorksetSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace