# ViewNode Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewNode Properties
ViewNode Class See Also
---
The ViewNode type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LevelOfDetail | The level of detail the view is going to be rendered at. |
| ViewId | The Id of the view element. |

# See Also
ViewNode Class
Autodesk.Revit.DB Namespace