# FilterStringLess Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringLess Members
FilterStringLess Class Constructors Methods Properties See Also
---
The FilterStringLess type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringLess | Constructs an instance of FilterStringLess. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringLess Class
Autodesk.Revit.DB Namespace