# AnalyticalNodeData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalNodeData Methods
AnalyticalNodeData Class See Also
---
The AnalyticalNodeData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetAnalyticalNodeData | Returns AnalyticalNodeData associated with this element, if it exists. |
| GetConnectionStatus | Returns the Connection Status for this Analytical Node. |

# See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace