# SetBendProfile Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..SetBendProfile Method
FabricSheet Class Example See Also
---
Sets new profile that defines the shape of the Fabric Sheet bending.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetBendProfile(
	CurveLoop bendProfile
)
```

Visual Basic
---
```text
Public Sub SetBendProfile ( _
	bendProfile As CurveLoop _
)
```

Visual C++
---
```text
public:
void SetBendProfile(
	CurveLoop^ bendProfile
)
```

# ### Parameters
bendProfile
    Type: Autodesk.Revit.DB..::..CurveLoop A profile that defines the bending shape of the fabric sheet. The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so, then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family. If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated. The provided profile defines the center-curve of a wire.
# Examples
CopyC#
```text
private void ModifyBentFabricSheet(Document document, FabricSheet bentFabricSheet)
{
   CurveLoop newBendingProfile = CurveLoop.CreateViaOffset(bentFabricSheet.GetBendProfile(), 0.5, new XYZ(0, 0, -1));
   bentFabricSheet.SetBendProfile(newBendingProfile);

   // Give the user some information
   TaskDialog.Show("Revit", string.Format("Bent Fabric Sheet ID='{0}' modified successfully.", bentFabricSheet.Id.ToString()));
}
```

CopyVB.NET
```text
Private Sub ModifyBentFabricSheet(document As Document, bentFabricSheet As FabricSheet)
    Dim newBendingProfile As CurveLoop = CurveLoop.CreateViaOffset(bentFabricSheet.GetBendProfile(), 0.5, New XYZ(0, 0, -1))
    bentFabricSheet.SetBendProfile(newBendingProfile)

    ' Give the user some information
    TaskDialog.Show("Revit", String.Format("Bent Fabric Sheet ID='{0}' modified successfully.", bentFabricSheet.Id.ToString()))
End Sub
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the bend profile contains an overlap or intersecting segments. -or- Thrown when the bend profile is empty. -or- Thrown when the bend profile contains an empty loop. -or- Thrown when the bend profile contains multiple loops. -or- Thrown when the bend profile contains a closed loop. -or- Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment. -or- Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family. -or- Thrown when the provided profile cannot be used as a bending shape for this fabric sheet. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidObjectException | The data-setting method is not applicable to fabric sheets that are flat. |

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace