# Room Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Room Methods
Room Class See Also
---
The Room type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsPointInRoom | Determines if a point lies within the volume of the room. |
| Unplace | Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced. |

# See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace