# LogicalOrFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LogicalOrFilter Members
LogicalOrFilter Class Constructors Methods Properties See Also
---
The LogicalOrFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LogicalOrFilter(IList<(Of <<'(ElementFilter>)>>)) | Constructs a new instance of the logical filter with any number of input filters. |
| LogicalOrFilter(ElementFilter, ElementFilter) | Constructs a new instance of the logical filter with two input filters. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
LogicalOrFilter Class
Autodesk.Revit.DB Namespace