# AreaTagFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaTagFilter Members
AreaTagFilter Class Constructors Methods Properties See Also
---
The AreaTagFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreaTagFilter | Constructs a filter which matches only areas. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
AreaTagFilter Class
Autodesk.Revit.DB Namespace