# FaceSilhouetteNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceSilhouetteNode Members
FaceSilhouetteNode Class Methods Properties See Also
---
The FaceSilhouetteNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFace | Returns the Face object corresponding to the node. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace