# NestedFamilyTypeReference Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NestedFamilyTypeReference Members
NestedFamilyTypeReference Class Methods Properties See Also
---
The NestedFamilyTypeReference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId | Category Id of the referenced family |
| FamilyName | Name of the referenced family |
| TypeName | Type of the referenced family |

# See Also
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace