# Polyloop Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Polyloop Methods
Polyloop Class See Also
---
The Polyloop type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComputeArea | Gets the area for this polygon. |
| Dispose |
| GetPoints | Gets the array of points in the polygon. |

# See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace