# Workset Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Workset Properties
Workset Class See Also
---
The Workset type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEditable | Whether the workset is editable. |
| IsOpen | Whether the workset is open (rather than closed). |
| IsVisibleByDefault | Whether the workset is visible by default. |
| Kind | Kind of the workset. |

# See Also
Workset Class
Autodesk.Revit.DB Namespace