# MechanicalEquipmentSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalEquipmentSet Properties
MechanicalEquipmentSet Class See Also
---
The MechanicalEquipmentSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Classification | The classification for the mechanical equipment set. |
| OnDuty | The number of pieces of mechanical equipment operating in parallel at any given time. |
| OnStandby | The number of pieces of mechanical equipment that are not operational at any given time. |

# See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace