# StairsEditScope Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StairsEditScope Methods
StairsEditScope Class See Also
---
The StairsEditScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Start(ElementId) | Starts an stairs edit mode for an existing Stairs element |
| Start(ElementId, ElementId) | Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs. |

# See Also
StairsEditScope Class
Autodesk.Revit.DB Namespace