# AnalyticalBusData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalBusData Members
AnalyticalBusData Class Methods Properties See Also
---
The AnalyticalBusData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentRating | The current rating value of the analytical bus. |
| TotalConnectedCurrent | The total connected current of the analytical bus. |
| Voltage | The voltage value of the analytical bus. |

# See Also
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace