# ProjectLocationSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ProjectLocationSet Properties
ProjectLocationSet Class See Also
---
The ProjectLocationSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of project locations that are in the set. |

# See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace