# RebarShapeConstraintDiameter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintDiameter Properties
RebarShapeConstraintDiameter Class See Also
---
The RebarShapeConstraintDiameter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArcReferenceType | The choice of rule for measuring the diameter. |

# See Also
RebarShapeConstraintDiameter Class
Autodesk.Revit.DB.Structure Namespace