# SpotLightDistribution Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpotLightDistribution Properties
SpotLightDistribution Class See Also
---
The SpotLightDistribution type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SpotBeamAngle | The spot beam angle. |
| SpotFieldAngle | The spot field angle. |
| TiltAngle | The tilt angle. |

# See Also
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace