# CheckoutElementsRequestTooLargeException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CheckoutElementsRequestTooLargeException Methods
CheckoutElementsRequestTooLargeException Class See Also
---
The CheckoutElementsRequestTooLargeException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides CentralModelException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
CheckoutElementsRequestTooLargeException Class
Autodesk.Revit.Exceptions Namespace