# PipeFittingAndAccessoryPressureDropData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropData Methods
PipeFittingAndAccessoryPressureDropData Class See Also
---
The PipeFittingAndAccessoryPressureDropData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetPipeFittingAndAccessoryData | Returns the fitting and accessory information |
| GetPresureDropItems | Returns the pressure drop items |
| SetDefaultEntity | Stores the default entity in the data. |

# See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace