# FamilyContextException Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyContextException Members
FamilyContextException Class Methods Properties See Also
---
The FamilyContextException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FamilyContextException Class
Autodesk.Revit.Exceptions Namespace