# AssetPropertyString Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyString Members
AssetPropertyString Class Methods Properties See Also
---
The AssetPropertyString type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | value of the property |

# See Also
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace