# BoundarySegment Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundarySegment Methods
BoundarySegment Class See Also
---
The BoundarySegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurve | Get a copy of the curve that is formed along this boundary. |

# See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace