# IntersectionResultArrayIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntersectionResultArrayIterator Properties
IntersectionResultArrayIterator Class See Also
---
The IntersectionResultArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
IntersectionResultArrayIterator Class
Autodesk.Revit.DB Namespace