# VoltageTypeSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VoltageTypeSet Properties
VoltageTypeSet Class See Also
---
The VoltageTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of voltage types that are in the set. |

# See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace