# HandRailType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HandRailType Properties
HandRailType Class See Also
---
The HandRailType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Height | The height of the handrail. |
| SupportJustification | The support justification method of the handrail. |
| SupportLayout | The support layout method of the handrail. |
| SupportNumber | The number of supports of the handrail. |
| SupportSpacing | The support spacing of the handrail. |
| SupportTypeId | The support type of the handrail. |

# See Also
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace