# PointOnFace Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnFace Members
PointOnFace Class Methods Properties See Also
---
The PointOnFace type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFaceReference | Get a copy of the face reference. |
| SetFaceReference | Change the face reference. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| UV | The location of the point in the surface's coordinate system. |

# See Also
PointOnFace Class
Autodesk.Revit.DB Namespace