# PointOnFace Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnFace Methods
PointOnFace Class See Also
---
The PointOnFace type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFaceReference | Get a copy of the face reference. |
| SetFaceReference | Change the face reference. |

# See Also
PointOnFace Class
Autodesk.Revit.DB Namespace