# AreaLoad Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaLoad Properties
AreaLoad Class See Also
---
The AreaLoad type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | Returns area of the area load. |
| ForceVector1 | The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting. |
| ForceVector2 | The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting. |
| ForceVector3 | The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting. |
| IsProjected | Indicates if the load is projected. |
| NumRefPoints | Returns the total number of reference points for the area load. |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace