# AssetSetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetSetIterator Methods
AssetSetIterator Class See Also
---
The AssetSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext |
| Reset |

# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace