# DocumentPrintingEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentPrintingEventArgs Methods
DocumentPrintingEventArgs Class See Also
---
The DocumentPrintingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSettings | Gets the print settings of the active printing session. |
| GetViewElementIds | Returns ElementIds of the views to be printed. |

# See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace