# FamilyLoadingIntoDocumentEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyLoadingIntoDocumentEventArgs Members
FamilyLoadingIntoDocumentEventArgs Class Methods Properties See Also
---
The FamilyLoadingIntoDocumentEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyName | The file name of the family that is being loaded into the document. |
| FamilyPath | The file path of the family that is being loaded into the document. |

# See Also
FamilyLoadingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace