# FabricationPartRouteEnd Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationPartRouteEnd Methods
FabricationPartRouteEnd Class See Also
---
The FabricationPartRouteEnd type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateFromCenterline | Create fabrication routing end from centerline point on straight element. |
| CreateFromConnector | Create fabrication routing end from connector end point. |
| Dispose |

# See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace