# Conduit Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Conduit Members
Conduit Class Methods Properties See Also
---
The Conduit type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of conduit. |
| IsValidConduitType | Identifies if a conduit type is valid. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
Conduit Class
Autodesk.Revit.DB.Electrical Namespace