# RevolvedFace Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevolvedFace Members
RevolvedFace Class Methods Properties See Also
---
The RevolvedFace type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Axis | Axis of the surface. |
| Curve | Profile curve of the surface. |
| Origin | Origin of the surface. |
| Radius | Radius of the surface. |

# See Also
RevolvedFace Class
Autodesk.Revit.DB Namespace