# AddLoop Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..AddLoop Method
BRepBuilder Class See Also
---
Creates an empty loop in a given face of the geometry being built. Other BRepBuilder methods are used to add co-edges to the loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public BRepBuilderGeometryId AddLoop(
	BRepBuilderGeometryId faceId
)
```

Visual Basic
---
```text
Public Function AddLoop ( _
	faceId As BRepBuilderGeometryId _
) As BRepBuilderGeometryId
```

Visual C++
---
```text
public:
BRepBuilderGeometryId^ AddLoop(
	BRepBuilderGeometryId^ faceId
)
```

# ### Parameters
faceId
    Type: Autodesk.Revit.DB..::..BRepBuilderGeometryId Id of the face to which the loop should be added. faceId was returned by a call to AddFace().
# ### Return Value
An id that can be used to identify the loop while the BRepBuilder is actively building geometry (e.g., to add co-edges to the loop).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The supplied face id doesn't correspond to a face stored in this BRepBuilder object. -or- FinishFace() has already been called on faceId. -or- Please finish the previous loop by calling FinishLoop() before adding a new one. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error. Consult the State property of the BRepBuilder object for more details. |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace