# FilterOperatorAndTextString Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterOperatorAndTextString Methods
FilterOperatorAndTextString Class See Also
---
The FilterOperatorAndTextString type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace