# AnalyticalLink Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalLink Methods
AnalyticalLink Class See Also
---
The AnalyticalLink type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a AnalyticalLink element between two Hubs. |
| IsAutoGenerated | Specifies whether or not an AnalyticalLink was created by an Analytical Element. |
| IsValidHub | Checks whether input hub is valid for an AnalyticalLink. |

# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace