# FilterStringEquals Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringEquals Members
FilterStringEquals Class Constructors Methods Properties See Also
---
The FilterStringEquals type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringEquals | Constructs an instance of FilterStringEquals. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringEquals Class
Autodesk.Revit.DB Namespace