# FilteredWorksetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredWorksetIterator Methods
FilteredWorksetIterator Class See Also
---
The FilteredWorksetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | The current workset found by the iterator. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next workset passing the filter. |
| Reset | Resets the iterator to the beginning. |

# See Also
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace