# Arc Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Arc Methods
Arc Class See Also
---
The Arc type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(XYZ, XYZ, XYZ) | Creates a new geometric arc object based on three points. |
| Create(Plane, Double, Double, Double) | Creates a new geometric arc object based on plane, radius, and angles. |
| Create(XYZ, Double, Double, Double, XYZ, XYZ) | Creates a new geometric arc object based on center, radius, unit vectors, and angles. |

# See Also
Arc Class
Autodesk.Revit.DB Namespace