# DocumentReloadedLatestEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentReloadedLatestEventArgs Members
DocumentReloadedLatestEventArgs Class Methods Properties See Also
---
The DocumentReloadedLatestEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Location | Full path of the central model which is to be operated. |

# See Also
DocumentReloadedLatestEventArgs Class
Autodesk.Revit.DB.Events Namespace