# CableTrayType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTrayType Methods
CableTrayType Class See Also
---
The CableTrayType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidBendMultiplier | Identifies if the input bend multiplier is valid. |

# See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace