# StructuralSectionGeneralS Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralS Members
StructuralSectionGeneralS Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralS type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralS | Creates a new instance of Round Bar shape. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionGeneralS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace