# RebarShapeConstraint180DegreeDefaultBend Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint180DegreeDefaultBend Members
RebarShapeConstraint180DegreeDefaultBend Class Constructors Methods Properties See Also
---
The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraint180DegreeDefaultBend | Create a 180-degree bend constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RebarShapeConstraint180DegreeDefaultBend Class
Autodesk.Revit.DB.Structure Namespace