# MEPConnectorInfo Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPConnectorInfo Members
MEPConnectorInfo Class Methods Properties See Also
---
The MEPConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the MEPConnectorInfo |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsPrimary | True if this is the primary connector. |
| IsSecondary | True if this is the secondary connector. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LinkedConnector | The linked connector or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no linked connector |

# See Also
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace