# ComboBox Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBox Properties
ComboBox Class See Also
---
The ComboBox type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets or sets the current checked ComboBox member of the ComboBox. |
| Image | The image shown on the ComboBox. |

# See Also
ComboBox Class
Autodesk.Revit.UI Namespace