# RebarShapeConstraint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint Members
RebarShapeConstraint Class Methods Properties See Also
---
The RebarShapeConstraint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RebarShapeConstraint |
| GetParamId | Return the Id of the parameter associated with this constraint. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace