# ConduitSizeIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSizeIterator Methods
ConduitSizeIterator Class See Also
---
The ConduitSizeIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current ConduitSize. |
| HasCurrent | Identifies if the iterator has a current item. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace