# FloorType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FloorType Properties
FloorType Class See Also
---
The FloorType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsFoundationSlab | Returns whether the element FloorAttributes type is FoundationSlab. |
| StructuralMaterialId | Returns the identifier of the material that defines the element's structural analysis properties. |
| ThermalProperties | The calculated and settable thermal properties of the FloorType |

# See Also
FloorType Class
Autodesk.Revit.DB Namespace