# PolylineSegments Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PolylineSegments Methods
PolylineSegments Class See Also
---
The PolylineSegments type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetVertices | Returns an array of vertices of the polyline segments. |

# See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace