# EdgeArray Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArray Properties
EdgeArray Class See Also
---
The EdgeArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets an edge at a specified index within the array. |
| Size | Returns the number of edges that are in the array. |

# See Also
EdgeArray Class
Autodesk.Revit.DB Namespace