# LoadCase Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadCase Properties
LoadCase Class See Also
---
The LoadCase type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NatureId | The nature ID of the load case. |
| Number | Returns unique load case number. |
| SubcategoryId | Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category. |

# See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace