# WorksharingTooltipInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksharingTooltipInfo Methods
WorksharingTooltipInfo Class See Also
---
The WorksharingTooltipInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetRequesters | The ordered list of unique user names of users who have outstanding editing requests for the specified element. |

# See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace