# ModelCurveNode Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelCurveNode Properties
ModelCurveNode Class See Also
---
The ModelCurveNode type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LineProperties | Access to the line (pen) properties of the curve being drawn |

# See Also
ModelCurveNode Class
Autodesk.Revit.DB Namespace