# SpatialElement Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElement Methods
SpatialElement Class See Also
---
The SpatialElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBoundarySegments | Returns the boundary segments. |
| GetSpatialElementDomainData | Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data. |

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace