# HVACLoadSpaceType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HVACLoadSpaceType Methods
HVACLoadSpaceType Class See Also
---
The HVACLoadSpaceType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a space type. |
| IsNameUnique(String) | Determines whether a potential space type name is unique. |
| IsNameUnique(Document, String) | Determines whether a potential space type name is unique. |

# See Also
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace