# AreaFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaFilter Members
AreaFilter Class Constructors Methods Properties See Also
---
The AreaFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreaFilter | Constructs a filter which matches only areas. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
AreaFilter Class
Autodesk.Revit.DB Namespace