# FailureMessageKey Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureMessageKey Methods
FailureMessageKey Class See Also
---
The FailureMessageKey type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the integer value of the id as hash code  (Overrides Object..::..GetHashCode()()()().) |
| IsEqual | Checks it this key is equal to the other. |
| IsValid | Checks if the failure message key is valid |

# See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace