# AssemblyDifferenceNamingCategory Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyDifferenceNamingCategory Members
AssemblyDifferenceNamingCategory Class Methods Properties See Also
---
The AssemblyDifferenceNamingCategory type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NamingCategoryId1 | Naming category id of the first assembly |
| NamingCategoryId2 | Naming category id of the second assembly |

# See Also
AssemblyDifferenceNamingCategory Class
Autodesk.Revit.DB Namespace