# RenderingQualitySettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingQualitySettings Methods
RenderingQualitySettings Class See Also
---
The RenderingQualitySettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsCustomQuality | Checks if the current rendering quality is custom or not. |
| IsValidRenderLevel | Validate the render level is between 1 and 40 |
| IsValidRenderTime | Validate the render time is between 1 and 32768. |

# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace