# DirectContext3DHandleSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectContext3DHandleSettings Methods
DirectContext3DHandleSettings Class See Also
---
The DirectContext3DHandleSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose |
| GetTransparency | Gets the transparency value of the handle and the associated DirectContext3D graphics. |
| IsEqual | Check if the contents of two instances of settings are equal. |
| SetTransparency | Sets the transparency value of the handle and the associated DirectContext3D graphics. |

# See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace