# ModelCurve Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelCurve Properties
ModelCurve Class See Also
---
The ModelCurve type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReferenceLine | Indicates if this curve is a reference curve. |
| Subcategory | The subcategory. |
| TrussCurveType | The truss curve type of this model curve. |

# See Also
ModelCurve Class
Autodesk.Revit.DB Namespace