# ModelCurve Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelCurve Methods
ModelCurve Class See Also
---
The ModelCurve type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ChangeToReferenceLine | Changes this curve to a reference curve. |
| GetVisibility | Gets the visibility for the model curve in a family document. |
| SetVisibility | Sets the visibility for the model curve in a family document. |

# See Also
ModelCurve Class
Autodesk.Revit.DB Namespace