# InSessionViewSheetSet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InSessionViewSheetSet Methods
InSessionViewSheetSet Class See Also
---
The InSessionViewSheetSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace