# HostObjectSubcomponentInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HostObjectSubcomponentInfo Methods
HostObjectSubcomponentInfo Class See Also
---
The HostObjectSubcomponentInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurveLoop | Gets the CurveLoop representing the base profile curve loop of the roof or floor slab |
| GetPlane | Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab. |

# See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace