# StructuralSectionGeneralU Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralU Properties
StructuralSectionGeneralU Class See Also
---
The StructuralSectionGeneralU type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FlangeFillet | Flange Fillet - fillet radius at the flange end. |
| FlangeToeOfFillet | Detailing distance from center of web to flange toe of fillet, in. (mm) |
| SlopedFlangeAngle | Sloped flange angle. (rad) |
| WebToeOfFillet | Detailing distance from outer face of flange to web toe of fillet, in. (mm) |

# See Also
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace