# PipeFittingAndAccessoryData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeFittingAndAccessoryData Methods
PipeFittingAndAccessoryData Class See Also
---
The PipeFittingAndAccessoryData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetAllConnectorData | Gets the connector data of the pipe fitting or pipe accessory. |
| GetEntity | Returns an Entity of the Schema of the serverGUID. |
| GetFamilyInstanceId | Gets the Id of the fiting or accessory instance |

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace