# GetStairsSupports Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..GetStairsSupports Method
Stairs Class Example See Also
---
Returns all the stairs support components in the stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetStairsSupports()
```

Visual Basic
---
```text
Public Function GetStairsSupports As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetStairsSupports()
```

# Examples
CopyC#
```text
private void GetStairSupports(Stairs stairs)
{
    ICollection<ElementId> supportIds = stairs.GetStairsSupports();
    string info = "Number of supports:  " + supportIds.Count;

    int supportIndex = 0;
    foreach (ElementId supportId in supportIds)
    {
        supportIndex++;
        Element support = stairs.Document.GetElement(supportId);
        if (null != support)
        {
            info += "\nName of support " + supportIndex + ":  " + support.Name;
        }
    }

    TaskDialog.Show("Revit", info);
}
```

CopyVB.NET
```text
Private Sub GetStairSupports(stairs As Stairs)
    Dim supportIds As ICollection(Of ElementId) = stairs.GetStairsSupports()
    Dim info As String = "Number of supports:  " & supportIds.Count

    Dim supportIndex As Integer = 0
    For Each supportId As ElementId In supportIds
        supportIndex += 1
        Dim support As Element = stairs.Document.GetElement(supportId)
        If support IsNot Nothing Then
            info += (vbLf & "Name of support " & supportIndex & ":  ") + support.Name
        End If
    Next

    TaskDialog.Show("Revit", info)
End Sub
```

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace