# ComboBoxCurrentChangedEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxCurrentChangedEventArgs Members
ComboBoxCurrentChangedEventArgs Class Methods Properties See Also
---
The ComboBoxCurrentChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NewValue | The current item for the ComboBox after the change. |
| OldValue | The current item for the ComboBox before the change. |

# See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace