# RevitAPIEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIEventArgs Methods
RevitAPIEventArgs Class See Also
---
The RevitAPIEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsCancelled | Indicates whether the event is being cancelled. |

# See Also
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace