# WorksharingDisplayGraphicSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksharingDisplayGraphicSettings Methods
WorksharingDisplayGraphicSettings Class See Also
---
The WorksharingDisplayGraphicSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace