# ViewDisplayBackground Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplayBackground Methods
ViewDisplayBackground Class See Also
---
The ViewDisplayBackground type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateGradient | Creates an object that can be passed to View.SetBackground method to set the background of the Gradient type. |
| CreateImage | Creates an object that can be passed to View.SetBackground method to set the background of the Image type. |
| CreateSky | Creates an object that can be passed to View.SetBackground method to set the background of the SunAndClouds type. |
| Dispose |

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace