# NumberingSchemaType Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NumberingSchemaType Members
NumberingSchemaType Class Constructors Methods Operators Properties See Also
---
The NumberingSchemaType type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumberingSchemaType | Creates a new NumberingSchemaType instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two NumberingSchemaType instances. |
| Inequality | Compares two NumberingSchemaType instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
NumberingSchemaType Class
Autodesk.Revit.DB Namespace