# Duplicate Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewSheet..::..Duplicate Method
ViewSheet Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Duplicate(SheetDuplicateOption) | Duplicates this sheet to generate a new one. |

# See Also
ViewSheet Class
ViewSheet Members
Autodesk.Revit.DB Namespace