# PlanCircuitSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanCircuitSet Properties
PlanCircuitSet Class See Also
---
The PlanCircuitSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace