# StructuralWallUsageFilter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralWallUsageFilter Properties
StructuralWallUsageFilter Class See Also
---
The StructuralWallUsageFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralWallUsage | The wall structural usage. |

# See Also
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace