# FilterStringBeginsWith Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringBeginsWith Members
FilterStringBeginsWith Class Constructors Methods Properties See Also
---
The FilterStringBeginsWith type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringBeginsWith | Constructs an instance of FilterStringBeginsWith. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringBeginsWith Class
Autodesk.Revit.DB Namespace