# Part Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Part Properties
Part Class See Also
---
The Part type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Excluded | True if the part is excluded, false otherwise |
| OriginalCategoryId | The category Id of the original element corresponding to this Part. |
| PartMaker | The PartMaker that created this Part. |

# See Also
Part Class
Autodesk.Revit.DB Namespace