# StructuralConnectionSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralConnectionSettings Methods
StructuralConnectionSettings Class See Also
---
The StructuralConnectionSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetStructuralConnectionSettings | Obtains the StructuralConnectionSettings object for the specified project document. |

# See Also
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace