# CentralModelContentionException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelContentionException Methods
CentralModelContentionException Class See Also
---
The CentralModelContentionException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides CentralModelException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace