# FilterStringEndsWith Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringEndsWith Members
FilterStringEndsWith Class Constructors Methods Properties See Also
---
The FilterStringEndsWith type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringEndsWith | Constructs an instance of FilterStringEndsWith. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringEndsWith Class
Autodesk.Revit.DB Namespace