# ValueAtPointBase Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValueAtPointBase Methods
ValueAtPointBase Class See Also
---
The ValueAtPointBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None. |
| ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None. |
| Dispose |
| GetFlags | Returns flags for the given measurement. |
| SetFlags(IList<(Of <<'(Int32>)>>)) | Independently sets the flags associated to all measurements. |
| SetFlags(Int32) | Sets the flags associated to all measurements to the same value. |
| SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. |

# See Also
ValueAtPointBase Class
Autodesk.Revit.DB Namespace