# WireTypeSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireTypeSet Properties
WireTypeSet Class See Also
---
The WireTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of wire types that are in the set. |

# See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace