# ColorSelectionDialog Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorSelectionDialog Methods
ColorSelectionDialog Class See Also
---
The ColorSelectionDialog type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Show | Shows the Revit Color dialog as a modal dialog. |

# See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace