# NewSweptBlendForm Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyItemFactory..::..NewSweptBlendForm Method
FamilyItemFactory Class See Also
---
Create new Form element by swept blend operation, and add it into the Autodesk Revit family document.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Form NewSweptBlendForm(
	bool isSolid,
	ReferenceArray path,
	ReferenceArrayArray profiles
)
```

Visual Basic
---
```text
Public Function NewSweptBlendForm ( _
	isSolid As Boolean, _
	path As ReferenceArray, _
	profiles As ReferenceArrayArray _
) As Form
```

Visual C++
---
```text
public:
Form^ NewSweptBlendForm(
	bool isSolid,
	ReferenceArray^ path,
	ReferenceArrayArray^ profiles
)
```

# ### Parameters
isSolid
    Type: System..::..BooleanIndicates if the Form is Solid or Void.
path
    Type: Autodesk.Revit.DB..::..ReferenceArrayThe path of the swept blend. The path should be 2D, where all input curves lie in one plane. If there's more than one profile, the path should be a single curve. It's required to reference existing geometry.
profiles
    Type: Autodesk.Revit.DB..::..ReferenceArrayArrayThe profile set of the newly created swept blend. Each profile should consist of only one curve loop. Each profile must be in a plane that intersects with the path and is perpendicular to the path at the point of intersection.
# ### Return Value
If creation was successful new form is returned.
# See Also
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace