# PipeFittingAndAccessoryPressureDropUIData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIData Methods
PipeFittingAndAccessoryPressureDropUIData Class See Also
---
The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetUIDataItems | Gets all UI data items stored in the UI data. |
| GetUnits | Gets units. |

# See Also
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace