# CylindricalSurface Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CylindricalSurface Methods
CylindricalSurface Class See Also
---
The CylindricalSurface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Construct a cylindrical surface defined by a local coordinate system and a radius. |
| GetFrameOfReference | Returns frame of reference associated with this CylindricalSurface. |

# See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace