# ExternalResourceType Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceType Members
ExternalResourceType Class Constructors Methods Operators Properties See Also
---
The ExternalResourceType type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalResourceType | Creates a new ExternalResourceType instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two ExternalResourceType instances. |
| Inequality | Compares two ExternalResourceType instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ExternalResourceType Class
Autodesk.Revit.DB Namespace