# RebarContainerType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarContainerType Methods
RebarContainerType Class See Also
---
The RebarContainerType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefaultRebarContainerType | Creates a new RebarContainerType object with a default name. |
| GetOrCreateRebarContainerType | Creates or returns a RebarContainerType object with a given name. |

# See Also
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace