# GraphicsStyle Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GraphicsStyle Members
GraphicsStyle Class Methods Properties See Also
---
The GraphicsStyle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GraphicsStyleCategory | The graphics style category. |
| GraphicsStyleType | The graphics style type. |

# See Also
GraphicsStyle Class
Autodesk.Revit.DB Namespace