# ViewFamilyType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewFamilyType Methods
ViewFamilyType Class See Also
---
The ViewFamilyType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidDefaultTemplate | Verifies that the input can be used as a default template for this view type. |

# See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace