# IntegerRange Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntegerRange Methods
IntegerRange Class See Also
---
The IntegerRange type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IntegerRange Class
Autodesk.Revit.DB Namespace