# MEPBuildingConstructionSetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPBuildingConstructionSetIterator Methods
MEPBuildingConstructionSetIterator Class See Also
---
The MEPBuildingConstructionSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
MEPBuildingConstructionSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace