# FabricAreaType Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricAreaType Members
FabricAreaType Class Methods Properties See Also
---
The FabricAreaType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefaultFabricAreaType | Creates a new FabricAreaType object with a default name. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FabricAreaType Class
Autodesk.Revit.DB.Structure Namespace