# Export Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..Export Method
Document Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Export(String, IList<(Of <<'(ElementId>)>>), PDFExportOptions) | Exports a selection of views in PDF format. |
| Export(String, String, GBXMLExportOptions) | Export the model in gbXML (green-building) format. |
| Export(String, String, IFCExportOptions) | Exports the document to the Industry Standard Classes (IFC) format. |
| Export(String, String, NavisworksExportOptions) | Exports a Revit project to the Navisworks .nwc format. |
| Export(String, String, OBJExportOptions) | Exports a view specified in the export options to the OBJ format. |
| Export(String, String, STLExportOptions) | Exports a view specified in the export options to the STL format. |
| Export(String, String, ViewSet, DWFExportOptions) | Exports the current view or a selection of views in DWF format. |
| Export(String, String, ViewSet, DWFXExportOptions) | Exports the current view or a selection of views in DWFX format. |
| Export(String, String, ViewSet, FBXExportOptions) | Exports the document in 3D-Studio Max (FBX) format. |
| Export(String, String, ICollection<(Of <<'(ElementId>)>>), DGNExportOptions) | Exports a selection of views in DGN format. |
| Export(String, String, ICollection<(Of <<'(ElementId>)>>), DWGExportOptions) | Exports a selection of views in DWG format. |
| Export(String, String, ICollection<(Of <<'(ElementId>)>>), DXFExportOptions) | Exports a selection of views in DXF format. |
| Export(String, String, ICollection<(Of <<'(ElementId>)>>), SATExportOptions) | Exports the current view or a selection of views in SAT format. |

# See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace