# STLImportOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
STLImportOptions Members
STLImportOptions Class Constructors Methods Properties See Also
---
The STLImportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| STLImportOptions()()()() | Constructs a new instance of STLImportOptions with default values of all properties. |
| STLImportOptions(STLImportOptions) | Constructs a new instance of STLImportOptions as a copy of the import options. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
STLImportOptions Class
Autodesk.Revit.DB Namespace