# MEPNetworkSegmentId Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPNetworkSegmentId Methods
MEPNetworkSegmentId Class See Also
---
The MEPNetworkSegmentId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsValid | Verifies if this is a valid segment id. |

# See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace