# TextEditorOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextEditorOptions Methods
TextEditorOptions Class See Also
---
The TextEditorOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetTextEditorOptions | Returns the current Revit instance's TextEditorOptions. |

# See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace