# AssetPropertyInteger Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyInteger Methods
AssetPropertyInteger Class See Also
---
The AssetPropertyInteger type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# See Also
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace