# ViewPlan Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewPlan Properties
ViewPlan Class See Also
---
The ViewPlan type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreaScheme | The area scheme. |

# See Also
ViewPlan Class
Autodesk.Revit.DB Namespace