# InitialIntensity Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialIntensity Methods
InitialIntensity Class See Also
---
The InitialIntensity type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the InitialIntensity derived object. |
| Dispose |

# See Also
InitialIntensity Class
Autodesk.Revit.DB.Lighting Namespace