# IndexStreamTriangle Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexStreamTriangle Members
IndexStreamTriangle Class Methods Properties See Also
---
The IndexStreamTriangle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddTriangle | Inserts a IndexTriangle into the stream and associated buffer. |
| AddTriangles | Inserts multiple IndexTriangle instances into the stream and associated buffer. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace