# FailureDefinitionRegistry Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureDefinitionRegistry Methods
FailureDefinitionRegistry Class See Also
---
The FailureDefinitionRegistry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| FindFailureDefinition | Finds a specific FailureDefinition by a given FailureDefinitionId. |
| ListAllFailureDefinitions | Retrieves all the registered FailureDefinitions. |

# See Also
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace