# SetDelayedMiniWarnings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureHandlingOptions..::..SetDelayedMiniWarnings Method
FailureHandlingOptions Class See Also
---
Sets a flag indicating if Revit should delay the display of the mini-warning dialog (if one is to be shown as a result of warnings in the current transaction) until the end of the next transaction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureHandlingOptions SetDelayedMiniWarnings(
	bool bFlag
)
```

Visual Basic
---
```text
Public Function SetDelayedMiniWarnings ( _
	bFlag As Boolean _
) As FailureHandlingOptions
```

Visual C++
---
```text
public:
FailureHandlingOptions^ SetDelayedMiniWarnings(
	bool bFlag
)
```

# ### Parameters
bFlag
    Type: System..::..Boolean True to delay the display of the mini-warning dialog until the end of the next transation, false to display them as this transaction is completed.
# ### Return Value
This FailureHandlingOptions object.
# Remarks
This controls warnings suitable for the mini-warnings dialog only. If the modal flag is set to true with SetForcedModalHandling(Boolean) then this flag will be ignored.
# See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace