# StructuralSectionGeneralCEx Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralCEx Members
StructuralSectionGeneralCEx Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralCEx type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralCEx | Creates a new instance of general Channel Cold Formed shape. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FoldLength | Fold segment length. |
| LipLength | Lip segment length. |

# See Also
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace