# ElementStructuralTypeFilter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementStructuralTypeFilter Properties
ElementStructuralTypeFilter Class See Also
---
The ElementStructuralTypeFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralType | The structural type. |

# See Also
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace