# ReferenceArrayArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceArrayArray Methods
ReferenceArrayArray Class See Also
---
The ReferenceArrayArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append |
| Clear | Removes every ReferenceArray from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace