# WireSetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireSetIterator Properties
WireSetIterator Class See Also
---
The WireSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
WireSetIterator Class
Autodesk.Revit.DB.Electrical Namespace