# DisplacementPath Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisplacementPath Properties
DisplacementPath Class See Also
---
The DisplacementPath type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AncestorIdx | Specifies the end point of the path. |
| PathStyle | Specifies the style of the path. |

# See Also
DisplacementPath Class
Autodesk.Revit.DB Namespace