# DefinitionBindingMap Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionBindingMap Properties
DefinitionBindingMap Class See Also
---
The DefinitionBindingMap type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the map is empty. |
| Item |
| Size | Returns the number of bindings that are in the map. |

# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace