# IPipeFittingAndAccessoryPressureDropUIServer Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropUIServer Members
IPipeFittingAndAccessoryPressureDropUIServer Interface Methods See Also
---
The IPipeFittingAndAccessoryPressureDropUIServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDBServerId | Returns the Id of the corresponding DB server for which this server provides an optional UI. |
| ShowSettings | Shows the settings UI. |

# See Also
IPipeFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Plumbing Namespace