# SpotDimension Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpotDimension Properties
SpotDimension Class See Also
---
The SpotDimension type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LeaderHasShoulder | True is dimension has leader with shoulder, false otherwise. |
| LeaderShoulderPosition | Position of spot dimension's leader shoulder point. |
| SpotDimensionType | The dimension style of this dimension. |

# See Also
SpotDimension Class
Autodesk.Revit.DB Namespace