# FieldDomainPointsByXYZ Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldDomainPointsByXYZ Members
FieldDomainPointsByXYZ Class Constructors Methods Properties See Also
---
The FieldDomainPointsByXYZ type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FieldDomainPointsByXYZ | Creates object from an array of three-dimensional point coordinates |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FieldDomainPointsByXYZ Class
Autodesk.Revit.DB.Analysis Namespace