# SphericalLightDistribution Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SphericalLightDistribution Members
SphericalLightDistribution Class Constructors Methods Properties See Also
---
The SphericalLightDistribution type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SphericalLightDistribution()()()() | Creates a spherical light distribution object. |
| SphericalLightDistribution(SphericalLightDistribution) | Creates a copy of the given spherical light distribution |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace