# ColorBackgroundSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorBackgroundSettings Properties
ColorBackgroundSettings Class See Also
---
The ColorBackgroundSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Color | The color of the rendering background. |

# See Also
ColorBackgroundSettings Class
Autodesk.Revit.DB Namespace