# GeometryElement Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryElement Properties
GeometryElement Class See Also
---
The GeometryElement type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MaterialElement | Element describing the material from which this element is composed. |

# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace