# HasNoValueFilterRule Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HasNoValueFilterRule Members
HasNoValueFilterRule Class Constructors Methods Properties See Also
---
The HasNoValueFilterRule type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HasNoValueFilterRule | constructs an instance of HasNoValueFilterRule. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
HasNoValueFilterRule Class
Autodesk.Revit.DB Namespace