# EdgeArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArray Methods
EdgeArray Class See Also
---
The EdgeArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the edge to the end of the array. |
| Clear | Removes every edge from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert | Insert the specified edge into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
EdgeArray Class
Autodesk.Revit.DB Namespace