# WorksetDefaultVisibilitySettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetDefaultVisibilitySettings Methods
WorksetDefaultVisibilitySettings Class See Also
---
The WorksetDefaultVisibilitySettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetWorksetDefaultVisibilitySettings | Get the WorksetDefaultVisibilitySettings of the document. |
| IsWorksetVisible | Indicates whether the workset is visible by default. |
| SetWorksetVisibility | Set the default visibility of a workset. |

# See Also
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace