# AssetPropertyString Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyString Methods
AssetPropertyString Class See Also
---
The AssetPropertyString type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# See Also
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace