# ExportLineweightKey Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLineweightKey Methods
ExportLineweightKey Class See Also
---
The ExportLineweightKey type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExportLineweightKey Class
Autodesk.Revit.DB Namespace