# SolidOrShellTessellationControls Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidOrShellTessellationControls Methods
SolidOrShellTessellationControls Class See Also
---
The SolidOrShellTessellationControls type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DisableLevelOfDetail | Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |
| Dispose |
| UseLevelOfDetail | Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace