# BuildingEnvelopeAnalyzerOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingEnvelopeAnalyzerOptions Methods
BuildingEnvelopeAnalyzerOptions Class See Also
---
The BuildingEnvelopeAnalyzerOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace