# UpdaterId Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UpdaterId Methods
UpdaterId Class See Also
---
The UpdaterId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetAddInId | AddInId of the UpdaterId |
| GetGUID | GUID value of the UpdaterId |

# See Also
UpdaterId Class
Autodesk.Revit.DB Namespace