# CanExecuteEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CanExecuteEventArgs Properties
CanExecuteEventArgs Class See Also
---
The CanExecuteEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanExecute | The value that indicates whether the Command associated with this event can be executed. |
| IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state. |

# See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace