# LinkLoadContent Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkLoadContent Methods
LinkLoadContent Class See Also
---
The LinkLoadContent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetLinkDataPath | Returns the Link data path owned by this LinkLoadContent object. |
| GetLinkLoadResult | Retrieves the LinkLoadResult of the attempt to load or reload a Revit link. |
| SetLinkDataPath | Sets the Link data path owned by this LinkLoadContent object. |

# See Also
LinkLoadContent Class
Autodesk.Revit.DB Namespace