# Fascia Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Fascia Methods
Fascia Class See Also
---
The Fascia type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSegment | Add segments to the fascia. (Overrides HostedSweep..::..AddSegment(Reference).) |

# See Also
Fascia Class
Autodesk.Revit.DB.Architecture Namespace