# VendorIdAttribute Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VendorIdAttribute Members
VendorIdAttribute Class Constructors Methods Properties See Also
---
The VendorIdAttribute type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VendorIdAttribute | Constructs a new VendorIdAttribute. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | AddInId VendorId value. |

# See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace