# FaceArrayIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceArrayIterator Properties
FaceArrayIterator Class See Also
---
The FaceArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
FaceArrayIterator Class
Autodesk.Revit.DB Namespace