# RebarShapeConstraint180DegreeBendArcLength Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint180DegreeBendArcLength Members
RebarShapeConstraint180DegreeBendArcLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraint180DegreeBendArcLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraint180DegreeBendArcLength | Create a 180-degree bend constraint driven by arc length. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RebarShapeConstraint180DegreeBendArcLength Class
Autodesk.Revit.DB.Structure Namespace