# ExternalDataInstanceRemovedFromDocumentEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDataInstanceRemovedFromDocumentEventArgs Properties
ExternalDataInstanceRemovedFromDocumentEventArgs Class See Also
---
The ExternalDataInstanceRemovedFromDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeId | The type id of the external data instance id that has been removed from Revit document. |

# See Also
ExternalDataInstanceRemovedFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace