# DataConversionMonitorScope Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DataConversionMonitorScope Methods
DataConversionMonitorScope Class See Also
---
The DataConversionMonitorScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace