# IStructuralSectionsServer Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IStructuralSectionsServer Members
IStructuralSectionsServer Interface Methods See Also
---
The IStructuralSectionsServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionsUpdate | The server's method that will be called when Revit User clicks the Section Type parameter's button in the family dialog. |

# See Also
IStructuralSectionsServer Interface
Autodesk.Revit.DB.Structure Namespace