# PlanTopology Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanTopology Properties
PlanTopology Class See Also
---
The PlanTopology type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Circuits | The Circuits of the PlanTopology. |
| Level | The Level of the PlanTopology. |
| Phase | The phase of the PlanTopology. |

# See Also
PlanTopology Class
Autodesk.Revit.DB Namespace