# IFCFileModelOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFileModelOptions Methods
IFCFileModelOptions Class See Also
---
The IFCFileModelOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace