# LoadComponent Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadComponent Methods
LoadComponent Class See Also
---
The LoadComponent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace