# BaseElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsLanding..::..BaseElevation Property
StairsLanding Class See Also
---
The base elevation of the landing.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double BaseElevation { get; set; }
```

Visual Basic
---
```text
Public Property BaseElevation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BaseElevation {
	double get ();
	void set (double value);
}
```

# ### Field Value
The base elevation is relative elevation against base elevation of the stairs to which the stairs run belongs to. When setting this property the base elevation will be rounded automatically to a multiple of the riser height.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for height must be no more than 30000 feet in absolute value. -or- When setting this property: The height is less than half of the riser height of the stairs. |

# See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace