# FamilySizeTable Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySizeTable Methods
FamilySizeTable Class See Also
---
The FamilySizeTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AsValueString | Gets the table cell value as a string. |
| Dispose |
| GetColumnHeader | Gets a column of the table at at given index. |
| IsValidColumnIndex | Checks if the column index is valid. |

# See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace