# CableTraySettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTraySettings Methods
CableTraySettings Class See Also
---
The CableTraySettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetCableTraySettings | Gets the cable tray settings of the project. |

# See Also
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace