# EnergyAnalysisSpace Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyAnalysisSpace Properties
EnergyAnalysisSpace Class See Also
---
The EnergyAnalysisSpace type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The area for this space. |
| CADObjectUniqueId | The unique id of the originating CAD object (model element) associated with this space. |
| ComposedName | The composed name for this space. |
| Description | The description. |
| Number | The number to identify the space. |
| SpaceName | The name. |
| Volume | The volume for this space. |

# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace