# ContinuousRail Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContinuousRail Properties
ContinuousRail Class See Also
---
The ContinuousRail type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostRailingId | The id of the host Railing that contains this rail. |
| Length | The length of the rail. |

# See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace