# PointOnEdgeFaceIntersection Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnEdgeFaceIntersection Methods
PointOnEdgeFaceIntersection Class See Also
---
The PointOnEdgeFaceIntersection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEdgeReference | Get a copy of the edge or curve reference. |
| GetFaceReference | Get a copy of the face reference. |
| SetEdgeReference | Change the edge or curve reference. |
| SetFaceReference | Change the face reference. |

# See Also
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace