# PerformanceAdviserRuleId Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PerformanceAdviserRuleId Members
PerformanceAdviserRuleId Class Constructors Methods Operators Properties See Also
---
The PerformanceAdviserRuleId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PerformanceAdviserRuleId | Creates a new PerformanceAdviserRuleId instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two PerformanceAdviserRuleId instances. |
| Inequality | Compares two PerformanceAdviserRuleId instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
PerformanceAdviserRuleId Class
Autodesk.Revit.DB Namespace