# Control Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Control Members
Control Class Methods Properties See Also
---
The Control type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Origin | The control origin. |
| Shape | The control shape. |
| View | The view. |

# See Also
Control Class
Autodesk.Revit.DB Namespace