# LoadNature Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadNature Members
LoadNature Class Methods Properties See Also
---
The LoadNature type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new LoadNature. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
LoadNature Class
Autodesk.Revit.DB.Structure Namespace