# DialogBoxData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DialogBoxData Properties
DialogBoxData Class See Also
---
The DialogBoxData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HelpId | An ID that represents the dialog that has been displayed. |

# See Also
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace