# DimensionSegment Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionSegment Methods
DimensionSegment Class See Also
---
The DimensionSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderPosition. |
| ResetTextPosition | Resets the text position of the segment to the initial position determined by its type and parameters. |

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace