# SolidCurveIntersection Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidCurveIntersection Methods
SolidCurveIntersection Class See Also
---
The SolidCurveIntersection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetCurveSegment | Gets the curve segment generated by intersection. |
| GetCurveSegmentExtents | Gets the extents for the given curve segment generated by intersection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |

# See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace