# ViewActivatingEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewActivatingEventArgs Members
ViewActivatingEventArgs Class Methods Properties See Also
---
The ViewActivatingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentActiveView | The view that is currently active. |
| NewActiveView | The view that is going to become active. |

# See Also
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace