# PlanCircuit Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanCircuit Properties
PlanCircuit Class See Also
---
The PlanCircuit type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The enclosed area of the circuit. |
| IsRoomLocated | Reports whether there is a room located in this circuit. |
| SideNum | The number of sides in the circuit. |

# See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace