# RevitAPIPostDocEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIPostDocEventArgs Members
RevitAPIPostDocEventArgs Class Methods Properties See Also
---
The RevitAPIPostDocEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
RevitAPIPostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace