# InstanceNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InstanceNode Members
InstanceNode Class Methods Properties See Also
---
The InstanceNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSymbolGeometryId | Gets the SymbolGeometryId associated with the node. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
InstanceNode Class
Autodesk.Revit.DB Namespace