# CircuitNamingScheme Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CircuitNamingScheme Methods
CircuitNamingScheme Class See Also
---
The CircuitNamingScheme type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new CircuitNamingScheme. |
| GetCombinedParameters | Gets the combined parameters. |
| IsNameUnique | Validates whether the CircuitNamingScheme name is unique in document. |
| IsValidCombinedParameters | Validates whether the combined parameters is valid. |
| SetCombinedParameters | Sets combined parameters array. |

# See Also
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace