# BoundingBoxIsInsideFilter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundingBoxIsInsideFilter Methods
BoundingBoxIsInsideFilter Class See Also
---
The BoundingBoxIsInsideFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBoundingBox | Gets the outline being used for this filter. |

# See Also
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace