# TriangulationInterface Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulationInterface Members
TriangulationInterface Class Methods Properties See Also
---
The TriangulationInterface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the TriangulationInterface |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
TriangulationInterface Class
Autodesk.Revit.DB Namespace