# BendingDetailCustomFieldProperties Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BendingDetailCustomFieldProperties Methods
BendingDetailCustomFieldProperties Class See Also
---
The BendingDetailCustomFieldProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreEqualTo | Identifies if the custom field properties are equal or not. |
| Dispose |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace