# MechanicalSystemType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalSystemType Properties
MechanicalSystemType Class See Also
---
The MechanicalSystemType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RiseDropSettings | indicates the rise/drop symbol given the system type |

# See Also
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace