# VertexStreamPositionNormalColored Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStreamPositionNormalColored Methods
VertexStreamPositionNormalColored Class See Also
---
The VertexStreamPositionNormalColored type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddVertex | Inserts a VertexStreamPositionNormalColored into the stream and associated buffer. |
| AddVertices | Inserts multiple VertexStreamPositionNormalColored instances into the stream and associated buffer. |

# See Also
VertexStreamPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace