# CommandEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CommandEventArgs Members
CommandEventArgs Class Methods Properties See Also
---
The CommandEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveDocument | The active document. |
| CommandId | The command id. |

# See Also
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace