# CurveLoopsProfile Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveLoopsProfile Members
CurveLoopsProfile Class Methods Properties See Also
---
The CurveLoopsProfile type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Profile | Returns the curve loops of the profile. |

# See Also
CurveLoopsProfile Class
Autodesk.Revit.DB Namespace