# StructuralSectionZProfile Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionZProfile Members
StructuralSectionZProfile Class Constructors Methods Properties See Also
---
The StructuralSectionZProfile type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionZProfile | Creates a new instance of Structural Section Z Profile shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionZProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace