# VertexPositionNormalColored Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPositionNormalColored Properties
VertexPositionNormalColored Class See Also
---
The VertexPositionNormalColored type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Normal | The vertex's normal vector. |
| Position | The vertex's position. |

# See Also
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace