# SpaceTag Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpaceTag Properties
SpaceTag Class See Also
---
The SpaceTag type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Space | The space that the tag is associated with. |
| SpaceTagType | The tag type. |

# See Also
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace