# InitialWattageIntensity Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialWattageIntensity Properties
InitialWattageIntensity Class See Also
---
The InitialWattageIntensity type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Efficacy | The efficacy value. |
| Wattage | The wattage value. |

# See Also
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace