# AreaReinforcementType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaReinforcementType Methods
AreaReinforcementType Class See Also
---
The AreaReinforcementType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefaultAreaReinforcementType | Creates a new AreaReinforcementType object with a default name. |

# See Also
AreaReinforcementType Class
Autodesk.Revit.DB.Structure Namespace