# ExternallyTaggedBRep Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedBRep Members
ExternallyTaggedBRep Class Methods Properties See Also
---
The ExternallyTaggedBRep type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetTaggedGeometry | Returns the externally tagged geometry object. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace