# FieldValues Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldValues Methods
FieldValues Class See Also
---
The FieldValues type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FieldValues Class
Autodesk.Revit.DB.Analysis Namespace