# CanExecuteEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CanExecuteEventArgs Methods
CanExecuteEventArgs Class See Also
---
The CanExecuteEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSelectedCategoryIds | Gets the category ids of selected elements. |

# See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace