# PipeSegment Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeSegment Members
PipeSegment Class Methods Properties See Also
---
The PipeSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a PipeSegment and adds it to the document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ScheduleTypeId | The ElementId of the PipeScheduleType. |

# See Also
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace