# RoomTag Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoomTag Properties
RoomTag Class See Also
---
The RoomTag type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsInRoom | Identifies if the tag is located in a room. |
| Room | The room that the tag is associated with. |
| RoomTagType | The tag type. |
| TaggedLocalRoomId | The ElementId of the tagged room. |
| TaggedRoomId | The LinkElementId of the tagged room. |

# See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace