# ParameterElement Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterElement Methods
ParameterElement Class See Also
---
The ParameterElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDefinition | Get the definition representing this parameter element. |

# See Also
ParameterElement Class
Autodesk.Revit.DB Namespace