# ExtrusionRoof Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtrusionRoof Properties
ExtrusionRoof Class See Also
---
The ExtrusionRoof type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof. |

# See Also
ExtrusionRoof Class
Autodesk.Revit.DB Namespace