# BindingMap Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BindingMap Properties
BindingMap Class See Also
---
The BindingMap type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Item | The get_Item method will get the binding item related to the input key. (Overrides [DefinitionBindingMap..::..Item[([( Definition])]) ](32246a7a-2590-652b-0ea6-975b9101a327.md "Item Property").) |

# See Also
BindingMap Class
Autodesk.Revit.DB Namespace