# EdgeArrayArrayIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArrayArrayIterator Methods
EdgeArrayArrayIterator Class See Also
---
The EdgeArrayArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
EdgeArrayArrayIterator Class
Autodesk.Revit.DB Namespace