# ExportPatternInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportPatternInfo Methods
ExportPatternInfo Class See Also
---
The ExportPatternInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExportPatternInfo Class
Autodesk.Revit.DB Namespace