# IndexStreamPoint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexStreamPoint Members
IndexStreamPoint Class Methods Properties See Also
---
The IndexStreamPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddPoint | Inserts a IndexPoint into the stream and associated buffer. |
| AddPoints | Inserts multiple IndexPoint instances into the stream and associated buffer. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace