# IFCExportOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExportOptions Methods
IFCExportOptions Class See Also
---
The IFCExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddOption | Adds a new named option to the options structure. |
| Assign | Assigns the values of the IFCExportOptions to this options object. |
| Dispose |

# See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace