# IFCAnyHandle Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCAnyHandle Methods
IFCAnyHandle Class See Also
---
The IFCAnyHandle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateAggregateAttribute | Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef |
| Delete | Deletes the handle. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetAttribute | Gets the attribute by name. |
| GetHashCode | Gets the integer value of the id as hash code  (Overrides Object..::..GetHashCode()()()().) |
| IsSubTypeOf | Determines whether the instance is an instance of the specified instance type or a subtype of this instance type. |
| IsTypeOf | Determines whether the instance is an instance of exactly the specified instance type. |
| SetAttribute(String, IFCAnyHandle) | Sets the attribute value. |
| SetAttribute(String, IFCData) | Sets the attribute value. |
| SetAttribute(String, Boolean) | Sets the attribute value. |
| SetAttribute(String, IList<(Of <<'(IFCAnyHandle>)>>)) |
| SetAttribute(String, IList<(Of <<'(Boolean>)>>)) |
| SetAttribute(String, IList<(Of <<'(Double>)>>)) |
| SetAttribute(String, IList<(Of <<'(Int32>)>>)) |
| SetAttribute(String, IList<(Of <<'(String>)>>)) |
| SetAttribute(String, ISet<(Of <<'(IFCAnyHandle>)>>)) |
| SetAttribute(String, ISet<(Of <<'(Boolean>)>>)) |
| SetAttribute(String, ISet<(Of <<'(Double>)>>)) |
| SetAttribute(String, ISet<(Of <<'(Int32>)>>)) |
| SetAttribute(String, ISet<(Of <<'(String>)>>)) |
| SetAttribute(String, Double) | Sets the attribute value. |
| SetAttribute(String, Int32) | Sets the attribute value. |
| SetAttribute(String, String) | Sets the attribute value. |
| UnsetAttribute | Unsets the attribute value. |

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace