# PointOnPlane Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnPlane Methods
PointOnPlane Class See Also
---
The PointOnPlane type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetPlaneReference | The geometric plane reference. |
| IsValidPlaneReference | Check whether a geometry reference corresponds to a referenceable plane. |
| NewPointOnPlane | Construct a PointOnPlane given a reference and a location in space. |
| SetPlaneReference | Change the geometric plane reference. |

# See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace