# LayoutRuleFixedNumber Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LayoutRuleFixedNumber Properties
LayoutRuleFixedNumber Class See Also
---
The LayoutRuleFixedNumber type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumberOfLines | Get or set the number of the beams in a beam system. |

# See Also
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace