# ExternalDataInstanceAddingIntoDocumentEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDataInstanceAddingIntoDocumentEventArgs Members
ExternalDataInstanceAddingIntoDocumentEventArgs Class Methods Properties See Also
---
The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeId | The type id of the newl external data instance that is being added. |

# See Also
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace