# FailureDefinitionId Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureDefinitionId Members
FailureDefinitionId Class Constructors Methods Operators Properties See Also
---
The FailureDefinitionId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FailureDefinitionId | Creates a new FailureDefinitionId instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two FailureDefinitionId instances. |
| Inequality | Compares two FailureDefinitionId instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FailureDefinitionId Class
Autodesk.Revit.DB Namespace