# HostedSweep Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HostedSweep Methods
HostedSweep Class See Also
---
The HostedSweep type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSegment | Add segments to the hosted sweep object. |
| GetEndPointParameter | Retrieve segment's start point or end point parameter. |
| HorizontalFlip | Flip the hosted sweep object along horizontal line. |
| RemoveSegment | Remove segments from the hosted sweep object. |
| SetEndPointParameter | Set segment's start point or end point parameter. |
| VerticalFlip | Flip the hosted sweep object along vertical line. |

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace