# Grid Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Grid Properties
Grid Class See Also
---
The Grid type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Curve | Retrieves an object that represents the geometry of the grid line. |
| IsCurved | Identifies if the grid line is curved or straight. |

# See Also
Grid Class
Autodesk.Revit.DB Namespace