# Leader Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Leader Properties
Leader Class See Also
---
The Leader type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Anchor | Anchor point of the Leader |
| Elbow | Elbow point of the Leader. |
| End | End point of the Leader. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LeaderShape | Geometric style of the leader |

# See Also
Leader Class
Autodesk.Revit.DB Namespace