# SpatialElementFromToCalculationPoints Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementFromToCalculationPoints Properties
SpatialElementFromToCalculationPoints Class See Also
---
The SpatialElementFromToCalculationPoints type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FromPosition | The "from" position of spatial element connecting calculation point. |
| ToPosition | The "to" position of spatial element connecting calculation point. |

# See Also
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace