# RebarShapeSegment Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeSegment Methods
RebarShapeSegment Class See Also
---
The RebarShapeSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetConstraints | Retrieve the list of constraints associated with this segment. |
| SetConstraints | Assign a new list of constraints to this segment. |

# See Also
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace