# BeforeExecutedEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BeforeExecutedEventArgs Properties
BeforeExecutedEventArgs Class See Also
---
The BeforeExecutedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| UsingCommandData | Indicates whether or not the Revit journal will include custom data populated by the application associated with this command. |

# See Also
BeforeExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace