# LinkedResourceOpenedEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkedResourceOpenedEventArgs Members
LinkedResourceOpenedEventArgs Class Methods Properties See Also
---
The LinkedResourceOpenedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LinkedResourcePathName | Path of the linked resource. |
| ResourceType | The desired linked resource type. |
| ResourceTypeId | Element id of the linked resource. |

# See Also
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace