# PipeSegment Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeSegment Properties
PipeSegment Class See Also
---
The PipeSegment type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ScheduleTypeId | The ElementId of the PipeScheduleType. |

# See Also
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace