# ParameterValuePresenceRule Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterValuePresenceRule Properties
ParameterValuePresenceRule Class See Also
---
The ParameterValuePresenceRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Parameter | The parameter which will be evaluated to pass this rule. |

# See Also
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace