# ExternalGeometryId Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalGeometryId Methods
ExternalGeometryId Class See Also
---
The ExternalGeometryId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the hash code.  (Overrides Object..::..GetHashCode()()()().) |
| IsValidExternalGeometryId | Checks whether a given string represents a valid ExternalGeometryId or not. |

# See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace