# Instance Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Instance Methods
Instance Class See Also
---
The Instance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetTotalTransform | Gets the total transform, which includes the true north transform for instances like import instances. |
| GetTransform | Gets the transform of the instance. |

# See Also
Instance Class
Autodesk.Revit.DB Namespace