# SystemsAnalysisOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SystemsAnalysisOptions Methods
SystemsAnalysisOptions Class See Also
---
The SystemsAnalysisOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace