# CircuitNamingSchemeSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CircuitNamingSchemeSettings Methods
CircuitNamingSchemeSettings Class See Also
---
The CircuitNamingSchemeSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetCircuitNamingSchemeSettings | Gets the circuit naming scheme settings of the project. |
| IsValidCircuitNamingSchemeId | Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings. |

# See Also
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace