# ViewsExportingByContextEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewsExportingByContextEventArgs Members
ViewsExportingByContextEventArgs Class Methods Properties See Also
---
The ViewsExportingByContextEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetViewIds | Gets the views about to be exported by CustomExporter. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ViewsExportingByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace