# DuctFittingAndAccessoryPressureDropUIDataItem Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIDataItem Methods
DuctFittingAndAccessoryPressureDropUIDataItem Class See Also
---
The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDuctFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
| GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
| SetEntity | Stores the entity in the UI data item. |

# See Also
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace