# FilterGlobalParameterAssociationRule Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterGlobalParameterAssociationRule Properties
FilterGlobalParameterAssociationRule Class See Also
---
The FilterGlobalParameterAssociationRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RuleValue | The user-supplied global parameter value against which values from a Revit document will be tested. |

# See Also
FilterGlobalParameterAssociationRule Class
Autodesk.Revit.DB Namespace