# NumericRevisionSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NumericRevisionSettings Methods
NumericRevisionSettings Class See Also
---
The NumericRevisionSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsEqual | Determines whether a specified NumericRevisionSettings is the same as 'this'. |
| IsValid | Determines whether the NumericRevisionSettings object is in a valid state. |

# See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace