# IIFCEntityTreeUIServer Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IIFCEntityTreeUIServer Methods
IIFCEntityTreeUIServer Interface See Also
---
The IIFCEntityTreeUIServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ShowDialog | Shows dialog on managing IFCEntityTreeUI. |

# See Also
IIFCEntityTreeUIServer Interface
Autodesk.Revit.UI Namespace