# PhaseArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhaseArray Methods
PhaseArray Class See Also
---
The PhaseArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the phase to the end of the array. |
| Clear | Removes every phase from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert | Insert the specified phase into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
PhaseArray Class
Autodesk.Revit.DB Namespace