# AssetPropertyTime Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyTime Members
AssetPropertyTime Class Methods Properties See Also
---
The AssetPropertyTime type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | Get the value of the property |

# See Also
AssetPropertyTime Class
Autodesk.Revit.DB.Visual Namespace