# MechanicalEquipmentSetType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalEquipmentSetType Methods
MechanicalEquipmentSetType Class See Also
---
The MechanicalEquipmentSetType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new type of a mechanical equipment set and adds it to the document. |

# See Also
MechanicalEquipmentSetType Class
Autodesk.Revit.DB.Mechanical Namespace