# PartMaker Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PartMaker Members
PartMaker Class Methods Properties See Also
---
The PartMaker type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSourceElementIds | Get the source elements for the PartMaker. |
| IsSourceElement | Is the element a source for this PartMaker |
| SetSourceElementIds | Set the source elements for the PartMaker. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
PartMaker Class
Autodesk.Revit.DB Namespace