# InapplicableDataException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InapplicableDataException Methods
InapplicableDataException Class See Also
---
The InapplicableDataException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
InapplicableDataException Class
Autodesk.Revit.Exceptions Namespace