# DWGExportOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWGExportOptions Methods
DWGExportOptions Class See Also
---
The DWGExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetPredefinedOptions | Returns an instance DWGExportOptions containing settings from a predefined export setup. |

# See Also
DWGExportOptions Class
Autodesk.Revit.DB Namespace