# StructuralSectionGeneralF Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralF Members
StructuralSectionGeneralF Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralF type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralF | Creates a new instance of Structural Section Flat Bar. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionGeneralF Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace