# FaceArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceArray Methods
FaceArray Class See Also
---
The FaceArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the face to the end of the array. |
| Clear | Removes every face from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert | Insert the specified face into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
FaceArray Class
Autodesk.Revit.DB Namespace