# ReinforcementData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReinforcementData Members
ReinforcementData Class Methods Properties See Also
---
The ReinforcementData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ReinforcementData |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ReinforcementData Class
Autodesk.Revit.DB.Structure Namespace