# ImageBackgroundSettings Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImageBackgroundSettings Members
ImageBackgroundSettings Class Methods Properties See Also
---
The ImageBackgroundSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BackgroundImageFit | The background image fit type. |
| FilePath | File path of the image for the rendering background. |
| OffsetHeight | The vertical offset of the rendering image to the rendering region. |
| OffsetWidth | The horizontal offset of the rendering image to the rendering region. |

# See Also
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace