# MessageBoxData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MessageBoxData Properties
MessageBoxData Class See Also
---
The MessageBoxData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DialogType | An integer that describes the standard windows type of the dialog box. |
| Message | The message that has been displayed in the dialog box. |

# See Also
MessageBoxData Class
Autodesk.Revit.UI.Events Namespace