# GetRebarConstraintTargetHostFaceType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetRebarConstraintTargetHostFaceType Method
RebarConstraint Class See Also
---
Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarConstraintTargetHostFaceType GetRebarConstraintTargetHostFaceType()
```

Visual Basic
---
```text
Public Function GetRebarConstraintTargetHostFaceType As RebarConstraintTargetHostFaceType
```

Visual C++
---
```text
public:
RebarConstraintTargetHostFaceType GetRebarConstraintTargetHostFaceType()
```

# ### Return Value
Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.' -or- Multi target constraint. Consider using the indexed version of the method. |

# See Also
RebarConstraint Class
GetRebarConstraintTargetHostFaceType Overload
Autodesk.Revit.DB.Structure Namespace