# MEPAnalyticalNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalNode Methods
MEPAnalyticalNode Class See Also
---
The MEPAnalyticalNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsSameNode | Verify if this node is connected to the other node and thus represents the same analytical node in the network. |

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace