# DisplayingOptionsDialogEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisplayingOptionsDialogEventArgs Properties
DisplayingOptionsDialogEventArgs Class See Also
---
The DisplayingOptionsDialogEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PagesCount | The count of pages in the options dialog (include the default pages added by Revit). |

# See Also
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace