# ShapeImporter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ShapeImporter Methods
ShapeImporter Class See Also
---
The ShapeImporter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Convert | Converts the geometry stored in the external format into a collection of Revit geometry objects. |
| Dispose |
| IsServiceAvailable | Checks whether the data conversion service is available. |
| SetDefaultLengthUnit | Sets the length unit to be used when the input is a unitless SAT file. |

# See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace