# FaceArray Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceArray Properties
FaceArray Class See Also
---
The FaceArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a face at a specified index within the array. |
| Size | Returns the number of faces that are in the array. |

# See Also
FaceArray Class
Autodesk.Revit.DB Namespace