# DistributionSysTypeSetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DistributionSysTypeSetIterator Methods
DistributionSysTypeSetIterator Class See Also
---
The DistributionSysTypeSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
DistributionSysTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace