# CentralModelAlreadyExistsException Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelAlreadyExistsException Members
CentralModelAlreadyExistsException Class Methods Properties See Also
---
The CentralModelAlreadyExistsException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides CentralModelException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
CentralModelAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace