# SelectionChangedEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SelectionChangedEventArgs Methods
SelectionChangedEventArgs Class See Also
---
The SelectionChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDocument | Returns the document associated with this event. |
| GetReferences | Returns the references that are currently selected. |
| GetSelectedElements | Returns ElementIds of selected elements. |

# See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace