# VertexStream Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStream Methods
VertexStream Class See Also
---
The VertexStream type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
VertexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace