# Entity Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Entity Methods
Entity Class See Also
---
The Entity type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear(String) | Resets the field to its default value. |
| Clear(Field) | Resets the field to its default value. |
| Dispose |
| Get<(Of <<'(FieldType>)>>)(String) | Retrieves the value of the field in the entity. |
| Get<(Of <<'(FieldType>)>>)(Field) | Retrieves the value of the field in the entity. |
| Get<(Of <<'(FieldType>)>>)(String, ForgeTypeId) | Retrieves the value of the field in the entity. |
| Get<(Of <<'(FieldType>)>>)(Field, ForgeTypeId) | Retrieves the value of the field in the entity. |
| IsValid | Checks whether this Entity has a live Schema corresponding to it. |
| ReadAccessGranted | Checks whether this Entity may be retrieved by the current add-in. |
| RecognizedField | Checks whether a Field belongs to the same Schema as this Entity. |
| Set<(Of <<'(FieldType>)>>)(String, FieldType) | Stores the value of the field in the entity. |
| Set<(Of <<'(FieldType>)>>)(Field, FieldType) | Stores the value of the field in the entity. |
| Set<(Of <<'(FieldType>)>>)(String, FieldType, ForgeTypeId) | Stores the value of the field in the entity. |
| Set<(Of <<'(FieldType>)>>)(Field, FieldType, ForgeTypeId) | Stores the value of the field in the entity. |
| WriteAccessGranted | Checks whether this Entity may be stored by the current add-in. |

# See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace