# EndTreatmentType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EndTreatmentType Properties
EndTreatmentType Class See Also
---
The EndTreatmentType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EndTreatment | String describing the end treatment |

# See Also
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace