# ZoneEquipmentData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ZoneEquipmentData Methods
ZoneEquipmentData Class See Also
---
The ZoneEquipmentData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsDataCompleted | Is the required data completed for this zone equipment? |

# See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace