# ContourSettingItem Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContourSettingItem Methods
ContourSettingItem Class See Also
---
The ContourSettingItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ContourSettingItem Class
Autodesk.Revit.DB Namespace