# VertexPosition Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPosition Properties
VertexPosition Class See Also
---
The VertexPosition type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Position | The vertex's position. |

# See Also
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace