# VisibleInViewFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VisibleInViewFilter Members
VisibleInViewFilter Class Constructors Methods Properties See Also
---
The VisibleInViewFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VisibleInViewFilter(Document, ElementId) | Constructs a new instance of a VisibleInViewFilter. |
| VisibleInViewFilter(Document, ElementId, Boolean) | Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
VisibleInViewFilter Class
Autodesk.Revit.DB Namespace