# LinkNode Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkNode Properties
LinkNode Class See Also
---
The LinkNode type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SymbolId | Identifies the Id of the symbol associated with the node. |

# See Also
LinkNode Class
Autodesk.Revit.DB Namespace