# StructuralSectionSigmaProfile Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionSigmaProfile Properties
StructuralSectionSigmaProfile Class See Also
---
The StructuralSectionSigmaProfile type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendWidth | Bend segment width. |
| MiddleBendLength | Middle Bend segment length. |
| TopBendLength | Top Bend segment length. |

# See Also
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace