# ElementBinding Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementBinding Members
ElementBinding Class Methods Properties See Also
---
The ElementBinding type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Categories | Retrieve or set the categories to which a parameter definition will be bound. |

# See Also
ElementBinding Class
Autodesk.Revit.DB Namespace