# ExternalResourceLoadContent Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceLoadContent Methods
ExternalResourceLoadContent Class See Also
---
The ExternalResourceLoadContent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExternalResourceLoadContent Class
Autodesk.Revit.DB Namespace