# AddInIdAttribute Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AddInIdAttribute Properties
AddInIdAttribute Class See Also
---
The AddInIdAttribute type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | AddInId guid value. |

# See Also
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace