# ApplicationException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationException Methods
ApplicationException Class See Also
---
The ApplicationException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides Exception..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ApplicationException Class
Autodesk.Revit.Exceptions Namespace