# CableTrayConduitBase Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTrayConduitBase Methods
CableTrayConduitBase Class See Also
---
The CableTrayConduitBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidEndPoints | Identifies if two end points are valid. |
| IsValidLevelId | Identifies if a level id is valid. |
| IsWithFitting | Return whether its cable tray/conduit type is with fitting |

# See Also
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace