# StructuralConnectionSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralConnectionSettings Properties
StructuralConnectionSettings Class See Also
---
The StructuralConnectionSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IncludeWarningControls | This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed. |

# See Also
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace