# IFCLinkDocumentExportScope Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCLinkDocumentExportScope Methods
IFCLinkDocumentExportScope Class See Also
---
The IFCLinkDocumentExportScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace