# FabricReinSpanSymbol Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricReinSpanSymbol Members
FabricReinSpanSymbol Class Methods Properties See Also
---
The FabricReinSpanSymbol type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FabricReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace