# FabricationItemFile Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationItemFile Methods
FabricationItemFile Class See Also
---
The FabricationItemFile type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetImage | Gets the image for the fabrication item file. |
| IsLoaded | Checks to see if the item file has been loaded into the configuration. |
| IsValid | Checks to see if the item file is valid. |

# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace