# PipingSystem Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipingSystem Properties
PipingSystem Class See Also
---
The PipingSystem type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BaseEquipmentConnector | The connector within base equipment which is used to connect with system. |
| IsWellConnected | Indicates if the system is well connected or not. |
| PipingNetwork | Pipes and fittings which are contained in this system. |
| SystemType | The type of this piping system. |

# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace