# PanelScheduleSheetInstance Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PanelScheduleSheetInstance Methods
PanelScheduleSheetInstance Class See Also
---
The PanelScheduleSheetInstance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of panel schedule on sheet and adds it to the document. |
| GetSchedule | Gets the panel schedule view. |
| SplitSegment | Split the panel schedule into Thrown if the index is out of bounds. |

# See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace