# ModificationForbiddenException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModificationForbiddenException Methods
ModificationForbiddenException Class See Also
---
The ModificationForbiddenException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ModificationForbiddenException Class
Autodesk.Revit.Exceptions Namespace