# ViewFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewFamilyType..::..ViewFamily Property
ViewFamilyType Class Example See Also
---
The ViewFamily for this view type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ViewFamily ViewFamily { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewFamily As ViewFamily
	Get
```

Visual C++
---
```text
public:
property ViewFamily ViewFamily {
	ViewFamily get ();
}
```

# Examples
CopyC#
```text
public ViewFamily GetViewFamily(Document doc, View view)
{
    ViewFamily viewFamily = ViewFamily.Invalid;

    ElementId viewTypeId = view.GetTypeId();
    ElementId viewTypeIdOne = new ElementId(1L);
    if (viewTypeId > viewTypeIdOne) // some views may not have a ViewFamilyType
    {
        ViewFamilyType viewFamilyType = doc.GetElement(viewTypeId) as ViewFamilyType;
        viewFamily = viewFamilyType.ViewFamily;
    }

    return viewFamily;
}
```

CopyVB.NET
```text
Public Function GetViewFamily(doc As Document, view As View) As ViewFamily
    Dim viewFamily__1 As ViewFamily = ViewFamily.Invalid

    Dim viewTypeId As ElementId = view.GetTypeId()
    Dim viewTypeIdOne As ElementId = New ElementId(1L)
    If viewTypeId > viewTypeIdOne Then
        ' some views may not have a ViewFamilyType
        Dim viewFamilyType As ViewFamilyType = TryCast(doc.GetElement(viewTypeId), ViewFamilyType)
        viewFamily__1 = viewFamilyType.ViewFamily
    End If

    Return viewFamily__1
End Function
```

# See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace