# IndexPoint Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexPoint Methods
IndexPoint Class See Also
---
The IndexPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

# See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace