# ApplicationException Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationException Properties
ApplicationException Class See Also
---
The ApplicationException type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FunctionId | The information of the function throwing the exception. |

# See Also
ApplicationException Class
Autodesk.Revit.Exceptions Namespace