# InCanvasControlData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InCanvasControlData Methods
InCanvasControlData Class See Also
---
The InCanvasControlData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace