# RibbonButtonOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonButtonOptions Methods
RibbonButtonOptions Class See Also
---
The RibbonButtonOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace