# RebarShapeConstraintAngleFromFixedDir Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintAngleFromFixedDir Properties
RebarShapeConstraintAngleFromFixedDir Class See Also
---
The RebarShapeConstraintAngleFromFixedDir type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Direction | A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction. |
| Sign | When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise. |

# See Also
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace