# PathReinSpanSymbol Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathReinSpanSymbol Members
PathReinSpanSymbol Class Methods Properties See Also
---
The PathReinSpanSymbol type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of PathReinSpanSymbol in the project. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
PathReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace