# IFCHybridImport Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCHybridImport Methods
IFCHybridImport Class See Also
---
The IFCHybridImport type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMap |
| Dispose |
| ImportElements | Imports IFC Elements using non-open-source framework |

# See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace