# PostDocEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PostDocEventArgs Properties
PostDocEventArgs Class See Also
---
The PostDocEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
PostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace