# TransactionAttribute Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransactionAttribute Members
TransactionAttribute Class Constructors Methods Properties See Also
---
The TransactionAttribute type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TransactionAttribute | Constructs a new TransactionAttribute. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Mode | Transaction mode. |

# See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace