# AssetPropertyDistance Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDistance Methods
AssetPropertyDistance Class See Also
---
The AssetPropertyDistance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetUnitTypeId | Gets the identifier of the unit quantifying the distance property. |
| IsValidValue | Checks that the value is a valid value for this property. |

# See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace