# EvaluatedParameter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EvaluatedParameter Methods
EvaluatedParameter Class See Also
---
The EvaluatedParameter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AsValueString(Document) | Get the parameter value as a string with units. |
| AsValueString(Document, FormatOptions) | Get the parameter value as a string with units. |
| Dispose |

# See Also
EvaluatedParameter Class
Autodesk.Revit.DB Namespace