# FabricationServiceSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationServiceSettings Properties
FabricationServiceSettings Class See Also
---
The FabricationServiceSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AirFluidType | A special fluid type for fabrication HVAC services. |

# See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace