# PhaseArray Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhaseArray Properties
PhaseArray Class See Also
---
The PhaseArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a phase at a specified index within the array. |
| Size | Returns the number of phases that are in the array. |

# See Also
PhaseArray Class
Autodesk.Revit.DB Namespace