# ViewScheduleExportOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewScheduleExportOptions Methods
ViewScheduleExportOptions Class See Also
---
The ViewScheduleExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace