# ComboBoxData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxData Properties
ComboBoxData Class See Also
---
The ComboBoxData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Image | The image shown on the ComboBox. |

# See Also
ComboBoxData Class
Autodesk.Revit.UI Namespace