# PipePressureDropData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipePressureDropData Methods
PipePressureDropData Class See Also
---
The PipePressureDropData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace