# PipeFittingAndAccessoryPressureDropUIDataItem Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIDataItem Methods
PipeFittingAndAccessoryPressureDropUIDataItem Class See Also
---
The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
| GetPipeFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
| SetEntity | Stores the entity in the UI data item. |

# See Also
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace