# IFCExternalServiceUIData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExternalServiceUIData Methods
IFCExternalServiceUIData Class See Also
---
The IFCExternalServiceUIData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetParentHwnd | return the parent handle |
| GetRevitElementIds | return the list of revit Element Ids |

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace