# WireSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireSet Properties
WireSet Class See Also
---
The WireSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
WireSet Class
Autodesk.Revit.DB.Electrical Namespace