# TableView Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableView Properties
TableView Class See Also
---
The TableView type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MaximumColumnWidth | Gets the maximum column width |
| MaximumGridWidth | Gets the allowed maximum grid width |
| MaximumRowHeight | Gets the maximum row height |
| MinimumColumnWidth | Gets the minimum column width |
| MinimumRowHeight | Gets the minimum row height |
| TargetId | the element id of the element that is being viewed |

# See Also
TableView Class
Autodesk.Revit.DB Namespace