# ElectricalDemandFactorValue Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalDemandFactorValue Methods
ElectricalDemandFactorValue Class See Also
---
The ElectricalDemandFactorValue type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| SetMaxRangeToUnlimited | Sets the max range on the value to unlimited |

# See Also
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace