# TableCellStyle Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellStyle Methods
TableCellStyle Class See Also
---
The TableCellStyle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCellStyleOverrideOptions | Gets cell style override options of this cell. |
| ResetOverride | Resets any overrides applied to this cell. |
| SetCellStyleOverrideOptions | Sets cell style override options of this cell. |

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace