# ExternalResourceLoadData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceLoadData Methods
ExternalResourceLoadData Class See Also
---
The ExternalResourceLoadData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetExternalResourceReference | Returns the ExternalResourceReference that identifies which resource should be loaded. |
| GetLoadContent | Returns the ExternalResourceLoadContent resulting from this load operation. |
| GetLoadContext | Returns an object containing information about the context of the load operation. |
| GetLoadRequestId | Returns the load operation GUID. |

# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace