# CurveLoopIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveLoopIterator Methods
CurveLoopIterator Class See Also
---
The CurveLoopIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
CurveLoopIterator Class
Autodesk.Revit.DB Namespace