# ProjectPosition Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ProjectPosition Methods
ProjectPosition Class See Also
---
The ProjectPosition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace