# ComboBox Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBox Methods
ComboBox Class See Also
---
The ComboBox type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddItem | Adds a new item to the ComboBox. |
| AddItems | Adds a new items to the ComboBox. |
| AddSeparator | Adds a separator to the drop-down list. |
| GetItems | Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox. |

# See Also
ComboBox Class
Autodesk.Revit.UI Namespace