# FileImportingEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileImportingEventArgs Properties
FileImportingEventArgs Class See Also
---
The FileImportingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Format | Identifies the import format, e.g. DWG or image. |
| Path | Path of the source file which is about to be imported. |

# See Also
FileImportingEventArgs Class
Autodesk.Revit.DB.Events Namespace