# ArgumentException Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ArgumentException Properties
ArgumentException Class See Also
---
The ArgumentException type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Message | Gets the error message and the parameter name, or only the error message if no parameter name is set. (Overrides Exception..::..Message.) |
| ParamName | Gets the name of the parameter that causes this exception. |

# See Also
ArgumentException Class
Autodesk.Revit.Exceptions Namespace