# SweptBlend Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SweptBlend Methods
SweptBlend Class See Also
---
The SweptBlend type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles. |
| SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles. |

# See Also
SweptBlend Class
Autodesk.Revit.DB Namespace