# RegenerationFailedException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RegenerationFailedException Methods
RegenerationFailedException Class See Also
---
The RegenerationFailedException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
RegenerationFailedException Class
Autodesk.Revit.Exceptions Namespace