# FamilySymbol Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySymbol Properties
FamilySymbol Class See Also
---
The FamilySymbol type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Family | The Family object to which the symbol belongs. |
| IsActive | Identifies whether the symbol is active. |
| StructuralMaterialType | This property returns the physical material from which the type is made. |

# See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace