# DefinitionBindingMap Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionBindingMap Methods
DefinitionBindingMap Class See Also
---
The DefinitionBindingMap type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every binding from the map, rendering it empty. |
| Contains |
| Erase |
| ForwardIterator | Retrieve a forward moving iterator to the map. |
| GetEnumerator | Retrieve a forward moving iterator to the map. |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the map. |

# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace