# AnalyticalLinkType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalLinkType Properties
AnalyticalLinkType Class See Also
---
The AnalyticalLinkType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RotationX | Fixity of rotation around X. |
| RotationY | Fixity of rotation around Y. |
| RotationZ | Fixity of rotation around Z. |
| TranslationX | Fixity of translation along X. |
| TranslationY | Fixity of translation along Y. |
| TranslationZ | Fixity of translation along Z. |

# See Also
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace