# AssemblyMemberDifferentCategory Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentCategory Properties
AssemblyMemberDifferentCategory Class See Also
---
The AssemblyMemberDifferentCategory type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId1 | Category id of the first assembly member |
| CategoryId2 | Category id of the second assembly member |

# See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace