# FamilyPointLocation Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyPointLocation Properties
FamilyPointLocation Class See Also
---
The FamilyPointLocation type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The name of the corresponding reference point in the Family document. |

# See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace