# ConicalFace Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConicalFace Members
ConicalFace Class Methods Properties See Also
---
The ConicalFace type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Axis | Axis of the surface. |
| HalfAngle | Half angle of the surface. |
| Origin | Origin of the surface. |
| Radius | Radii of the surface. |

# See Also
ConicalFace Class
Autodesk.Revit.DB Namespace