# LineProperties Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LineProperties Methods
LineProperties Class See Also
---
The LineProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
LineProperties Class
Autodesk.Revit.DB Namespace