# ElectricalAnalyticalLoadSet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalAnalyticalLoadSet Methods
ElectricalAnalyticalLoadSet Class See Also
---
The ElectricalAnalyticalLoadSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an electrical analytical load set. |
| GetLoadIds | Gets Equipment Load ids in the LoadSet. |

# See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace