# MEPBuildingConstructionSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPBuildingConstructionSet Properties
MEPBuildingConstructionSet Class See Also
---
The MEPBuildingConstructionSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of MEPBuildingConstructions that are in the set. |

# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace