# Toposolid Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Toposolid Properties
Toposolid Class See Also
---
The Toposolid type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostTopoId | The host toposolid id of the current toposolid subdivision. If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId. |
| SketchId | Returns id of the sketch. |

# See Also
Toposolid Class
Autodesk.Revit.DB Namespace