# ViewsExportedByContextEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewsExportedByContextEventArgs Methods
ViewsExportedByContextEventArgs Class See Also
---
The ViewsExportedByContextEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetViewIds | Gets the views that were exported by CustomExporter. |

# See Also
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace