# AnalyticalLinkType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalLinkType Methods
AnalyticalLinkType Class See Also
---
The AnalyticalLinkType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidAnalyticalFixityState | Returns whether the input fixity state is valid for Analytical Link Type parameters. |

# See Also
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace