# StructuralSectionConcreteRectangleCut Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionConcreteRectangleCut Properties
StructuralSectionConcreteRectangleCut Class See Also
---
The StructuralSectionConcreteRectangleCut type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BottomCutHeight | Section height left Cut. |
| BottomCutWidth | Section width left Cut. |
| TopCutHeight | Section height right Cut. |
| TopCutWidth | Section width right Cut. |

# See Also
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace