# GeometryObject Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryObject Properties
GeometryObject Class See Also
---
The GeometryObject type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle |
| Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. |
| IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. |
| Visibility | The visibility. |

# See Also
GeometryObject Class
Autodesk.Revit.DB Namespace