# DirectShapeOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeOptions Methods
DirectShapeOptions Class See Also
---
The DirectShapeOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
DirectShapeOptions Class
Autodesk.Revit.DB Namespace