# PreviewControl Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PreviewControl Methods
PreviewControl Class See Also
---
The PreviewControl type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | This method is called if the user explicitly disposes of the object (by calling the Dispose method in other managed languages, or the destructor in C++). |

# See Also
PreviewControl Class
Autodesk.Revit.UI Namespace