# DocumentSynchronizingWithCentralEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentSynchronizingWithCentralEventArgs Properties
DocumentSynchronizingWithCentralEventArgs Class See Also
---
The DocumentSynchronizingWithCentralEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Comments | User's comments for synchronization. |
| Location | Full path of the central model which is to be synchronized. |
| Options | User's options associated with the synchronization operation. |

# See Also
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace