# SpatialElementBoundarySubface Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementBoundarySubface Methods
SpatialElementBoundarySubface Class See Also
---
The SpatialElementBoundarySubface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBoundingElementFace | Returns the face of the bounding element. |
| GetSpatialElementFace | Returns the face of the spatial element's 3D geometry. |
| GetSubface | Returns a face that represents the portion of the room face bounded by the boundary element. |

# See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace