# ITemporaryGraphicsHandler Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ITemporaryGraphicsHandler Methods
ITemporaryGraphicsHandler Interface See Also
---
The ITemporaryGraphicsHandler type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OnClick | Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager. |

# See Also
ITemporaryGraphicsHandler Interface
Autodesk.Revit.UI Namespace