# CableTray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTray Methods
CableTray Class See Also
---
The CableTray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of cable tray. |
| GetShapeType | Returns the shape type for the cable tray. |
| IsValidCableTrayType | Identifies if a cable tray type is valid. |
| IsValidRungSpace | Identifies if the input rung space is valid. |

# See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace