# PlanCircuit Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanCircuit Methods
PlanCircuit Class See Also
---
The PlanCircuit type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetPointInside | Returns a point inside the circuit. |

# See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace