# ButtonData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ButtonData Properties
ButtonData Class See Also
---
The ButtonData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Image | The image of the button. |
| LargeImage | The large image of the button. |
| Text | The user-visible text of the button. |

# See Also
ButtonData Class
Autodesk.Revit.UI Namespace