# StartingViewSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StartingViewSettings Properties
StartingViewSettings Class See Also
---
The StartingViewSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ViewId | Indicates the specific view that will be opened when the model is loaded. InvalidElementId indicates that no view has been specified. In that case, Revit will open the last views that were open at the time the file was saved. |

# See Also
StartingViewSettings Class
Autodesk.Revit.DB Namespace