# ContentNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContentNode Methods
ContentNode Class See Also
---
The ContentNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAsset | Returns an an instance of an Asset object, which contains definitions of the content node. |
| GetTransform | A transformation matrix associated with the node. |

# See Also
ContentNode Class
Autodesk.Revit.DB Namespace