# DataTransferProgressChangedEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DataTransferProgressChangedEventArgs Properties
DataTransferProgressChangedEventArgs Class See Also
---
The DataTransferProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FinishedSize | The transferred data size, in bytes, since the last time this event was raised. |
| Speed | Speed(bytes/second) in this event. |
| TotalSize | Total expected data size to transfer, in bytes. |
| TransferMode | Data transfer mode in this event. |

# See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace