# LinePattern Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinePattern Methods
LinePattern Class See Also
---
The LinePattern type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetSegments | Gets the sequence of segments that defines this line pattern. |
| SetSegments | Sets the sequence of segments that defines this line pattern. |

# See Also
LinePattern Class
Autodesk.Revit.DB Namespace