# RectangleLightShape Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RectangleLightShape Properties
RectangleLightShape Class See Also
---
The RectangleLightShape type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EmitLength | The emit length. |
| EmitWidth | The emit width. |

# See Also
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace