# Offset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions..::..Offset Property
AlignmentStationLabelSetOptions Class See Also
---
The offset of the labels from the alignment, in Revit internal paper space units (standard Imperial feet). A positive offset creates labels to the right of the alignment, a negative - to the left. The default value is null. If null, a predefined offset value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 1/8". For survey imperial, the default is 1/8" (US survey). For metric, the default is 5 mm.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public Nullable<double> Offset { get; set; }
```

Visual Basic
---
```text
Public Property Offset As Nullable(Of Double)
	Get
	Set
```

Visual C++
---
```text
public:
property Nullable<double> Offset {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
```

# See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace