# Definition Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Definition Methods
Definition Class See Also
---
The Definition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. |
| GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. |

# See Also
Definition Class
Autodesk.Revit.DB Namespace