# BrowserOrganization Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BrowserOrganization Properties
BrowserOrganization Class See Also
---
The BrowserOrganization type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SortingOrder | The sorting order if sorting of items is applicable in the browser. |
| SortingParameterId | The Id of the parameter used to determine the sorting order of items in the browser. |
| Type | Get BrowserOrganizationType. |

# See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace