# TopographyEditScope Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TopographyEditScope Members
TopographyEditScope Class Constructors Methods Properties See Also
---
The TopographyEditScope type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TopographyEditScope | Instantiates a TopographyEditScope object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Start | Starts a topography surface edit mode for an existing TopographySurface element. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace