# IRevisionsOnSheetUIServer Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IRevisionsOnSheetUIServer Methods
IRevisionsOnSheetUIServer Interface See Also
---
The IRevisionsOnSheetUIServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ShowDialog | Shows dialog on managing RevisionsOnSheetUI. |

# See Also
IRevisionsOnSheetUIServer Interface
Autodesk.Revit.UI Namespace