# CategoryNameMapIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CategoryNameMapIterator Properties
CategoryNameMapIterator Class See Also
---
The CategoryNameMapIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the category that is the current focus of the iterator. |
| Key | Retrieves the category name that is the current focus of the iterator. |

# See Also
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace