# InstanceNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InstanceNode Methods
InstanceNode Class See Also
---
The InstanceNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSymbolGeometryId | Gets the SymbolGeometryId associated with the node. |

# See Also
InstanceNode Class
Autodesk.Revit.DB Namespace