# FormulaEditingEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormulaEditingEventArgs Members
FormulaEditingEventArgs Class Methods Properties See Also
---
The FormulaEditingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Apply | Applies formula to the parameter |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentDocument | Returns the current document |
| Formula | Returns text of the formula that will be modified |
| ParameterId | Returns the Id of the modified parameter |

# See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace