# DocumentSavingAsEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentSavingAsEventArgs Members
DocumentSavingAsEventArgs Class Methods Properties See Also
---
The DocumentSavingAsEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsSavingAsCentralFile | Indicates whether the document is to be saved as central file. |
| PathName | Target path to which the document is to be saved. |

# See Also
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace