# ColorWithTransparency Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorWithTransparency Methods
ColorWithTransparency Class See Also
---
The ColorWithTransparency type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBlue | get blue |
| GetColor | get color |
| GetGreen | get green |
| GetRed | get red |
| GetTransparency | get transparency |
| SetBlue | set blue |
| SetColor | set color |
| SetGreen | set green |
| SetRed | set red |
| SetTransparency | set transparency |

# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace