# RebarShapeConstraintSagittaLength Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintSagittaLength Members
RebarShapeConstraintSagittaLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraintSagittaLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintSagittaLength | Create a constraint to drive sagitta length. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RebarShapeConstraintSagittaLength Class
Autodesk.Revit.DB.Structure Namespace