# ScheduleHeightsOnSheet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleHeightsOnSheet Methods
ScheduleHeightsOnSheet Class See Also
---
The ScheduleHeightsOnSheet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBodyRowHeights | Returns each row's height of schedule body on sheet view. |

# See Also
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace