# RevitEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitEventArgs Members
RevitEventArgs Class Methods Properties See Also
---
The RevitEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. |
| Cancellable | Indicates whether an event may be cancelled by an event delegate. |

# See Also
RevitEventArgs Class
Autodesk.Revit.DB.Events Namespace