# OpenOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
OpenOptions Methods
OpenOptions Class See Also
---
The OpenOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetOpenWorksetsConfiguration | Gets the object used to configure the worksets to open when the model is opened. |
| SetOpenWorksetsConfiguration | Sets the object used to configure the worksets to open when the model is opened. |

# See Also
OpenOptions Class
Autodesk.Revit.DB Namespace