# ClassificationEntries Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClassificationEntries Methods
ClassificationEntries Class See Also
---
The ClassificationEntries type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadClassificationEntriesFromFile | Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent. |

# See Also
ClassificationEntries Class
Autodesk.Revit.DB Namespace