# MEPModel Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPModel Methods
MEPModel Class See Also
---
The MEPModel type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAssignedElectricalSystems | Retrieves the electrical systems this electrical panel currently is assigned to. |
| GetElectricalSystems | Retrieves the electrical systems that are currently created using this MEPModel. |

# See Also
MEPModel Class
Autodesk.Revit.DB Namespace