# PaperSourceSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSourceSet Properties
PaperSourceSet Class See Also
---
The PaperSourceSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
PaperSourceSet Class
Autodesk.Revit.DB Namespace