# TriOrQuadFacet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriOrQuadFacet Methods
TriOrQuadFacet Class See Also
---
The TriOrQuadFacet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetVertexIndex | Returns the index of the specified vertex of this facet (as an index into the external array of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets). |

# See Also
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace