# RebarShapeConstraintProjectedSegmentLength Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintProjectedSegmentLength Methods
RebarShapeConstraintProjectedSegmentLength Class See Also
---
The RebarShapeConstraintProjectedSegmentLength type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |

# See Also
RebarShapeConstraintProjectedSegmentLength Class
Autodesk.Revit.DB.Structure Namespace