# LightGroup Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightGroup Methods
LightGroup Class See Also
---
The LightGroup type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddLight | Add a new light instance to the group |
| Dispose |
| GetLights | Get the set of contained light instances The set of light instances |
| RemoveLight | Remove the given light instance from the set of light instances in this group |

# See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace