# DuctFittingAndAccessoryPressureDropUIData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIData Methods
DuctFittingAndAccessoryPressureDropUIData Class See Also
---
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetUIDataItems | Gets all UI data items stored in the UI data. |
| GetUnits | Gets units. |

# See Also
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace