# StructuralSectionGeneralI Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralI Methods
StructuralSectionGeneralI Class See Also
---
The StructuralSectionGeneralI type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFlangeThicknessInFlangeCenter | Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm. |
| GetFlangeThicknessInQuarterWidth | Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm. |

# See Also
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace