# PushButton Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PushButton Properties
PushButton Class See Also
---
The PushButton type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssemblyName | The assembly path of the button. |
| AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button. |
| ClassName | The name of the class containing the implementation for the command. |

# See Also
PushButton Class
Autodesk.Revit.UI Namespace