# ElectricalAnalyticalNode Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalAnalyticalNode Properties
ElectricalAnalyticalNode Class See Also
---
The ElectricalAnalyticalNode type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NodeType | The type of electrical analytical node. |
| TotalLoad | The Total Connected Load. |

# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace