# AnalyticalModelSelector Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalModelSelector Methods
AnalyticalModelSelector Class See Also
---
The AnalyticalModelSelector type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace