# ApplicationEntryPoint Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint Methods
ApplicationEntryPoint Class See Also
---
The ApplicationEntryPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FinishInitializationEO | For Revit Macros internal use only. |
| Initialize | For Revit Macros internal use only. |
| OnShutdownEO | For Revit Macros internal use only. |

# See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace