# StructuralSectionIParallelFlange Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionIParallelFlange Properties
StructuralSectionIParallelFlange Class See Also
---
The StructuralSectionIParallelFlange type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BoltDiameter | Maximum bolt hole diameter, in. (mm) |
| BoltSpacing | Standard bolt spacing, in. (mm) |
| ClearWebHeight | Detailing depth between the web toes of the fillets, in.(mm) |

# See Also
StructuralSectionIParallelFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace