# BaseArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BaseArray Methods
BaseArray Class See Also
---
The BaseArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetCopiedMemberIds | Retrieves the copied member Ids of the Array. |
| GetOriginalMemberIds | Retrieves the original member Ids of the Array. |

# See Also
BaseArray Class
Autodesk.Revit.DB Namespace