# TessellatedShapeBuilderResult Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TessellatedShapeBuilderResult Methods
TessellatedShapeBuilderResult Class See Also
---
The TessellatedShapeBuilderResult type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetGeometricalObjects | When called the first time, returns geometrical objects which were built. Later calls will throw exceptions. |
| GetIssuesForFaceSet | Returns the array of issues encountered while processing a face set with index 'setIndex'. |
| GetNumberOfFaceSets | Gets number of face sets for which 'this' result was obtained. |

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace