# DoubleArrayIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DoubleArrayIterator Methods
DoubleArrayIterator Class See Also
---
The DoubleArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
DoubleArrayIterator Class
Autodesk.Revit.DB Namespace