# FieldDomainPoints Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldDomainPoints Methods
FieldDomainPoints Class See Also
---
The FieldDomainPoints type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FieldDomainPoints Class
Autodesk.Revit.DB.Analysis Namespace