# DefinitionBindingMapIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionBindingMapIterator Methods
DefinitionBindingMapIterator Class See Also
---
The DefinitionBindingMapIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the map. |

# See Also
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace