# InternalOrigin Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InternalOrigin Properties
InternalOrigin Class See Also
---
The InternalOrigin type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Position | The position of the InternalOrigin. |
| SharedPosition | The position of the InternalOrigin relative to the active ProjectLocation set for the document. |

# See Also
InternalOrigin Class
Autodesk.Revit.DB Namespace