# AnalysisDisplayColorEntry Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColorEntry Methods
AnalysisDisplayColorEntry Class See Also
---
The AnalysisDisplayColorEntry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| HasValue | Check if color entry has associated value. |
| IsEqual | Compare color entries. |

# See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace