# SlabShapeCreaseArrayIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabShapeCreaseArrayIterator Properties
SlabShapeCreaseArrayIterator Class See Also
---
The SlabShapeCreaseArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
SlabShapeCreaseArrayIterator Class
Autodesk.Revit.DB Namespace