# IPipePressureDropServer Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPipePressureDropServer Methods
IPipePressureDropServer Interface See Also
---
The IPipePressureDropServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Calculate | Calculate the pipe pressure drop. |
| GetHtmlDescription | The method that Revit will invoke to get an HTML formatted description of the server. |
| GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |

# See Also
IPipePressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace