# InitialColor Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialColor Methods
InitialColor Class See Also
---
The InitialColor type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the InitialColor derived object. |
| Dispose |

# See Also
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace