# AssetPropertyInt64 Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyInt64 Properties
AssetPropertyInt64 Class See Also
---
The AssetPropertyInt64 type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | Get the value of the property. |

# See Also
AssetPropertyInt64 Class
Autodesk.Revit.DB.Visual Namespace