# Definitions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Definitions Methods
Definitions Class See Also
---
The Definitions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Tests for the existence of a definition within the set. |
| Create | Creates a new parameter definition using specified options. |
| Dispose |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Retrieves an enumerator to the collection. |

# See Also
Definitions Class
Autodesk.Revit.DB Namespace