# ViewsExportedByContextEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewsExportedByContextEventArgs Members
ViewsExportedByContextEventArgs Class Methods Properties See Also
---
The ViewsExportedByContextEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetViewIds | Gets the views that were exported by CustomExporter. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace