# BuildingPad Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingPad Methods
BuildingPad Class See Also
---
The BuildingPad type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new BuildingPad element and adds it to the document. |
| GetBoundary | Gets the boundary of current BuildingPad element. |
| SetBoundary | Set a given curve loops as the boundary of the current BuildingPad element. |

# See Also
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace