# WireMaterialType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireMaterialType Properties
WireMaterialType Class See Also
---
The WireMaterialType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GroundConductorSizes | Get all ground conductor size types defined in this wire material type. |
| IsInUse | Indicate whether the wire material type is in use. |
| Name | Get name of wire material type.  (Overrides ElementType..::..Name.) |
| TemperatureRatings | Get all temperature rating type definitions defined in this wire material type. |

# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace