# SketchPlane Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SketchPlane Properties
SketchPlane Class See Also
---
The SketchPlane type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsSuitableForModelElements | Identifies if the sketch plane can be assigned to model elements. |

# See Also
SketchPlane Class
Autodesk.Revit.DB Namespace