# SetBoundary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SiteSubRegion..::..SetBoundary Method
SiteSubRegion Class See Also
---
Set the given curve loops as the boundary of an existing SiteSubRegion.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public void SetBoundary(
	IList<CurveLoop> curveLoops
)
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")> _
Public Sub SetBoundary ( _
	curveLoops As IList(Of CurveLoop) _
)
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public:
void SetBoundary(
	IList<CurveLoop^>^ curveLoops
)
```

# ### Parameters
curveLoops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> A collection of curve loops to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input curve loops cannot compose a valid boundary, that means: no curve loop is contained in the given collection; these curve loops intersect with each other for some of them; or each curve loop is not closed individually; or each curve loop is not planar; or each curve loop is not in a plane parallel to the horizontal(XY) plane. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Failed to create the Sketch for the boundary of the current Subregion. -or- Cannot find an appropriate host topography surface for the SubRegion. -or- The given curve loops intersect with curve loops of existing SiteSubRegions hosted on the same TopographySurface. -or- The boundary of SubRegion is entirely inside or overlaps at least one existing BuildingPad hosted on the same TopographySurface. This behavior is not allowed. |
| Autodesk.Revit.Exceptions..::..ModificationForbiddenException | The document containing this SiteSubRegion is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this SiteSubRegion is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException | The document containing this SiteSubRegion has no open transaction. |

# See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace