# GroupSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GroupSet Properties
GroupSet Class See Also
---
The GroupSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of groups that are in the set. |

# See Also
GroupSet Class
Autodesk.Revit.DB Namespace