# AssetPropertyDoubleArray3d Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDoubleArray3d Methods
AssetPropertyDoubleArray3d Class See Also
---
The AssetPropertyDoubleArray3d type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetValueAsDoubles | Get the value property as doubles. |
| GetValueAsXYZ | Get the value property as a vector or point XYZ. |
| IsValidValue | Checks that the value is a valid value for this property. |
| SetValueAsXYZ | Sets the value property as a vector or point XYZ. |

# See Also
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace