# StructuralSectionRectangular Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionRectangular Properties
StructuralSectionRectangular Class See Also
---
The StructuralSectionRectangular type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CentroidHorizontal | Distance from centroid to the left extremites along horizontal axis. |
| CentroidVertical | Distance from centroid to the upper extremites along vertical axis. |
| Height | Section height, depth. |
| NameKey | Name Key |
| Width | Section width. |

# See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace