# CommonSharedAssetType Enumeration (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CommonSharedAssetType Enumeration
See Also
---
The enumerated type representing the permitted values for the asset property "CommonSharedAsset" from the "Ceramic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public enum CommonSharedAssetType
```

Visual Basic
---
```text
Public Enumeration CommonSharedAssetType
```

Visual C++
---
```text
public enum class CommonSharedAssetType
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Shared |
| Independent |

# See Also
Autodesk.Revit.DB.Visual Namespace