# CurveExtents Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveExtents Methods
CurveExtents Class See Also
---
The CurveExtents type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
CurveExtents Class
Autodesk.Revit.DB Namespace