# FamilySymbolFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySymbolFilter Members
FamilySymbolFilter Class Constructors Methods Properties See Also
---
The FamilySymbolFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilySymbolFilter | Constructs a new instance of a filter to find all family symbols of the given family. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyId | The family id. |

# See Also
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace