# RegenerationAttribute Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RegenerationAttribute Properties
RegenerationAttribute Class See Also
---
The RegenerationAttribute type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Option | Regeneration option. |

# See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace