# FailuresProcessingEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailuresProcessingEventArgs Methods
FailuresProcessingEventArgs Class See Also
---
The FailuresProcessingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFailuresAccessor | Provides access to the failure information in the document. |
| GetProcessingResult | Retrieves current status of the failures processing result. |
| SetProcessingResult | Sets the result of the failures processing accomplished during this event callback. |

# See Also
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace