# DefaultDivideSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefaultDivideSettings Properties
DefaultDivideSettings Class See Also
---
The DefaultDivideSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PathDistance | A default Divided Path distance for a fixed, minimum, or maximum distance layout. |
| PathLayout | A default Divided Path layout. |
| PathMeasurementType | A default Divided Path measurement type for distance layouts. |
| PathNumber | A default Divided Path number for a fixed number layout. |

# See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace