# PolylineNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PolylineNode Methods
PolylineNode Class See Also
---
The PolylineNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetPolyline | Returns the polyline object corresponding to the node. |

# See Also
PolylineNode Class
Autodesk.Revit.DB Namespace