# GBXMLImportOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GBXMLImportOptions Members
GBXMLImportOptions Class Constructors Methods See Also
---
The GBXMLImportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GBXMLImportOptions | Default constructor. Sets all options to their default values. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
GBXMLImportOptions Class
Autodesk.Revit.DB Namespace