# TriangulatedShellComponent Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulatedShellComponent Methods
TriangulatedShellComponent Class See Also
---
The TriangulatedShellComponent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Empties the contents of this TriangulatedShellComponent. |
| Dispose |
| GetTriangle | Returns the triangle corresponding to the given index. |
| GetVertex | Returns the vertex with a given index. |
| GetVertices | Returns the vertices of the triangulation. |

# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace