# FaceBasedPlacementType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PromptForFamilyInstancePlacementOptions..::..FaceBasedPlacementType Property
PromptForFamilyInstancePlacementOptions Class See Also
---
The placement type to be used if prompting to place an instance of a face-based family. This option is ignored if placing a non-face-based family. If placing a face-based family, Default is an acceptable value, but will correspond to the first available selection in the user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FaceBasedPlacementType FaceBasedPlacementType { get; set; }
```

Visual Basic
---
```text
Public Property FaceBasedPlacementType As FaceBasedPlacementType
	Get
	Set
```

Visual C++
---
```text
public:
property FaceBasedPlacementType FaceBasedPlacementType {
	FaceBasedPlacementType get ();
	void set (FaceBasedPlacementType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace