# AssetPropertyDoubleMatrix44 Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDoubleMatrix44 Properties
AssetPropertyDoubleMatrix44 Class See Also
---
The AssetPropertyDoubleMatrix44 type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | Get the value of the property |

# See Also
AssetPropertyDoubleMatrix44 Class
Autodesk.Revit.DB.Visual Namespace