# PaperSource Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSource Members
PaperSource Class Methods Properties See Also
---
The PaperSource type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | Retrieve the paper source name of current project. |

# See Also
PaperSource Class
Autodesk.Revit.DB Namespace