# ExportLineweightTableIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLineweightTableIterator Methods
ExportLineweightTableIterator Class See Also
---
The ExportLineweightTableIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
ExportLineweightTableIterator Class
Autodesk.Revit.DB Namespace