# Area Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Area Members
Area Class Methods Properties See Also
---
The Area type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreaScheme | The area scheme. |
| IsGrossInterior | The boolean value that indicates whether the area is gross interior. |

# See Also
Area Class
Autodesk.Revit.DB Namespace