# CurtainSystem Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurtainSystem Methods
CurtainSystem Class See Also
---
The CurtainSystem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddCurtainGrid | Add CurtainGrid on the specified face for the CurtainSystem. |
| RemoveCurtainGrid | Remove CurtainGrid from the specified face for the CurtainSystem. |

# See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace