# ValidateCurveLoopsOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValidateCurveLoopsOptions Members
ValidateCurveLoopsOptions Class Methods Properties See Also
---
The ValidateCurveLoopsOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ValidateCurveLoopsOptions |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ValidateCurveLoopsOptions Class
Autodesk.Revit.DB Namespace