# InitialFluxIntensity Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialFluxIntensity Members
InitialFluxIntensity Class Constructors Methods Properties See Also
---
The InitialFluxIntensity type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InitialFluxIntensity(Double) | Creates an initial flux intensity object with the given document and flux values. |
| InitialFluxIntensity(InitialFluxIntensity) | Creates a copy of the given initial flux intensity object |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Flux | The flux intensity value. |

# See Also
InitialFluxIntensity Class
Autodesk.Revit.DB.Lighting Namespace