# CorrectionFactor Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CorrectionFactor Methods
CorrectionFactor Class See Also
---
The CorrectionFactor type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetTemperature | Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature. |

# See Also
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace