# RenderingImageExposureSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingImageExposureSettings Methods
RenderingImageExposureSettings Class See Also
---
The RenderingImageExposureSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace