# ComboBoxDropDownOpenedEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxDropDownOpenedEventArgs Members
ComboBoxDropDownOpenedEventArgs Class Constructors Methods Properties See Also
---
The ComboBoxDropDownOpenedEventArgs type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComboBoxDropDownOpenedEventArgs | Initializes a new instance of the ComboBoxDropDownOpenedEventArgs class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ComboBoxDropDownOpenedEventArgs Class
Autodesk.Revit.UI.Events Namespace