# PrintManager Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PrintManager Methods
PrintManager Class See Also
---
The PrintManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Apply | Apply the local print settings to global for all documents. |
| SelectNewPrintDriver | Select a new printer. |
| SubmitPrint()()()() | Print the views and sheets defined in the current local PrintManager settings. |
| SubmitPrint(View) | Print a view with the current PrintManager settings. |

# See Also
PrintManager Class
Autodesk.Revit.DB Namespace