# LevelAssociationData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LevelAssociationData Methods
LevelAssociationData Class See Also
---
The LevelAssociationData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetAssociatedLevel | Returns the Associated Level id. |
| GetLevelAssociationData | Returns LevelAssociationData associated with this element, if it exists. |
| GetLevelOffset | Returns the offset from the Associated Level. |
| SetAssociatedLevel | Sets the Associated Level. |

# See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace