# StructuralSectionIWelded Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionIWelded Properties
StructuralSectionIWelded Class See Also
---
The StructuralSectionIWelded type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BottomFlangeThickness | Bottom Flange Thickness. |
| BottomFlangeWidth | Bottom Flange Width. |
| TopFlangeThickness | Top Flange Thickness. |
| TopFlangeWidth | Top Flange Width. |
| WebHeight | Web Height. |
| WebThickness | Web Thickness. |

# See Also
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace