# ElementIdParameterValue Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIdParameterValue Members
ElementIdParameterValue Class Constructors Methods Properties See Also
---
The ElementIdParameterValue type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementIdParameterValue()()()() | Default constructor |
| ElementIdParameterValue(ElementId) | Value constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace