# IExportContext2D Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContext2D Interface
Members See Also
---
An interface that is used in custom export to export 2D views of a Revit model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public interface IExportContext2D : IExportContextBase
```

Visual Basic
---
```text
Public Interface IExportContext2D _
	Inherits IExportContextBase
```

Visual C++
---
```text
public interface class IExportContext2D : IExportContextBase
```

# Remarks
An instance of a class that implements this interface is passed in as a parameter of the CustomExporter constructor. The interface methods are then called at times of drawing entities that are currently visible in the view being exported.
With this type of export context used to perform a custom export, Revit will traverse the model and output the model's geometry as if in the process of regular displaying or exporting a 2D View. It means that any geometry which is visible in an open view (taking any current visibility setting applicable to the view) will be processed and output. Optionally, annotation objects are also output.
Note 1. Curves passed to calls OnFaceEdge2D(FaceEdgeNode) and OnFaceSilhouette2D(FaceSilhouetteNode) may be partially duplicating each other.
Note 2. If element E is a FamilyInstance and it contains an imported instance then:
  * between the calls to OnElementBegin2D/OnElementEnd2D for element E there will be calls to OnInstanceBegin/OnInstanceEnd with the "node" argument pointing to the element with its symbol being of category BuiltInCategories.OST_ImportObjectStyles
  * all geometry exported for the element E has to be additionally subject to the transform T=E.GetTotalTransform()

# See Also
IExportContext2D Members
Autodesk.Revit.DB Namespace