# Asset Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Asset Members
Asset Class Methods Properties See Also
---
The Asset type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssetType | The type of RenderingAsset |
| LibraryName | Library name |
| Title | Asset title |

# See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace