# BoundaryConditions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundaryConditions Properties
BoundaryConditions Class See Also
---
The BoundaryConditions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssociatedLoadId | The Id of the internal load element associated with a boundary conditions. |
| HostElementId | The host element Id for the boundary conditions. |
| Point | Returns the position of point boundary conditions. |

# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace