# TemperatureRatingTypeSetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TemperatureRatingTypeSetIterator Properties
TemperatureRatingTypeSetIterator Class See Also
---
The TemperatureRatingTypeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
TemperatureRatingTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace