# ExternalDefinitionCreationOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDefinitionCreationOptions Methods
ExternalDefinitionCreationOptions Class See Also
---
The ExternalDefinitionCreationOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDataType | Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category. |
| SetDataType | Sets the parameter's data type. |

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace