# GenericZoneDomainData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GenericZoneDomainData Methods
GenericZoneDomainData Class See Also
---
The GenericZoneDomainData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
GenericZoneDomainData Class
Autodesk.Revit.DB.Analysis Namespace