# SpaceSet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpaceSet Methods
SpaceSet Class See Also
---
The SpaceSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every item from the set, rendering it empty. |
| Contains |
| Erase |
| ForwardIterator | Retrieve a forward moving iterator to the set. |
| GetEnumerator | Retrieve a forward moving iterator to the set. |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the set. |

# See Also
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace