# HermiteSurface Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HermiteSurface Methods
HermiteSurface Class See Also
---
The HermiteSurface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Int32, Int32, IList<(Of <<'(XYZ>)>>)) | Create a non-periodic Hermite surface using a net of 3D points as input. |
| Create(Int32, Int32, IList<(Of <<'(XYZ>)>>), Boolean, Boolean) | Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction. |
| IsValid | Checks whether this HermiteSurface object is valid. |

# See Also
HermiteSurface Class
Autodesk.Revit.DB Namespace