# AssetPropertyFloatArray Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyFloatArray Members
AssetPropertyFloatArray Class Methods Properties See Also
---
The AssetPropertyFloatArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetValue | Get the value of the property. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace