# ScheduleSheetInstance Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleSheetInstance Properties
ScheduleSheetInstance Class See Also
---
The ScheduleSheetInstance type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsTitleblockRevisionSchedule | Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family. |
| Point | Location on the sheet where the ScheduleInstance is placed (in sheet coordinates). |
| Rotation | Rotation of the ScheduleInstance. |
| ScheduleId | Id of the primary schedule that generates this ScheduleInstance. |
| SegmentIndex | The schedule segment index of this ScheduleSheetInstance. |

# See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace