# GraphicsStyle Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GraphicsStyle Properties
GraphicsStyle Class See Also
---
The GraphicsStyle type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GraphicsStyleCategory | The graphics style category. |
| GraphicsStyleType | The graphics style type. |

# See Also
GraphicsStyle Class
Autodesk.Revit.DB Namespace