# DuctSizes Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctSizes Methods
DuctSizes Class See Also
---
The DuctSizes type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Checks whether a duct size with the nominal diameter exists. |
| Dispose |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetDuctSizeIterator | Returns a DuctSizeIterator that iterates through the collection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |

# See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace