# ParameterMap Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterMap Properties
ParameterMap Class See Also
---
The ParameterMap type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the map is empty. |
| Item | Gets or sets an item at a specified key within the map. |
| Size | Returns the number of objects that are in the map. |

# See Also
ParameterMap Class
Autodesk.Revit.DB Namespace