# MemberForces Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MemberForces Methods
MemberForces Class See Also
---
The MemberForces type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
MemberForces Class
Autodesk.Revit.DB.Structure Namespace