# DisplacementElement Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisplacementElement Properties
DisplacementElement Class See Also
---
The DisplacementElement type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ParentId | The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent. |

# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace