# KeyBasedTreeEntryError Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntryError Methods
KeyBasedTreeEntryError Class See Also
---
The KeyBasedTreeEntryError type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetEntry | Gets the entry for which an error occurred while building the KeyBasedTreeEntries object. |

# See Also
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace