# ElementWorksetFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementWorksetFilter Members
ElementWorksetFilter Class Constructors Methods Properties See Also
---
The ElementWorksetFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementWorksetFilter(WorksetId) | Constructs a new instance of a filter to match elements in a given workset. |
| ElementWorksetFilter(WorksetId, Boolean) | Constructs a new instance of a filter to match elements in a given workset. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| WorksetId | The workset id. |

# See Also
ElementWorksetFilter Class
Autodesk.Revit.DB Namespace