# HermiteSplineTangents Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HermiteSplineTangents Methods
HermiteSplineTangents Class See Also
---
The HermiteSplineTangents type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace