# ExternalServiceId Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalServiceId Members
ExternalServiceId Class Constructors Methods Operators Properties See Also
---
The ExternalServiceId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalServiceId | Creates a new ExternalServiceId instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two ExternalServiceId instances. |
| Inequality | Compares two ExternalServiceId instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace