# MEPNetworkSegmentData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPNetworkSegmentData Methods
MEPNetworkSegmentData Class See Also
---
The MEPNetworkSegmentData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDownstreamSegments | Gets all downstream network segments. |
| GetUpstreamSegments | Gets all upstream network segments. |
| IsValid | Verified if this segment data has been assigned some valid values afer calculation. |

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace