# Equals Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ThermalAsset..::..Equals Method
ThermalAsset Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |

# See Also
ThermalAsset Class
ThermalAsset Members
Autodesk.Revit.DB Namespace