# Curve Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LocationCurve..::..Curve Property
LocationCurve Class Example See Also
---
Provides the ability to get and set the curve of a curve based element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve Curve { get; set; }
```

Visual Basic
---
```text
Public Property Curve As Curve
	Get
	Set
```

Visual C++
---
```text
public:
property Curve^ Curve {
	Curve^ get ();
	void set (Curve^ value);
}
```

# Remarks
This property can be used to set the location of curve based element to any desired position. Many elements are curve based. Some examples are walls, beams and braces.
# Examples
CopyC#
```text
void MoveUsingCurveParam(Autodesk.Revit.ApplicationServices.Application application, Wall wall)
{
    LocationCurve wallLine = wall.Location as LocationCurve;
    XYZ p1 = XYZ.Zero;
    XYZ p2 = new XYZ(10, 20, 0);
    Line newWallLine = Line.CreateBound(p1, p2);

    // Change the wall line to a new line.
    wallLine.Curve = newWallLine;
}
```

CopyVB.NET
```text
Private Sub MoveUsingCurveParam(application As Autodesk.Revit.ApplicationServices.Application, wall As Wall)
    Dim wallLine As LocationCurve = TryCast(wall.Location, LocationCurve)
    Dim p1 As XYZ = XYZ.Zero
    Dim p2 As New XYZ(10, 20, 0)
    Dim newWallLine As Line = Line.CreateBound(p1, p2)

    ' Change the wall line to a new line.
    wallLine.Curve = newWallLine
End Sub
```

# See Also
LocationCurve Class
Autodesk.Revit.DB Namespace