# VertexFormat Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexFormat Methods
VertexFormat Class See Also
---
The VertexFormat type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsValid | Tests whether the vertex format specification is valid for rendering. |

# See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace