# PointLoad Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointLoad Properties
PointLoad Class See Also
---
The PointLoad type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ForceVector | The force vector applied to the point load, oriented according to OrientTo setting. |
| MomentVector | The moment vector applied to the point load, oriented according to OrientTo setting. |
| Point | Returns the position of point load, measured in decimal feet. |

# See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace