# RibbonItemData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonItemData Methods
RibbonItemData Class See Also
---
The RibbonItemData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetContextualHelp | Gets the contextual help bound with this control. |
| SetContextualHelp | Sets the contextual help bound with this button data. |

# See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace