# ParameterValueProvider Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterValueProvider Properties
ParameterValueProvider Class See Also
---
The ParameterValueProvider type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Parameter | The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element. |

# See Also
ParameterValueProvider Class
Autodesk.Revit.DB Namespace