# ElementIdParameterValue Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIdParameterValue Properties
ElementIdParameterValue Class See Also
---
The ElementIdParameterValue type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace