# CorrectionFactorSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CorrectionFactorSet Properties
CorrectionFactorSet Class See Also
---
The CorrectionFactorSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of correction factors that are in the set. |

# See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace