# ClassificationEntry Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClassificationEntry Properties
ClassificationEntry Class See Also
---
The ClassificationEntry type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId | The id of the category associated with this entry. |
| Description | The description associated with this entry. |
| Level | The entry level in the classification table. The expected range is between 1 and 5 inclusive. |

# See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace