# DockablePaneState Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockablePaneState Methods
DockablePaneState Class See Also
---
The DockablePaneState type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| SetFloatingRectangle | When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window. |

# See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace