# MacroModuleIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MacroModuleIterator Methods
MacroModuleIterator Class See Also
---
The MacroModuleIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current Macro. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace