# DefinitionGroup Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionGroup Properties
DefinitionGroup Class See Also
---
The DefinitionGroup type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Definitions | The Definitions property returns an object that contains all the shared parameter definitions within the group. |
| Name | Returns the name of the parameter group. |

# See Also
DefinitionGroup Class
Autodesk.Revit.DB Namespace