# RepeatingReferenceSource Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RepeatingReferenceSource Methods
RepeatingReferenceSource Class See Also
---
The RepeatingReferenceSource type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBounds | Returns information about the boundaries of the repeating reference array. |
| GetDefaultRepeatingReferenceSource | Returns the default repeating reference source for a given element. |
| GetReference | Returns an individual repeating reference given by coordinates in the array, or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no reference at the coordinates (for example if there is a hole in a divided surface.) |
| HasRepeatingReferenceSource | Determines whether an element has any repeating reference sources that can be used when creating component repeaters. |

# See Also
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace