# RuledFace Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RuledFace Properties
RuledFace Class See Also
---
The RuledFace type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Curve | Profile curves of the surface. |
| IsExtruded | Determines if this is an extruded ruled surface. |
| Point | Profile points of the surface. |
| RulingsAreParallel | Determines if the rulings of this ruled surface are parallel. |

# See Also
RuledFace Class
Autodesk.Revit.DB Namespace