# MassSurfaceDataMaterialType Enumeration (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceDataMaterialType Enumeration
See Also
---
Indicates how the visualization material for the MassSurfaceData is calculated.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public enum MassSurfaceDataMaterialType
```

Visual Basic
---
```text
Public Enumeration MassSurfaceDataMaterialType
```

Visual C++
---
```text
public enum class MassSurfaceDataMaterialType
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| MaterialByConstruction | The visualization material for the MassSurfaceData will be taken from the material assigned to the ConceptualConstructionType which is assigned to the MassSurfaceData. |
| NormalMaterial | The visualization material for the MassSurfaceData will be taken from the material associated with the object style of the subcategory of the MassSurfaceData if the materialId is InvalidElementId, or the MassSurfaceData will use the specific material indicated by the materialId property if its value is an ElementId of a MaterialElement. |

# See Also
Autodesk.Revit.DB.Analysis Namespace