# DefinitionGroups Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionGroups Methods
DefinitionGroups Class See Also
---
The DefinitionGroups type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Tests for the existence of a definition group within the collection. |
| Create | Create a new parameter definition group using the name provided. |
| Dispose |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Retrieves an enumerator to the collection. |

# See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace