# FootPrintRoof Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FootPrintRoof Methods
FootPrintRoof Class See Also
---
The FootPrintRoof type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetProfiles | Retrieve all the curveLoops of FootPrintRoof. |

# See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace