# FilterStringContains Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringContains Members
FilterStringContains Class Constructors Methods Properties See Also
---
The FilterStringContains type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringContains | Constructs an instance of FilterStringContains. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringContains Class
Autodesk.Revit.DB Namespace