# IndexStreamLine Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexStreamLine Methods
IndexStreamLine Class See Also
---
The IndexStreamLine type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddLine | Inserts a IndexLine segment into the stream and associated buffer. |
| AddLines | Inserts multiple IndexLine segments into the stream and associated buffer. |

# See Also
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace