# ModelCurveArrArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelCurveArrArray Methods
ModelCurveArrArray Class See Also
---
The ModelCurveArrArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append |
| Clear | Removes every item from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace