# IDuctFittingAndAccessoryPressureDropServer Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IDuctFittingAndAccessoryPressureDropServer Methods
IDuctFittingAndAccessoryPressureDropServer Interface See Also
---
The IDuctFittingAndAccessoryPressureDropServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Calculate | Calculate the duct fitting and duct accessory coefficient. |
| GetDataSchema | Obtains the schema of the ESEntity. |
| IsApplicable | Check if the server is applicable for the duct fitting or duct accessory. |

# See Also
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace