# FileImportedEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileImportedEventArgs Properties
FileImportedEventArgs Class See Also
---
The FileImportedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Format | Identifies the import format, e.g. DWG or image. |
| ImportedInstanceId | The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance. |
| Path | Path of the source file that was imported. |

# See Also
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace