# IntegerParameterValue Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntegerParameterValue Members
IntegerParameterValue Class Constructors Methods Properties See Also
---
The IntegerParameterValue type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IntegerParameterValue()()()() | Default constructor |
| IntegerParameterValue(Int32) | Value constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
IntegerParameterValue Class
Autodesk.Revit.DB Namespace