# RibbonButtonOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonButtonOptions Members
RibbonButtonOptions Class Methods Properties See Also
---
The RibbonButtonOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RibbonButtonOptions |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace