# DistributionSysTypeSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DistributionSysTypeSet Properties
DistributionSysTypeSet Class See Also
---
The DistributionSysTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of DistributionSys types that are in the set. |

# See Also
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace