# ExclusionFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExclusionFilter Members
ExclusionFilter Class Constructors Methods Properties See Also
---
The ExclusionFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExclusionFilter | Constructs a new instance of a filter to exclude elements automatically. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetIdsToExclude | Returns the ids to be excluded by this filter. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ExclusionFilter Class
Autodesk.Revit.DB Namespace