# RoutingCondition Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoutingCondition Methods
RoutingCondition Class See Also
---
The RoutingCondition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
RoutingCondition Class
Autodesk.Revit.DB Namespace