# AnalyticalOpening Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalOpening Properties
AnalyticalOpening Class See Also
---
The AnalyticalOpening type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PanelId | ElementId of the AnalyticalPanel parent. |

# See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace