# ParameterDownloadOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterDownloadOptions Methods
ParameterDownloadOptions Class See Also
---
The ParameterDownloadOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCategories | Get categories for binding. |
| GetGroupTypeId | Get properties palette group identifier. |
| SetCategories | Set categories for binding. |
| SetGroupTypeId | Set properties palette group identifier. |

# See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace