# PlanTopologySetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanTopologySetIterator Properties
PlanTopologySetIterator Class See Also
---
The PlanTopologySetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
PlanTopologySetIterator Class
Autodesk.Revit.DB Namespace