# CreateFromCurves Method (Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList(Curve), RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..CreateFromCurves Method (Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<(Of <(<'Curve>)>)>, RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean)
Rebar Class See Also
---
Creates a new instance of a shape driven Rebar element within the project.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static Rebar CreateFromCurves(
	Document doc,
	RebarStyle style,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	Element host,
	XYZ norm,
	IList<Curve> curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient,
	double hookRotationAngleAtStart,
	double hookRotationAngleAtEnd,
	ElementId endTreatmentTypeIdAtStart,
	ElementId endTreatmentTypeIdAtEnd,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```

Visual Basic
---
```text
Public Shared Function CreateFromCurves ( _
	doc As Document, _
	style As RebarStyle, _
	barType As RebarBarType, _
	startHook As RebarHookType, _
	endHook As RebarHookType, _
	host As Element, _
	norm As XYZ, _
	curves As IList(Of Curve), _
	startHookOrient As RebarHookOrientation, _
	endHookOrient As RebarHookOrientation, _
	hookRotationAngleAtStart As Double, _
	hookRotationAngleAtEnd As Double, _
	endTreatmentTypeIdAtStart As ElementId, _
	endTreatmentTypeIdAtEnd As ElementId, _
	useExistingShapeIfPossible As Boolean, _
	createNewShape As Boolean _
) As Rebar
```

Visual C++
---
```text
public:
static Rebar^ CreateFromCurves(
	Document^ doc,
	RebarStyle style,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	Element^ host,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient,
	double hookRotationAngleAtStart,
	double hookRotationAngleAtEnd,
	ElementId^ endTreatmentTypeIdAtStart,
	ElementId^ endTreatmentTypeIdAtEnd,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document A document.
style
    Type: Autodesk.Revit.DB.Structure..::..RebarStyle The usage of the bar, "standard" or "stirrup/tie".
barType
    Type: Autodesk.Revit.DB.Structure..::..RebarBarType A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook
    Type: Autodesk.Revit.DB.Structure..::..RebarHookType A RebarHookType element that defines the hook for the start of the bar. If this parameter is nullNothingnullptra null reference (Nothing in Visual Basic), it means to create a rebar with no hook.
endHook
    Type: Autodesk.Revit.DB.Structure..::..RebarHookType A RebarHookType element that defines the hook for the end of the bar. If this parameter is nullNothingnullptra null reference (Nothing in Visual Basic), it means to create a rebar with no hook.
host
    Type: Autodesk.Revit.DB..::..Element The element to which the rebar belongs. The element must support rebar hosting; [!:Autodesk::Revit::DB::Structure::RebarHostData].
norm
    Type: Autodesk.Revit.DB..::..XYZ The normal to the plane that the rebar curves lie on.
curves
    Type: System.Collections.Generic..::..IList<(Of <(<'Curve>)>)> An array of curves that define the shape of the rebar curves. They must belong to the plane defined by the normal and origin. Bends and hooks should not be included in the array of curves.
startHookOrient
    Type: Autodesk.Revit.DB.Structure..::..RebarHookOrientation Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
endHookOrient
    Type: Autodesk.Revit.DB.Structure..::..RebarHookOrientation Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart
    Type: System..::..Double The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd
    Type: System..::..Double The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart
    Type: Autodesk.Revit.DB..::..ElementId The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd
    Type: Autodesk.Revit.DB..::..ElementId The end treatment type id at the end of the bar.
useExistingShapeIfPossible
    Type: System..::..Boolean Attempts to assign a RebarShape from those existing in the document. If no shape matches, this function returns nullNothingnullptra null reference (Nothing in Visual Basic) if createNewShape is false or it will create a new shape if createNewShape is true. When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true". If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks, then this method will perform a second search, ignoring hook information.
createNewShape
    Type: System..::..Boolean Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance. Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes have enough shape parameters to define a shape for these curves.
# ### Return Value
The newly created Rebar instance, or nullNothingnullptra null reference (Nothing in Visual Basic) if the operation fails.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The element host was not found in the given document. -or- host is not a valid rebar host. -or- The input curves is empty. -or- The input curves contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- curves do not form a valid CurveLoop. -or- The input curves contains at least one helical curve and is not supported for this operation. -or- the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element. -or- the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | norm has zero length. -or- A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | Both useExistingShapeIfPossible and createNewShape are false. -or- curves contains non-fillet arcs with radii that are less than the minimum bend radius for the RebarBarType and bar style. |

# See Also
Rebar Class
CreateFromCurves Overload
Autodesk.Revit.DB.Structure Namespace