# MassLevelData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MassLevelData Methods
MassLevelData Class See Also
---
The MassLevelData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Indicates if the MassLevelData (Mass Floor) has a geometrical representation. May not if the level does not intersect the mass geometry. |
| IsMassFamilyInstance | Checks if the ElementId is a mass family instance. |
| IsValidConceptualConstructionTypeElement | Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor). |

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace