# PointLightShape Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointLightShape Members
PointLightShape Class Constructors Methods Properties See Also
---
The PointLightShape type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PointLightShape()()()() | Creates a point light shape object. |
| PointLightShape(PointLightShape) | Creates a copy of the given point light shape |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
PointLightShape Class
Autodesk.Revit.DB.Lighting Namespace