# FaceDetailNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceDetailNode Members
FaceDetailNode Class Methods Properties See Also
---
The FaceDetailNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetInstanceTransform | Returns instance transform of the object being drawn. |
| GetLinkTransform | Returns link transform of the object being drawn. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LineProperties | Access to the line (pen) properties of the curve being drawn. |

# See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace