# ClassificationEntry Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClassificationEntry Methods
ClassificationEntry Class See Also
---
The ClassificationEntry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HasBadCategoryId | Checks if the category id is Revit BuiltInCategory id. |
| HasBadLevel | Checks if the level is an integer in range between 1 and 5 inclusive. |
| HasInvalidKey | Checks if the key matches the level and parent key. |

# See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace