# FamilySymbolFilter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySymbolFilter Properties
FamilySymbolFilter Class See Also
---
The FamilySymbolFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyId | The family id. |

# See Also
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace