# Mesh Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Mesh Methods
Mesh Class See Also
---
The Mesh type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComputeSurfaceArea | Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh. |
| GetNormal | Returns a normal unit vector at the given index. |
| GetNormals | Returns all normals assigned to the mesh. |

# See Also
Mesh Class
Autodesk.Revit.DB Namespace