# FamilyParameterSetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyParameterSetIterator Methods
FamilyParameterSetIterator Class See Also
---
The FamilyParameterSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
FamilyParameterSetIterator Class
Autodesk.Revit.DB Namespace