# FilterNumericGreaterOrEqual Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericGreaterOrEqual Members
FilterNumericGreaterOrEqual Class Constructors Methods Properties See Also
---
The FilterNumericGreaterOrEqual type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterNumericGreaterOrEqual | Constructs an instance of FilterNumericGreaterOrEqual. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterNumericGreaterOrEqual Class
Autodesk.Revit.DB Namespace