# LinkNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkNode Methods
LinkNode Class See Also
---
The LinkNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDocument | Returns the document associated with the link. |

# See Also
LinkNode Class
Autodesk.Revit.DB Namespace