# TableCellCombinedParameterData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellCombinedParameterData Methods
TableCellCombinedParameterData Class See Also
---
The TableCellCombinedParameterData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | construct a TableCellCombinedParameterData |
| Dispose |

# See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace