# StructuralSectionGeneralLZ Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralLZ Members
StructuralSectionGeneralLZ Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralLZ type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralLZ | Creates a new instance of Z Cold Formed shape. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BottomFlangeLength | Bottom Flange segment length. |
| LipLength | Lip segment length. |

# See Also
StructuralSectionGeneralLZ Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace