# FamilyInstanceFilter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyInstanceFilter Properties
FamilyInstanceFilter Class See Also
---
The FamilyInstanceFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilySymbolId | The family symbol id. |

# See Also
FamilyInstanceFilter Class
Autodesk.Revit.DB Namespace