# CompoundStructureLayer Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CompoundStructureLayer Methods
CompoundStructureLayer Class See Also
---
The CompoundStructureLayer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace