# SplitButton Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SplitButton Properties
SplitButton Class See Also
---
The SplitButton type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentButton | Gets or sets the current PushButton of the SplitButton. |
| IsSynchronizedWithCurrentItem | Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property. |

# See Also
SplitButton Class
Autodesk.Revit.UI Namespace