# ComponentRepeater Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComponentRepeater Properties
ComponentRepeater Class See Also
---
The ComponentRepeater type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefaultFamilyType | The default family type for the component repeater. |
| DimensionCount | The dimension count of the component repeater. |

# See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace