# ReloadLatestOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReloadLatestOptions Methods
ReloadLatestOptions Class See Also
---
The ReloadLatestOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ReloadLatestOptions Class
Autodesk.Revit.DB Namespace