# PointIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointIterator Methods
PointIterator Class See Also
---
The PointIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Free | Completes lifetime of the iterator. Call it when done using the iterator. |
| IsDone | Identifies if the iteration has reached the end of the collection. |
| MoveNext | Increments the iterator to the next point in the collection. |
| Reset | Resets the iterator to the beginning of the collection. |

# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace