# SolidCurveIntersectionOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidCurveIntersectionOptions Methods
SolidCurveIntersectionOptions Class See Also
---
The SolidCurveIntersectionOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace