# RebarHandleNameData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarHandleNameData Methods
RebarHandleNameData Class See Also
---
The RebarHandleNameData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCustomHandleTag | Gets the handle tag for which we need to specify the name. |
| SetCustomHandleName | Sets the name of the handle. |

# See Also
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace