# StructuralSectionGeneralR Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralR Properties
StructuralSectionGeneralR Class See Also
---
The StructuralSectionGeneralR type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| WallDesignThickness | Represents wall design thickness of rectangle. |
| WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace