# BuildingPad Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingPad Properties
BuildingPad Class See Also
---
The BuildingPad type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssociatedTopographySurfaceId | The element id of a topography surface created by the introduction of this building pad. |
| HostId | The element id of the topography surface hosting this BuidlingPad. |

# See Also
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace