# PointCollection Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCollection Methods
PointCollection Class See Also
---
The PointCollection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetPointBufferPointer | Returns an unsafe pointer to the buffer in which this collection stores the points. |
| GetPointIterator | Creates and returns an iterator for the points contained in this collection. |

# See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace