# DockableFrameVisibilityChangedEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockableFrameVisibilityChangedEventArgs Properties
DockableFrameVisibilityChangedEventArgs Class See Also
---
The DockableFrameVisibilityChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DockableFrameShown | True if the pane is being shown, false if it is being hidden. |
| PaneId | The identifier for dockable pane. |

# See Also
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace