# DocumentWorksharingEnabledEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentWorksharingEnabledEventArgs Members
DocumentWorksharingEnabledEventArgs Class Methods Properties See Also
---
The DocumentWorksharingEnabledEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDocument | Returns document associated with this event |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace