# RoomTagFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoomTagFilter Members
RoomTagFilter Class Constructors Methods Properties See Also
---
The RoomTagFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RoomTagFilter | Constructs a filter which matches only rooms. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RoomTagFilter Class
Autodesk.Revit.DB.Architecture Namespace