# StructuralSection Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSection Methods
StructuralSection Class See Also
---
The StructuralSection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBoundarySize | Returns size of the section boundary. |
| GetEnumerator |

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace