# DisplayType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..DisplayType Property
ScheduleField Class See Also
---
Indicates the chosen display type for the field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ScheduleFieldDisplayType DisplayType { get; set; }
```

Visual Basic
---
```text
Public Property DisplayType As ScheduleFieldDisplayType
	Get
	Set
```

Visual C++
---
```text
public:
property ScheduleFieldDisplayType DisplayType {
	ScheduleFieldDisplayType get ();
	void set (ScheduleFieldDisplayType value);
}
```

# ### Field Value
The display types are: Standard - standard display type; will not display anything for multiple elements with different values. Totals - In a non-itemized schedule, totals are displayed in regular rows when multiple elements appear on the same row. Min - In a non-itemized schedule, minimum value is displayed in regular rows when multiple elements appear on the same row. Max - In a non-itemized schedule, maximum value is displayed in regular rows when multiple elements appear on the same row. MinMax - In a non-itemized schedule, Minimum/Maximum values are displayed in regular rows when multiple elements appear on the same row.
# Remarks
This replaces the hasTotals property from 2017. The hasTotals = true is same as DisplayType::Totals; hasTotals = false is the same as DisplayType::Standard. This also adds the ability to see Min/Max for grouped elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This ScheduleField cannot display minimum and maximum values. -or- When setting this property: This ScheduleField cannot be totaled. |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace