# DocumentDifference Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentDifference Methods
DocumentDifference Class See Also
---
The DocumentDifference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCreatedElementIds | Created element id collection. |
| GetDeletedElementIds | Deleted element id collection. For non-worksharing models, this will always be an empty collection. |
| GetModifiedElementIds | Modified element id collection. |

# See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace