# SolidGeometryOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidGeometryOptions Methods
SolidGeometryOptions Class See Also
---
The SolidGeometryOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace