# ConceptualConstructionType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConceptualConstructionType Properties
ConceptualConstructionType Class See Also
---
The ConceptualConstructionType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MassSurfaceSubCategoryId | The surface type subcategory element id associated with the ConceptualConstructionType. |
| MaterialId | Material used for visualization of this construction. |

# See Also
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace