# TransferringProjectStandardsEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransferringProjectStandardsEventArgs Methods
TransferringProjectStandardsEventArgs Class See Also
---
The TransferringProjectStandardsEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetExternalItems | Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |
| SetExternalItems | Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |

# See Also
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace