# AssetSetIterator Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetSetIterator Members
AssetSetIterator Class Constructors Methods Properties See Also
---
The AssetSetIterator type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssetSetIterator | Initializes a new instance of the AssetSetIterator class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext |
| Reset |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current |

# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace