# DimensionEqualityLabelFormatting Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionEqualityLabelFormatting Methods
DimensionEqualityLabelFormatting Class See Also
---
The DimensionEqualityLabelFormatting type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetFormatOptions | Gets the format options used to show the parameter value. |
| IsValidFormatOptions | Checks whether a FormatOptions object is valid for the LabelType. |
| SetFormatOptions | Sets the format options used to show the parameter value. |

# See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace