# CADLinkOperations Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CADLinkOperations Class
Members See Also
---
This class is used to extend the IExternalResourceServer interface with methods to support operations specifically related to DWG links.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class CADLinkOperations : LinkOperations
```

Visual Basic
---
```text
Public Class CADLinkOperations _
	Inherits LinkOperations
```

Visual C++
---
```text
public ref class CADLinkOperations : public LinkOperations
```

# Remarks
The class owns single-method interfaces which are used as callbacks to perform specific operations on DWG link external resources.
An empty CADLinkOperations instance is passed to an IExternalResourceServer (inside an ExternalResourceServerExtensions object) via the GetTypeSpecificServerOperations method. The server provider can then add their own implemented interface objects to the CADLinkOperations, thus making them available to Revit to use as callbacks.
Supporting these additional, type-specific operations is not absolutely required, but is strongly recommended in order for users to be able to perform all the same operations they would with locally-accessed links.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LinkOperations Autodesk.Revit.DB..::..CADLinkOperations
# See Also
CADLinkOperations Members
Autodesk.Revit.DB Namespace