# ElementArrayIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementArrayIterator Properties
ElementArrayIterator Class See Also
---
The ElementArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
ElementArrayIterator Class
Autodesk.Revit.DB Namespace