# EdgeArrayIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArrayIterator Properties
EdgeArrayIterator Class See Also
---
The EdgeArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
EdgeArrayIterator Class
Autodesk.Revit.DB Namespace