# SegmentLengthsForArcsDisplayOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..SegmentLengthsForArcsDisplayOption Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies if the arc segment lengths are represented using dimensions or just as text. Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthsForArcsDisplayOption As BendingDetailSegmentLengthsDisplayOptions
	Get
	Set
```

Visual C++
---
```text
public:
property BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption {
	BendingDetailSegmentLengthsDisplayOptions get ();
	void set (BendingDetailSegmentLengthsDisplayOptions value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace