# ElectricalAnalyticalNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalAnalyticalNode Methods
ElectricalAnalyticalNode Class See Also
---
The ElectricalAnalyticalNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanConnectToUpstreamNode | Verifies that the current node can connect to the upstream node. |
| CanDisconnectFromUpstreamNode | Verifies that the current node can disconnect from the upstream node. |
| ConnectToUpstreamNode | Connects to upstream node. |
| Create | Creates an electrical analytical node. |
| DisconnectFromUpstreamNode | Disconnects from upstream node. |
| GetAllDownstreamLoadIds | Get all the descendant Electrical Analytical Load ids of the node. |
| GetAnalyticalPropertyData | Gets the electrical analytical node property data, nullNothingnullptra null reference (Nothing in Visual Basic) if not available. |
| GetDownstreamNodeIds | Gets the downstream node ids. |
| GetUpstreamNodeIds | Gets upstream node ids. |

# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace