# RevitAPIPostDocEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIPostDocEventArgs Properties
RevitAPIPostDocEventArgs Class See Also
---
The RevitAPIPostDocEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
RevitAPIPostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace