# NurbSpline Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NurbSpline Methods
NurbSpline Class See Also
---
The NurbSpline type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new geometric NurbSpline object from a HermiteSpline. |
| CreateCurve(HermiteSpline) | Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| CreateCurve(IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Double>)>>)) | Creates a new geometric Curve object from NURBS curve data containing just control points and weights. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| CreateCurve(Int32, IList<(Of <<'(Double>)>>), IList<(Of <<'(XYZ>)>>)) | Creates a new geometric Curve object from NURBS curve data, which does not include weights. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| CreateCurve(Int32, IList<(Of <<'(Double>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Double>)>>)) | Creates a new geometric Curve object from NURBS curve data, which includes weights. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
| SetControlPointsAndWeights | Set the control points, weights simultaneously. |

# See Also
NurbSpline Class
Autodesk.Revit.DB Namespace