# ExportFontInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportFontInfo Methods
ExportFontInfo Class See Also
---
The ExportFontInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExportFontInfo Class
Autodesk.Revit.DB Namespace