# TransformWithBoundary Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransformWithBoundary Methods
TransformWithBoundary Class See Also
---
The TransformWithBoundary type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBoundary | Returns the boundary for the model space to view projection space transform. |
| GetModelToProjectionTransform | Gets the model space to view projection space transform. |

# See Also
TransformWithBoundary Class
Autodesk.Revit.DB Namespace