# IPhotoRenderContext Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPhotoRenderContext Interface
Members See Also
---
An interface that is used in custom export to render 3D views of a Revit model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public interface IPhotoRenderContext : IExportContext
```

Visual Basic
---
```text
Public Interface IPhotoRenderContext _
	Inherits IExportContext
```

Visual C++
---
```text
public interface class IPhotoRenderContext : IExportContext
```

# Remarks
An instance of a class that implements this interface is passed in as a parameter of the CustomExporter constructor. The interface methods are then called at times of rendering entities that are currently visible in the view being rendered.
With this type of export context used to perform a custom export, Revit will traverse the model and output the model's geometry as if processing the Render command invoked via the UI. It means that only such elements that have actual geometry and are suitable to appear in a rendered view will be processed and output.
# See Also
IPhotoRenderContext Members
Autodesk.Revit.DB Namespace