# SlabEdge Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabEdge Members
SlabEdge Class Methods Properties See Also
---
The SlabEdge type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSegment | Add segments to the slab edge. (Overrides HostedSweep..::..AddSegment(Reference).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SlabEdgeType | Retrieves/set an object that represents the type of the SlabEdge. |

# See Also
SlabEdge Class
Autodesk.Revit.DB Namespace