# SynchronizeWithCentralOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SynchronizeWithCentralOptions Methods
SynchronizeWithCentralOptions Class See Also
---
The SynchronizeWithCentralOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetRelinquishOptions | Gets the options which govern whether or not to relinquish elements and workset types. |
| SetRelinquishOptions | Sets the options which govern whether or not to relinquish elements and workset types. |

# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace