# PhaseArrayIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhaseArrayIterator Methods
PhaseArrayIterator Class See Also
---
The PhaseArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
PhaseArrayIterator Class
Autodesk.Revit.DB Namespace