# VectorAtPoint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VectorAtPoint Members
VectorAtPoint Class Constructors Methods Properties See Also
---
The VectorAtPoint type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |
| VectorAtPoint(IList<(Of <<'(XYZ>)>>)) | Creates object from an array of vectors |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
VectorAtPoint Class
Autodesk.Revit.DB.Analysis Namespace