# CurveByPoints Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveByPoints Properties
CurveByPoints Class See Also
---
The CurveByPoints type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReferenceLine |
| ReferenceType | Indicates the type of reference. |
| SketchPlane | Override the SketchPlane property of CurveElement. (Overrides CurveElement..::..SketchPlane.) |
| Subcategory | The subcategory, or graphics style, of the CurveByPoints. |
| Visible | Whether the point is visible when the family is loaded into a project. |

# See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace