# WorksetId Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetId Methods
WorksetId Class See Also
---
The WorksetId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Compare | Compares two WorksetIds. |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the integer value of the id as hash code  (Overrides Object..::..GetHashCode()()()().) |
| ToString | Gets a String representation of the integer value of the id.  (Overrides Object..::..ToString()()()().) |

# See Also
WorksetId Class
Autodesk.Revit.DB Namespace