# GroupLoadOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GroupLoadOptions Methods
GroupLoadOptions Class See Also
---
The GroupLoadOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDuplicateTypeNamesHandler | Returns current duplicate type names handler or nullNothingnullptra null reference (Nothing in Visual Basic) if none is set. |
| SetDuplicateTypeNamesHandler | Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation. |

# See Also
GroupLoadOptions Class
Autodesk.Revit.DB Namespace