# ProjectLocationSetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ProjectLocationSetIterator Methods
ProjectLocationSetIterator Class See Also
---
The ProjectLocationSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
ProjectLocationSetIterator Class
Autodesk.Revit.DB Namespace