# InsufficientResourcesException Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InsufficientResourcesException Members
InsufficientResourcesException Class Methods Properties See Also
---
The InsufficientResourcesException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
InsufficientResourcesException Class
Autodesk.Revit.Exceptions Namespace