# StairsComponentConnection Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StairsComponentConnection Methods
StairsComponentConnection Class See Also
---
The StairsComponentConnection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace