# RoutingConditions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoutingConditions Methods
RoutingConditions Class See Also
---
The RoutingConditions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AppendCondition | Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector. |
| Clear | Clear all existing conditions |
| Dispose |
| GetConditionAt | Gets the routing condition at the specified index position. |
| GetNumberOfConditions | Gets the number of included routing conditions. |

# See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace