# SaveOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SaveOptions Methods
SaveOptions Class See Also
---
The SaveOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SaveOptions Class
Autodesk.Revit.DB Namespace