# ViewPrintedEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewPrintedEventArgs Members
ViewPrintedEventArgs Class Methods Properties See Also
---
The ViewPrintedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Index | The index of the view being printed out of the set of all views being printed. |
| TotalViews | The number of all views being printed. |
| View | The view that was printed. |

# See Also
ViewPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace