# ConduitSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSettings Methods
ConduitSettings Class See Also
---
The ConduitSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetConduitSettings | Gets the conduit settings of the project. |

# See Also
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace