# DWFXExportOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWFXExportOptions Members
DWFXExportOptions Class Constructors Methods Properties See Also
---
The DWFXExportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DWFXExportOptions | Default constructor. Sets all options to their default values. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
DWFXExportOptions Class
Autodesk.Revit.DB Namespace