# ElementNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementNode Members
ElementNode Class Methods Properties See Also
---
The ElementNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | Gets the document associated with the element. |
| ElementId | The Id of the element. |
| LinkInstanceId | The Id of the link instance for the element. |

# See Also
ElementNode Class
Autodesk.Revit.DB Namespace