# BarTypeDiameterOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BarTypeDiameterOptions Methods
BarTypeDiameterOptions Class See Also
---
The BarTypeDiameterOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace