# TriangulatedSolidOrShell Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulatedSolidOrShell Methods
TriangulatedSolidOrShell Class See Also
---
The TriangulatedSolidOrShell type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetShellComponent | Returns the specified shell component of a solid or shell. Input componentIndex must lie between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent should not be modified by the caller. |

# See Also
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace