# FileAccessException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileAccessException Methods
FileAccessException Class See Also
---
The FileAccessException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides IOException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
FileAccessException Class
Autodesk.Revit.Exceptions Namespace