# PhaseFilter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhaseFilter Methods
PhaseFilter Class See Also
---
The PhaseFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new phase filter with default status presentation. |
| GetPhaseStatusPresentation | Gets the phase status presentation. |
| SetPhaseStatusPresentation | Sets the phase status presentation. |

# See Also
PhaseFilter Class
Autodesk.Revit.DB Namespace