# FilterRule Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterRule Methods
FilterRule Class See Also
---
The FilterRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. |
| GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. |

# See Also
FilterRule Class
Autodesk.Revit.DB Namespace