# PrintSetup Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PrintSetup Properties
PrintSetup Class See Also
---
The PrintSetup type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentPrintSetting | The current Print Setting of Print Setup. |
| InSession | The in-session Print Setting of Print Setup. |

# See Also
PrintSetup Class
Autodesk.Revit.DB Namespace