# IFCTransformSetter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCTransformSetter Methods
IFCTransformSetter Class See Also
---
The IFCTransformSetter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a transform setter. |
| Dispose |
| Initialize | Initializes the transformation in the transform setter. |
| InitializeFromBoundingBox |

# See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace