# UnauthenticatedException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UnauthenticatedException Methods
UnauthenticatedException Class See Also
---
The UnauthenticatedException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ApplicationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
UnauthenticatedException Class
Autodesk.Revit.Exceptions Namespace