# FillPatternElement Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FillPatternElement Methods
FillPatternElement Class See Also
---
The FillPatternElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new FillPatternElement. |
| GetFillPattern | Gets the FillPattern associated to this element. |
| GetFillPatternElementByName | Retrieves the FillPatternElement by its name. |
| SetFillPattern | Sets the FillPattern associated to this element. |

# See Also
FillPatternElement Class
Autodesk.Revit.DB Namespace