# EdgeArrayArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArrayArray Methods
EdgeArrayArray Class See Also
---
The EdgeArrayArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the edge array to the end of the array. |
| Clear | Removes every edge array from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert | Insert the specified edge array into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace