# PrintSetting Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PrintSetting Members
PrintSetting Class Methods Properties See Also
---
The PrintSetting type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | Returns the Name of Print Setup. (Overrides Element..::..Name.) |
| PrintParameters | Returns the Parameters of Print Setup. |

# See Also
PrintSetting Class
Autodesk.Revit.DB Namespace