# RebarReinforcementData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarReinforcementData Properties
RebarReinforcementData Class See Also
---
The RebarReinforcementData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| End | The end of the rebar. The end should be 0 or 1. |
| RebarId | The id of the Rebar |

# See Also
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace