# ImagePlacementOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImagePlacementOptions Methods
ImagePlacementOptions Class See Also
---
The ImagePlacementOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ImagePlacementOptions Class
Autodesk.Revit.DB Namespace