# TemperatureRatingTypeSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TemperatureRatingTypeSet Properties
TemperatureRatingTypeSet Class See Also
---
The TemperatureRatingTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of TemperatureRating types that are in the set. |

# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace