# RevitLinkGraphicsSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkGraphicsSettings Methods
RevitLinkGraphicsSettings Class See Also
---
The RevitLinkGraphicsSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace