# ReferencePoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferencePoint Properties
ReferencePoint Class See Also
---
The ReferencePoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CoordinatePlaneVisibility | Visibility settings for the coordinate reference planes. |
| Name | (Overrides Element..::..Name.) |
| Position | The position of the ReferencePoint. |
| ShowNormalReferencePlaneOnly | Whether all three coordinate planes are shown, or only the normal (XY) plane. |
| Visible | Whether the point is visible when the family is loaded into a project. |

# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace