# InsufficientResourcesException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InsufficientResourcesException Methods
InsufficientResourcesException Class See Also
---
The InsufficientResourcesException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
InsufficientResourcesException Class
Autodesk.Revit.Exceptions Namespace