# StructuralSectionRectangleParameterized Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionRectangleParameterized Members
StructuralSectionRectangleParameterized Class Constructors Methods Properties See Also
---
The StructuralSectionRectangleParameterized type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionRectangleParameterized | Creates a new instance of Structural Section Rectangle Parameterized shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionRectangleParameterized Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace