# Path3d Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Path3d Properties
Path3d Class See Also
---
The Path3d type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllCurveLoops | Get all the Curve Loops of Path3d. |
| CurveLoop | Get the Curve Loop of Path3d via index. |
| NumCurveLoops | Get the Number of Curve Loops of Path3d. |

# See Also
Path3d Class
Autodesk.Revit.DB Namespace