# RevitAPIPostEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIPostEventArgs Members
RevitAPIPostEventArgs Class Methods Properties See Also
---
The RevitAPIPostEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). |

# See Also
RevitAPIPostEventArgs Class
Autodesk.Revit.DB.Events Namespace