# StructuralConnectionHandler Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralConnectionHandler Properties
StructuralConnectionHandler Class See Also
---
The StructuralConnectionHandler type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ApprovalTypeId | Retrieves or changes approval type of the Structural Connection Handler. |
| CodeCheckingStatus | Code checking status of the structural connection. |
| OverrideTypeParams | Allow or disallow connection's type parameters to be overridden. |
| SingleElementEndIndex | Element end index for single element connections (0: start, 1: end). |

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace