# TextBoxEnterPressedEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextBoxEnterPressedEventArgs Members
TextBoxEnterPressedEventArgs Class Constructors Methods Properties See Also
---
The TextBoxEnterPressedEventArgs type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TextBoxEnterPressedEventArgs | Initializes a new instance of the TextBoxEnterPressedEventArgs class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
TextBoxEnterPressedEventArgs Class
Autodesk.Revit.UI.Events Namespace