# ElementMulticlassFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementMulticlassFilter Members
ElementMulticlassFilter Class Constructors Methods Properties See Also
---
The ElementMulticlassFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementMulticlassFilter(IList<(Of <<'(Type>)>>)) | Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes. |
| ElementMulticlassFilter(IList<(Of <<'(Type>)>>), Boolean) | Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match elements whose Element subclass does not match the list of input classes. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ElementMulticlassFilter Class
Autodesk.Revit.DB Namespace