# RevitServerCommunicationException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitServerCommunicationException Methods
RevitServerCommunicationException Class See Also
---
The RevitServerCommunicationException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides RevitServerException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
RevitServerCommunicationException Class
Autodesk.Revit.Exceptions Namespace