# ExternalResourceLoadContext Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceLoadContext Methods
ExternalResourceLoadContext Class See Also
---
The ExternalResourceLoadContext type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CallingDocumentHasModelPath | Indicates whether the document requesting the external resource has a defined ModelPath. |
| Dispose |
| GetCallingDocumentModelPath | Returns a copy of the ModelPath of the document that is requesting the external resource. |
| GetCurrentlyLoadedReference | Returns a copy of the ExternalResourceReference currently in use by the containing element. |

# See Also
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace