# DialogBoxShowingEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DialogBoxShowingEventArgs Methods
DialogBoxShowingEventArgs Class See Also
---
The DialogBoxShowingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |

# See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace