# StructuralSectionGeneralH Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralH Properties
StructuralSectionGeneralH Class See Also
---
The StructuralSectionGeneralH type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InnerFillet | Inner Fillet - Corner fillet inner radius. |
| OuterFillet | Outer Fillet - Corner fillet outer radius. |
| WallDesignThickness | Represents wall design thickness of rectangle. |
| WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace