# LoadUsage Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadUsage Methods
LoadUsage Class See Also
---
The LoadUsage type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new LoadUsage. |

# See Also
LoadUsage Class
Autodesk.Revit.DB.Structure Namespace