# VertexPositionColored Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPositionColored Methods
VertexPositionColored Class See Also
---
The VertexPositionColored type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetColor | Gets the vertex's color. |
| GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |
| SetColor | Sets the vertex's color. |

# See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace