# CylindricalHelix Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CylindricalHelix Methods
CylindricalHelix Class See Also
---
The CylindricalHelix type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Create a cylindrical helix. |

# See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace