# ConnectorManager Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorManager Methods
ConnectorManager Class See Also
---
The ConnectorManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Lookup | Lookup the connector using the unique index value that identify this connector. |

# See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace