# RebarBendingDetailType Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarBendingDetailType Methods
RebarBendingDetailType Class See Also
---
The RebarBendingDetailType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new RebarBendingDetailType object. |

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace