# VendorIdAttribute Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VendorIdAttribute Properties
VendorIdAttribute Class See Also
---
The VendorIdAttribute type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | AddInId VendorId value. |

# See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace