# PointLocationOnCurve Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointLocationOnCurve Methods
PointLocationOnCurve Class See Also
---
The PointLocationOnCurve type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace