# MEPBuildingConstructionSetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPBuildingConstructionSetIterator Properties
MEPBuildingConstructionSetIterator Class See Also
---
The MEPBuildingConstructionSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
MEPBuildingConstructionSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace