# GroupType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GroupType Properties
GroupType Class See Also
---
The GroupType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Groups | Retrieve a set of all the groups that have this type. |

# See Also
GroupType Class
Autodesk.Revit.DB Namespace