# SlabShapeVertexArrayIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabShapeVertexArrayIterator Methods
SlabShapeVertexArrayIterator Class See Also
---
The SlabShapeVertexArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
SlabShapeVertexArrayIterator Class
Autodesk.Revit.DB Namespace