# DistributionSysTypeSetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DistributionSysTypeSetIterator Properties
DistributionSysTypeSetIterator Class See Also
---
The DistributionSysTypeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
DistributionSysTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace