# ElementPhaseStatusFilter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementPhaseStatusFilter Methods
ElementPhaseStatusFilter Class See Also
---
The ElementPhaseStatusFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetPhaseStatuses | Returns the phase statuses assigned to this filter. |

# See Also
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace