# AlternatingBarOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinforcement..::..AlternatingBarOrientation Property
PathReinforcement Class See Also
---
Orientation of alternating bars of Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ReinforcementBarOrientation AlternatingBarOrientation { get; set; }
```

Visual Basic
---
```text
Public Property AlternatingBarOrientation As ReinforcementBarOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property ReinforcementBarOrientation AlternatingBarOrientation {
	ReinforcementBarOrientation get ();
	void set (ReinforcementBarOrientation value);
}
```

# Remarks
The orientation corresponds to the bars' rotation in the Path Reinforcement element. It indicates the postion of the major segment of the alternating Rebar Shape relative to the edges of a rectangular region which bounds the Path Reinforcement, where the top/exterior and bottom/interior come from the cover boundaries of the host, the near side edge is defined by the Path Reinforcement sketch line, and the far side edge is derived from bar length (defaulting to 5').
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: This orientation is not allowed for alternating bars. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace