# DialogBoxData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DialogBoxData Methods
DialogBoxData Class See Also
---
The DialogBoxData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |

# See Also
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace