# CeilingType Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CeilingType Members
CeilingType Class Methods Properties See Also
---
The CeilingType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ThermalProperties | The calculated and settable thermal properties of the CeilingType |

# See Also
CeilingType Class
Autodesk.Revit.DB Namespace