# DirectShapeType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeType Properties
DirectShapeType Class See Also
---
The DirectShapeType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| UserAssignability | An option controlling the ability of DirectShapes to assign this DirectShapeType as its type. |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace