# ExternallyTaggedGeometryObject Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedGeometryObject Methods
ExternallyTaggedGeometryObject Class See Also
---
The ExternallyTaggedGeometryObject type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace