# FamilyParameter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyParameter Methods
FamilyParameter Class See Also
---
The FamilyParameter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value. |

# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace