# ConnectionValidationWarning Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionValidationWarning Methods
ConnectionValidationWarning Class See Also
---
The ConnectionValidationWarning type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetParts | Get ElementIds of affected parts. |

# See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace