# MEPAnalyticalConnectionType Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalConnectionType Members
MEPAnalyticalConnectionType Class Methods Properties See Also
---
The MEPAnalyticalConnectionType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an analytical connection type element. |
| FindTypeByName | Finds the analytical connection type by its name. |
| IsNameUnused | Checks if this is an unused name. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PressureLoss | The pressure loss of this analytical connection type. |

# See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace