# SlabShapeCreaseArrayIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabShapeCreaseArrayIterator Methods
SlabShapeCreaseArrayIterator Class See Also
---
The SlabShapeCreaseArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
SlabShapeCreaseArrayIterator Class
Autodesk.Revit.DB Namespace