# ExternalResourceMatchOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceMatchOptions Methods
ExternalResourceMatchOptions Class See Also
---
The ExternalResourceMatchOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace