# BRepBuilderGeometryId Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BRepBuilderGeometryId Methods
BRepBuilderGeometryId Class See Also
---
The BRepBuilderGeometryId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| InvalidGeometryId | Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error. |

# See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace