# MassSurfaceData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MassSurfaceData Methods
MassSurfaceData Class See Also
---
The MassSurfaceData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFaceReferences | Gets References to the faces that the MassSurfaceData provides properties for. |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace