# FamilySymbolProfile Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySymbolProfile Properties
FamilySymbolProfile Class See Also
---
The FamilySymbolProfile type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Angle | The angle of the rotation of the profile in radians. |
| IsFlipped | Indicates if the symbol profile is flipped or not. |
| Profile | Returns the family symbol of the profile. |
| XOffset | The offset of the profile to the origin of the sketch plane in the X direction. |
| YOffset | The offset of the profile to the origin of the sketch plane in the Y direction. |

# See Also
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace