# PlanTopology Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanTopology Methods
PlanTopology Class See Also
---
The PlanTopology type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetRoomIds | Retrieves room ElementIds of the PlanTopology in the last phase. |

# See Also
PlanTopology Class
Autodesk.Revit.DB Namespace