# DimensionSegmentArray Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionSegmentArray Methods
DimensionSegmentArray Class See Also
---
The DimensionSegmentArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the item to the end of the array. |
| Clear | Removes every item from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert | Insert the specified item into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace