# DWFImportOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWFImportOptions Methods
DWFImportOptions Class See Also
---
The DWFImportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetSheetViews | Get sheet views where DWF markups are imported. |
| SetSheetViews | Set sheet views where DWF markups are imported. |

# See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace