# ObjectAccessException Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ObjectAccessException Methods
ObjectAccessException Class See Also
---
The ObjectAccessException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ObjectAccessException Class
Autodesk.Revit.Exceptions Namespace