# AreaBasedLoadType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaBasedLoadType Properties
AreaBasedLoadType Class See Also
---
The AreaBasedLoadType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ApparentPowerDensity | The apparent power density of area based load type. |
| LoadClassification | The load classification of area based load type. |
| LoadDensity | The load density of area based load type. |
| PowerFactor | The power factor of area based load type. |

# See Also
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace