# SpatialElementCalculationPoint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementCalculationPoint Members
SpatialElementCalculationPoint Class Methods Properties See Also
---
The SpatialElementCalculationPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Position | The position of the "in" spatial element calculation point. |

# See Also
SpatialElementCalculationPoint Class
Autodesk.Revit.DB Namespace