# RevitAPIPreEventArgs Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIPreEventArgs Methods
RevitAPIPreEventArgs Class See Also
---
The RevitAPIPreEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | When the event is cancellable, may call the Cancel() method to cancel it. |

# See Also
RevitAPIPreEventArgs Class
Autodesk.Revit.DB.Events Namespace