# SpaceTagFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpaceTagFilter Members
SpaceTagFilter Class Constructors Methods Properties See Also
---
The SpaceTagFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SpaceTagFilter | Constructs a filter which matches only spaces. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SpaceTagFilter Class
Autodesk.Revit.DB.Mechanical Namespace