# FilterStringRule Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringRule Properties
FilterStringRule Class See Also
---
The FilterStringRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RuleString | The user-supplied string against which strings from a Revit document will be tested. |

# See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace