# DataStorage Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DataStorage Members
DataStorage Class Methods Properties See Also
---
The DataStorage type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new DataStorage element and adds it to the document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
DataStorage Class
Autodesk.Revit.DB.ExtensibleStorage Namespace