# ExternalDataInstanceAddedIntoDocumentEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDataInstanceAddedIntoDocumentEventArgs Properties
ExternalDataInstanceAddedIntoDocumentEventArgs Class See Also
---
The ExternalDataInstanceAddedIntoDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ItemId | The id of the external data item to which a new reference has been added. |
| NewInstanceId | The newly added external data instance id. |
| ProjectId | The id of the external project of the external data item to which a new reference has been added. |
| TypeId | The type id of the newly added external data instance id. |

# See Also
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace