# PointCloudType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudType Properties
PointCloudType Class See Also
---
The PointCloudType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorEncoding | The color encoding used by points extracted from instances of this point cloud. |
| EngineIdentifier | The identifier of the engine responsible for handling of the point cloud. |
| FoundStatus | Shows whether the Point Cloud external file could be found. |
| Offset | Returns the offset stored in the point cloud. |
| Scale | The multiplier applied to the points in all instances of this point cloud. |

# See Also
PointCloudType Class
Autodesk.Revit.DB Namespace