# FabricationVersionInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationVersionInfo Methods
FabricationVersionInfo Class See Also
---
The FabricationVersionInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace