# Fascia Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Fascia Properties
Fascia Class See Also
---
The Fascia type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FasciaType | Retrieves/set an object that represents the type of the Fascia. |

# See Also
Fascia Class
Autodesk.Revit.DB.Architecture Namespace