# CableTray Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTray Properties
CableTray Class See Also
---
The CableTray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurveNormal | The up-direction vector of the cable tray. |
| RungSpace | Distance between two rungs for the ladder cable tray. |

# See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace