# ShapeBuilder Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ShapeBuilder Members
ShapeBuilder Class Methods Properties See Also
---
The ShapeBuilder type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ShapeBuilder |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ShapeBuilder Class
Autodesk.Revit.DB Namespace