# Duct Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Duct Properties
Duct Class See Also
---
The Duct type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DuctType | The duct type of this duct. |
| IsPlaceholder | Identifies if the duct is a placeholder or not. |

# See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace