# ElementIntersectsFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIntersectsFilter Members
ElementIntersectsFilter Class Methods Properties See Also
---
The ElementIntersectsFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsCategorySupported | Identifies if the input element is of a category supported by element intersection filters. |
| IsElementSupported | Identifies if the input element is supported by element intersection filters. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace