# RevitAPIPreDocEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIPreDocEventArgs Members
RevitAPIPreDocEventArgs Class Methods Properties See Also
---
The RevitAPIPreDocEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
RevitAPIPreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace