# AssetProperties Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetProperties Methods
AssetProperties Class See Also
---
The AssetProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FindByName | Gets the property with the given name. |
| Get | Gets the property at the given index. |
| IsValidIndex | Returns true if the provided index is valid. |

# See Also
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace