# ParameterSetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterSetIterator Properties
ParameterSetIterator Class See Also
---
The ParameterSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
ParameterSetIterator Class
Autodesk.Revit.DB Namespace