# ColorFillLegend Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorFillLegend Methods
ColorFillLegend Class See Also
---
The ColorFillLegend type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates new instance of ColorFillLegend. |
| GetColumnWidths | Returns array of column widths in the legend. |
| SetColumnWidths | Sets array of column widths. |

# See Also
ColorFillLegend Class
Autodesk.Revit.DB Namespace