# DuctSizeIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctSizeIterator Methods
DuctSizeIterator Class See Also
---
The DuctSizeIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current MEPSize. |
| HasCurrent | Identifies if the iterator has a current item. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace