# StructuralSectionSigmaProfileWithFold Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionSigmaProfileWithFold Properties
StructuralSectionSigmaProfileWithFold Class See Also
---
The StructuralSectionSigmaProfileWithFold type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendWidth | Bend segment width. |
| FoldWidth | Fold segment width. |
| LipLength | Lip segment length. |
| MiddleBendLength | Middle Bend segment length. |
| TopBendLength | Top Bend segment length. |

# See Also
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace