# ConnectionInputPointInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionInputPointInfo Methods
ConnectionInputPointInfo Class See Also
---
The ConnectionInputPointInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace