# MullionTypeSet Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MullionTypeSet Properties
MullionTypeSet Class See Also
---
The MullionTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of mullion types that are in the set. |

# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace