# VertexStreamPositionNormal Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStreamPositionNormal Methods
VertexStreamPositionNormal Class See Also
---
The VertexStreamPositionNormal type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddVertex | Inserts a VertexStreamPositionNormal into the stream and associated buffer. |
| AddVertices | Inserts multiple VertexStreamPositionNormal instances into the stream and associated buffer. |

# See Also
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace