# MultiServerService Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MultiServerService Properties
MultiServerService Class See Also
---
The MultiServerService type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExecutionPolicy | Specifies how a multi-server service executes servers during its execution. |

# See Also
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace