# FolderItemInfo Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FolderItemInfo Members
FolderItemInfo Class Methods Properties See Also
---
The FolderItemInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FolderItemInfo |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | The folder parameter Id |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The folder name |

# See Also
FolderItemInfo Class
Autodesk.Revit.DB Namespace