# DetailCurveArrayIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DetailCurveArrayIterator Methods
DetailCurveArrayIterator Class See Also
---
The DetailCurveArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
DetailCurveArrayIterator Class
Autodesk.Revit.DB Namespace