# ContourSetting Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContourSetting Methods
ContourSetting Class See Also
---
The ContourSetting type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddContourRange | Add a set of contours as a contour setting item to the current contour setting. |
| AddSingleContour | Add a single contour as a contour setting item to the current contour setting. |
| DisableItem | Disable a contour setting item of the current contour setting so that the item will not be used to draw contours. |
| Dispose |
| EnableItem | Enable a contour setting item of the current contour setting so that the item will be used to draw contours. |
| GetContourSettingItems | Get all contour setting items. |
| GetItemIndex | Get the index of a contour setting item of the current contour setting |
| RemoveItem | Remove a contour setting item from the current contour setting. |

# See Also
ContourSetting Class
Autodesk.Revit.DB Namespace