# CombinableElementArray Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CombinableElementArray Properties
CombinableElementArray Class See Also
---
The CombinableElementArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a CombinableElement at a specified index within the array. |
| Size | Returns the number of CombinableElements that are in the array. |

# See Also
CombinableElementArray Class
Autodesk.Revit.DB Namespace