# Gutter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Gutter Methods
Gutter Class See Also
---
The Gutter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSegment | Add segments to the gutter. (Overrides HostedSweep..::..AddSegment(Reference).) |

# See Also
Gutter Class
Autodesk.Revit.DB.Architecture Namespace