# StructuralSectionGeneralC Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralC Members
StructuralSectionGeneralC Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralC type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralC | Creates a new instance of general Channel Cold Formed shape. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LipLength | Lip segment length. |

# See Also
StructuralSectionGeneralC Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace