# ModelPath Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelPath Methods
ModelPath Class See Also
---
The ModelPath type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Compare | Compares this ModelPath with another |
| Dispose |
| GetModelGUID | A GUID identifying the Revit cloud model. |
| GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. |

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace