# InSessionPrintSetting Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InSessionPrintSetting Methods
InSessionPrintSetting Class See Also
---
The InSessionPrintSetting type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace