# ConfigurationReloadInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConfigurationReloadInfo Methods
ConfigurationReloadInfo Class See Also
---
The ConfigurationReloadInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetConnectivityValidation | Returns information about the post-reload connectivity validation. |
| GetCustomDataChangedElements | Gets a list of ElementIds of fabrication parts that had custom data updated during the reload. |
| GetOutOfDatePartStatus | Access reload information for out of date part. |

# See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace