# SlabShapeVertexArrayIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabShapeVertexArrayIterator Properties
SlabShapeVertexArrayIterator Class See Also
---
The SlabShapeVertexArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
SlabShapeVertexArrayIterator Class
Autodesk.Revit.DB Namespace