# EdgeEndPoint Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeEndPoint Methods
EdgeEndPoint Class See Also
---
The EdgeEndPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |
| Evaluate | Evaluate the end point of the edge in 3d coordinates. |

# See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace