# DocumentOpeningEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentOpeningEventArgs Properties
DocumentOpeningEventArgs Class See Also
---
The DocumentOpeningEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DocumentType | Type of the document, e.g. Project or Template. |
| PathName | Path of the document to be opened. |

# See Also
DocumentOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace